[{"name":"accommodate","trans":["vt. accommodate; provide accommodation to...; adapt, conform to the tense: accommodated, accommodating, accommodates Adjective: accommodati..."]},{"name":"adverse","trans":["adj. unfavorable; opposite; hostile adverb: adverse noun: adverseness"]},{"name":"ailment","trans":["n.Minor illness; anxiety"]},{"name":"airborne","trans":["adj. Air transportation; airborne; wind medium"]},{"name":"alcohol","trans":["n.Alcohol; alcohol; alcoholic beverages"]},{"name":"alert","trans":["vt. alert, make aware; warn; adj. alert, alert; careful; n. alert; alert, alert alertABBr. Alcohol Level Evaluation Roadsid..."]},{"name":"alien","trans":["adj. foreign, alien; strange; of a different nature; n. alien, alien, outsider; alien tense: aliened, aliening, aliens"]},{"name":"amass","trans":["vt. accumulate, accumulate tense: amassing, amasses Noun: amassing"]},{"name":"anxiety","trans":["n. Anxiety; worry; desire; anxious things"]},{"name":"approve","trans":["vt. Approve; approve; provide evidence for...; vi. approval; approval; satisfaction tense: approved, approved adjective: approvable..."]},{"name":"array","trans":["n. Clothes; arrangement, array; large batch, series; array, array; vt. Arrange, deploy; dress up tense: arrayed, arraying, arrays"]},{"name":"authentic","trans":["adj. really, really; reliable, believable adverb: authentically"]},{"name":"automatic","trans":["adj. automatic; unthinking, unconscious; inevitable; n. A machine or device capable of operating automatically Adverb: autonomous Noun: automaticity"]},{"name":"autonomy","trans":["n. Autonomy, autonomy Noun: autonomist"]},{"name":"beforehand","trans":["Adv. advance, advance"]},{"name":"blast","trans":["n. Explosion; shock wave; burst; vi. Onslaught; vt. wither; damage; explosion Tense: blasted, blasted, blasted Noun: blaster"]},{"name":"bolt","trans":["n. Lightning; bolts; latches; crossbows; vt. Swallow; upper latch; vi. run away; rush out; adv. upright; abrupt tense: bolted, bolting, bolts"]},{"name":"bother","trans":["vt. annoy, disturb; make... uneasy; annoy...; vi. worry; worry, trouble; n. trouble; trouble tense: bothered, bothering, bothers"]},{"name":"bound","trans":["vi. Jump; bounce back; vt. Give... demarcate, limit; n. Jump, jump, leap; limit, range; adj. bound, bound; certain, bound; going, ready to go tense: bounded, bound..."]},{"name":"buffet","trans":["n. Attack; commissary; violent shock; buffet; vt. Wrestle with...; continuous slams; vi. Struggle; forge ahead courageously; adj. Buffet; buffet tense: buffeted, buffeting, bu..."]},{"name":"captive","trans":["adj. captive; enchanted; n. captive; infatuated"]},{"name":"catalogue","trans":["n. Contents, Lists; Series; vt. Catalogue and register categories for..."]},{"name":"ceremony","trans":["n. Ceremony, ceremony; etiquette, liturgy"]},{"name":"circular","trans":["adj. circular; circular; n. notice, notice Noun: circularity Adverb: circularity"]},{"name":"clarity","trans":["n. Clear, clear; transparent"]},{"name":"classification","trans":["n. Classification, classification; category, category adjective: classificatory"]},{"name":"clientele","trans":["n. Client; customer, customer"]},{"name":"cluster","trans":["n. Strings, clusters; groups, groups; vt. & vi. concentrated tense: clustered, clustering, clusters"]},{"name":"commit","trans":["vt. crime; mistake; promise; binding oneself; entrustment; delivery tense: committed, committing"]},{"name":"conceal","trans":["vt. hide; conceal tense: concealed, concealing, conceals Noun: concealer Noun: concealment"]},{"name":"concrete","trans":["adj. Real, concrete; tangible; concrete; vi. condensation; vt. Build with concrete; let it solidify; n. Condensate; specific tenses: concreted, concreting, conc..."]},{"name":"confidential","trans":["adj. secret, confidential; indicating trust or closeness; performing confidential work Noun: confidentially"]},{"name":"confirmation","trans":["n. Prove, prove, confirm; conviction"]},{"name":"confront","trans":["vt. encounter; compare; confront tense: criticized, confronted noun: experienced"]},{"name":"consensus","trans":["n. Agree, agree"]},{"name":"consolidation","trans":["n. Consolidate, strengthen, strengthen; unite; merge; strengthen"]},{"name":"constitute","trans":["vt. composition; establishment, formulation; elected, appointed tense: constituted, constituting"]},{"name":"consumerism","trans":["n. Consumerism; consumer interest protection Noun: consumerist"]},{"name":"convention","trans":["n. General Assembly; customs, practices; agreements, agreements"]},{"name":"correspond","trans":["vi. congruent, consistent; comparable, similar; communication tense: agreed, agreed"]},{"name":"craft","trans":["n. Craft; Craft; Spaceship; vt. crafting exquisitely tense: crafted, crafting, crafts Noun: crafter"]},{"name":"criterion","trans":["n. criteria, criteria adjective: criteria plural: criteria"]},{"name":"curiosity","trans":["n. Curiosity, a penchant for inquiring; strange people, strange objects, treasures"]},{"name":"cushion","trans":["n. Cushion, cushion tense: cushioned, cushions Adjective: cushiony"]},{"name":"deadly","trans":["adj. fatal; deadly; extraordinary; adv. very; like death Comparative level: deadlier, deadliest Noun: deadliest"]},{"name":"deliberately","trans":["Adv. carefully; carefully; intentionally, deliberately; calmly and unhurriedly"]},{"name":"delicate","trans":["adj. delicate; fragile; light and tasty; soft; fine, elegant; delicate adverb: delicately Noun: delicateness"]},{"name":"digest","trans":["vt. Digestion; absorption; fusion; vi. digestion; n. summary; abstract tense: digested, digesting, digests"]},{"name":"discrepancy","trans":["n. Discrepancy, incompatibility; inconsistency"]},{"name":"dismiss","trans":["vt. let... leave; fire; dismiss; fire; vi. dismissed, dismissing, dismisses adjective: dismissed..."]},{"name":"dispense","trans":["vt. dispense, distribute; administer, trial; dispense; dispense timing: dispensed, dispense"]},{"name":"displace","trans":["vt. replace; replace; transfer; remove...; dismiss; drain tense: displaceable, displaces Adjective: displaceable Noun: d..."]},{"name":"district","trans":["n. Region; administrative district; local tense: districted, districting, districts"]},{"name":"drain","trans":["vi. Drain; let dry; vt. drink up, drain; drain; drain water; n. Drain; drain; drain; sewer, drain; adjective: draining, drains"]},{"name":"duplicate","trans":["n. Exactly the same thing, copy; adj. Exactly the same, copied; vt. copy; copy tense: duplicated, duplicated"]},{"name":"dweller","trans":["n. Residents, residents"]},{"name":"emit","trans":["vt. emit, radiate; distribute; publish EmitabBR. Induction Tweeter Electromagnetic Induction Tweeter Tweeter Tense:, emittin..."]},{"name":"enclose","trans":["vt. enclose...; enclose... in an envelope, attach to the tense: enclosed, encased, enclosed"]},{"name":"erect","trans":["adj. erected, upright, upright; vt. erect; erect; 'positive' establish tense: erectly, erects adverb: erectly"]},{"name":"evident","trans":["adj. Obvious, Understandable"]},{"name":"exaggerate","trans":["VT. & vi. expand, increase; exaggerate, exaggerate tense: exaggerate, exaggerate adverb: exaggerate..."]},{"name":"excess","trans":["n. Uncontrolled; excessive, excessive; excessive; adj. extra, excessive; additional tense: excesses, excesses"]},{"name":"exert","trans":["vt. use, play; exert influence on tense: exerted, exerting, exerts"]},{"name":"explicit","trans":["adj. detailed, unequivocal, explicit; outspoken, unconcealed, explicit adverb: unabashed"]},{"name":"faith","trans":["n. Faith; Trust; Faith Faith; Faith Faith"]},{"name":"fantastic","trans":["adj. absurd, bizarre, eccentric; enormous, extraordinary; excellent, excellent, amazing Noun: fantasticity Adverb: fantasticity"]},{"name":"fare","trans":["n. Fees, fares; passengers; food; vi. eat, eat; progress, encounter tense: fared, faring, fares Noun: farer"]},{"name":"fascinating","trans":["adj. Charming, extremely attractive"]},{"name":"feat","trans":["n. Technical performance; merit, feat; adj. Appropriate; dexterous comparative level: feater, featest adverb: featly"]},{"name":"fertile","trans":["adj. prolific, plentiful noun: fertileness"]},{"name":"fluid","trans":["adj. flowing; unfixed; smooth; n. fluid; liquid noun: fluidity"]},{"name":"fragment","trans":["n. Fragments; fragments or incomplete parts; vt. Make it to pieces; vi. Fracture or Fracture Tense: fragmented, fragmenting, fragments"]},{"name":"galaxy","trans":["n. Galaxy; Milky Way, Milky Way; Group"]},{"name":"genre","trans":["n. Genre; genre; genre painting; adj. A genre painting; one with the theme of everyday scenes"]},{"name":"glow","trans":["vi. burning; burning; blushing; blushing; body heat; n. light, radiance; blush, heat; passion; intense emotional tense: glowing, glows"]},{"name":"glue","trans":["vt. Adhesion; sticks to it like glue; n. Glue; various adhesives Tense: glued, glued, glues Adjective: gluey"]},{"name":"govern","trans":["VT. & vi. Domination; vt. control; dominant tense: govern, governs adjective: governable"]},{"name":"grand","trans":["adj. magnificent; luxurious; extremely important; n. grand piano; one thousand dollars Comparative grade: grander, grandest Adverb: grandly Noun: grandness"]},{"name":"handout","trans":["n. Dissemination materials; printed materials issued by class teachers; written materials; handouts"]},{"name":"harden","trans":["vi. Harden, become strong; become strong; become ruthless; vt. harden...; make... strong; make... cold; make... insensitive Harden Harden tense: hardened, hardened, hardens"]},{"name":"hemisphere","trans":["n. Hemisphere; Earth's hemisphere adjective: hemispheric"]},{"name":"hospitality","trans":["n. Attentive, hospitable; hospitality for food and lodging"]},{"name":"humpback","trans":["n. Humpbacked; humpback whale adjective: humpbacked"]},{"name":"identification","trans":["n. Identification, verification, recognition; proof of identity; recognition"]},{"name":"imagery","trans":["n. Metaphor; imagery; visualization"]},{"name":"immense","trans":["adj. immense, enormous adverb: immensely"]},{"name":"impair","trans":["vt. weaken; damage; reduce tense: weaken, impairs Noun: weaken"]},{"name":"inevitable","trans":["adj. unavoidable, inevitable; “injustice” always happens, as always, common noun: inevitability adverb: inevitable"]},{"name":"informative","trans":["adj. Informative; adv. Informative placemonym: informativeness"]},{"name":"inspection","trans":["n. Inspection, inspection"]},{"name":"instinct","trans":["n. Instincts, intuition; nature; adj. Full of"]},{"name":"intact","trans":["adj. complete; untouched; undamaged Noun: intactness"]},{"name":"intention","trans":["n. Intent, intention; purpose; intention"]},{"name":"intersection","trans":["n. crossing; crossing; intersection, intersection"]},{"name":"kit","trans":["n. Clothing and equipment; kits; supporting elements"]},{"name":"licence","trans":["n. License, Permit; License; v. License; License; License Issuance Status: licences, licences, licences"]},{"name":"limitation","trans":["n. Limitations; limits, limits"]},{"name":"lobby","trans":["n. Foyer, lobby; parliamentary lounge; group lobbying for MPs; vt. & vi. lobbying for... Noun: lobbyism"]},{"name":"logo","trans":["n. Trademarks, Logos; Logos Language"]},{"name":"loose","trans":["adj. Unsolid; imprecise; loose; loose; vt. Release; fire a ship; fire a gun; vi. Loosen up; open fire; adv. loosely; n. indulgent; laissez; launch Comparative level: looser, looses..."]},{"name":"marvellous","trans":["adj. incredible, amazing, amazing; 'mouth' excellent, wonderful"]},{"name":"metropolitan","trans":["adj. cosmopolitan, metropolitan; centrally located, authentic"]},{"name":"mitigate","trans":["vt. Mitigate, mitigate; vi. reduce, ease down tense: mitigated, mitigated Adjective: mitigable Noun:..."]},{"name":"moisture","trans":["n. Humidity; moisture; rainfall; humidity"]},{"name":"multiple","trans":["adj. diverse; many; multiple; n. parallel; multiple"]},{"name":"norm","trans":["n. Norms, Benchmarks; Quotas, Allocated Workload"]},{"name":"nourish","trans":["vt. nurture, feed, nourish; maintain, grow tense: nourished, nourished"]},{"name":"obligation","trans":["n. Obligations; Responsibilities"]},{"name":"officially","trans":["Adv. Officially, officially"]},{"name":"opt","trans":["vi. Select optabBR. Files automatically generated by the VC development environment to store various options in Workspace. Tense:, opting, opts"]},{"name":"originate","trans":["vi. Originated from, produced; vt. create, invent, pioneer; tense of invention: originating, originating; noun: origination..."]},{"name":"overhead","trans":["adj. off the ground; above the head; above the ground, overhead; adv. Overhead; in the air; upstairs; n. Funding"]},{"name":"overlap","trans":["n. Overlap; repetition; vi. Partial overlap; partial simultaneous occurrence; vt. Overlapping with; occurring simultaneously with... tense: overlapped, overlapsed, overlaps"]},{"name":"overview","trans":["n. Overview; overview"]},{"name":"passport","trans":["n. Passports, passes; means"]},{"name":"pat","trans":["VT. & vi. Tap; take a picture; n. tap; tap the sound made by tapping something; small group, small piece; adj. Exact; Appropriate; Too Fast; Clever PAT Page Allocation Form Pat Tense:..."]},{"name":"patent","trans":["vt. Obtain a patent for...; grant a patent; adj. patented; novel; obvious; n. patent; patented product; license tense: patented, patenting, patent noun..."]},{"name":"payable","trans":["adj. payable; payable; due; profitable"]},{"name":"persuade","trans":["VT. & vi. persuade, persuade tense: persuaded, persuaded adjective: persuadable noun: persuader"]},{"name":"photography","trans":["n. Photography"]},{"name":"pitched","trans":["adj. The one with a slope"]},{"name":"plantation","trans":["n. Plantations, large farms"]},{"name":"plot","trans":["n. Storyline; planning, plot; small plot of land; vt. Break... into small pieces; divide; draw; mark; vt. & vi. Conspiracy tense: plotted, plotting, plots"]},{"name":"prefrontal","trans":["adj. anterior frontal lobe, frontal"]},{"name":"prehistoric","trans":["adj. prehistoric"]},{"name":"preservation","trans":["n. Save, preserve, preserve"]},{"name":"proceed","trans":["vi. move forward; proceed; continue tense: procure, procure, proceed"]},{"name":"profound","trans":["adj. profound; profound; profound; knowledgeable, insightful, esoteric comparative level: profounder, profoundest adverb: profoundly"]},{"name":"prolong","trans":["vt. procrastination; lengthening tense: procrastination, procrastination, delays"]},{"name":"punishment","trans":["n. Punish, be punished"]},{"name":"recruit","trans":["n. Recruits; New Members; vt. Recruit; attract; recruit someone as a new member; vt. & vi. Recruit, recruit; restore health, restore physical strength; tense: recruit, recruit..."]},{"name":"refund","trans":["n. Returns, reimbursements, refunds; vt. return, refund tense: refunded, refunds adjective: refundable Noun: r..."]},{"name":"relevance","trans":["n. Relevance; pertinence"]},{"name":"relief","trans":["n. mitigation, release; relief; comfort"]},{"name":"reluctant","trans":["adj. reluctant, reluctant adverb: reluctantly"]},{"name":"renewed","trans":["adj. revived; renewed; reconstructed; v. renewed; restored"]},{"name":"reproduce","trans":["VT. & vi. copy; reproduce; reprint; reproduction, breeding tense: reproduced, reproduced Noun: reproducer Noun:..."]},{"name":"rigorous","trans":["adj. strict; meticulous; strict, severe adverb: rigoralizing Noun: rigoralizing"]},{"name":"ritual","trans":["n. Ceremony; practice; etiquette; adj. ceremonial; ceremonial; routine adverb: ritualistic"]},{"name":"routine","trans":["n. Routine; daily work; procedures; adj. everyday; routine adverb: routinely Noun: routinism Noun: routinist"]},{"name":"sail","trans":["vi. sailing; setting sail, setting sail; n. sail, tent; sailing; vt. Sailing timing: sailed, sailing, sails"]},{"name":"salespeople","trans":["n. Salesperson, clerk"]},{"name":"scarce","trans":["adj. scarce, rare comparative grade: scarcer, scarcest"]},{"name":"scholar","trans":["n. Scholars; scholarship recipients"]},{"name":"semantic","trans":["adj. semantic; semantic"]},{"name":"serial","trans":["adj. continuous; serialized; instalment; n. serial novel; television series; periodical adverb: serially"]},{"name":"shatter","trans":["vt. Break; break; break apart; shatter; destroy; vi. crushed; damaged; fallen leaves; n. fragmentation; messy state tense: shattered, shattering, shatters"]},{"name":"shelf","trans":["n. Shelf; shelf; shelf-like object Noun: shelfful"]},{"name":"silt","trans":["n. Silt, sediment; pulverized coal; residue; vi. Silted, blocked; blocked by silt; vt. blocking; charging tense: silted, silting, silts Noun: siltatio..."]},{"name":"soar","trans":["vi. soaring; soaring; soaring; soaring; standing tense: soared, soaring, soars Noun: soarer"]},{"name":"split","trans":["vt. split; separate; separate; leave; vi. being split; breaking a relationship; leaving; n. fissure; split; adj. Split split tense: split, splitting, sp..."]},{"name":"squash","trans":["vt. Flatten, crush, crush; squeeze to a certain side; harshly shut; squeeze in; calm; suppress; uniform; n. crowded crowd; soda; wall tennis, squash tense: squashed, squashing, s..."]},{"name":"squeeze","trans":["VT. & vi. Squeeze, pinch; vt. Squeezing, squeezing, pinching; n. squeezing, pinching; friendly hugs or handshakes; crowding, backlog; difficulties or hardships due to lack of money or time, etc. Situation: s..."]},{"name":"stack","trans":["n. One stack, one pile; many; many; a large pile; a large stack; a large chimney; library; stack; v. put in a neat stack; place the code in...; hover in layers waiting to land; in place; in place; the situation is right... Unfavorable tense:..."]},{"name":"stomach","trans":["n.Stomach; appetite; abdomen; vt. Tolerate; eat; vi. Tolerate tenses: stomached, stomachs, stomachs"]},{"name":"straightforward","trans":["adj. upright, candid; honest; simple; easy to understand adverb: straighforwardly noun: straighforwardness adverb: strai..."]},{"name":"strain","trans":["n. Tension; Tension; Burden; Sprain; Blood vi. Tighten up; try your best vt. strain; abuse; filter out; try; tense: strained, strained"]},{"name":"sudden","trans":["adj. sudden, unexpected; quick; n. something that happened suddenly Adverb: sudden noun: suddenness"]},{"name":"sufferer","trans":["n. Victims; Victims; Sick"]},{"name":"surge","trans":["n. Overflowing, unrestrained; raging like waves; vi. swarming; overflowing; surging, surging; surging; surging"]},{"name":"sustain","trans":["vt. bear, support; maintain; maintain for a long time; continue; endure, suffer tense: sustain, sustain Noun: sustainability..."]},{"name":"symptom","trans":["n. Signs; symptoms"]},{"name":"tackle","trans":["vt. Resolve; respond; vt. & vi. catch; knock over; n. interception; grackle; tool, instrument, tool; pulley, pulley set tense: tackled, tackling, tackles Noun:..."]},{"name":"texture","trans":["n. Touch, texture, texture Tense: textured, textured Adjective: textured"]},{"name":"topsoil","trans":["n. Topsoil; tillage timing: topsoiled, topsoiled, topsoiled"]},{"name":"trance","trans":["n. Trance; astonished; fascinated, fascinated; vt. trance; trance; trance, trance"]},{"name":"transmit","trans":["VT. & vi. Launch, broadcast, broadcast; vt. transmission; transmission tense: transmission, transmission"]},{"name":"transparent","trans":["adj. transparent; an adverb with a clear, obvious meaning: transparent"]},{"name":"triple","trans":["adj. triple; tripartite; n. Triple; set of three; vi. Tripled; vt. Make it three times the tense: tripled, tripled, triples"]},{"name":"tune","trans":["n. Tune, tune; vt. & vi. Tuning; vt. Adjust the timing: tuned, tuning, tunes"]},{"name":"ultimate","trans":["adj. Last, ultimate; ultimate; extreme; best; fundamental; basic; foundational; n. best thing; essence; extreme; limit; highest example"]},{"name":"unbiased","trans":["adj. unbiased; just noun: unbiasedness"]},{"name":"undergo","trans":["vt. experience, endure; endure the tense: underwent"]},{"name":"undermine","trans":["vt. Digging a hole or channel under something; eroding the foundation of...; secretly destroying; gradually weakening the tense: undermining, undermining, undermines"]},{"name":"unprecedented","trans":["adj. unprecedented, unprecedented adverb: unprecedentedly"]},{"name":"update","trans":["vt. update; correct, revise; modernize; n. Update; modernize tense: updated, updates"]},{"name":"utilise","trans":["vt. Use; Use"]},{"name":"viable","trans":["adj. able to nourish; fertile; viable noun: viability"]},{"name":"vigilance","trans":["n.Alertness; alertness; alertness; insomnia; wakefulness"]},{"name":"violence","trans":["n. Intense; violence; violation; distortion"]},{"name":"weave","trans":["VT. & vi. knit; weave; vt. Arrangement, fictional tense: wove woven weaving, weaves"]},{"name":"wreck","trans":["n. Accidents; wrecks; destruction; people who have lost health; vt. Destroy; wreck; demolish; vi. wreck; rescue wrecked ship tense: wrecked, wrecking, wrecks"]},{"name":"yacht","trans":["n. Speedboat, sailboat, yacht tense: yachted, yachting, yachts"]}]