[{"name":"aback","trans":["Adv. backward; in a windy position; backward"]},{"name":"abandonment","trans":["n. abandonment; abandonment; abandonment; laissez-faire"]},{"name":"absorption","trans":["n. Absorption; absorption process; absorption effect; focus, concentration; integration; assimilation; dissolution of nutrients into blood or lymph Adjective: absorptive Noun: absorptivity"]},{"name":"accordance","trans":["n. Consistent, Harmonious, and Conformed"]},{"name":"accountant","trans":["n. Accountants, accountant noun: accountancy"]},{"name":"accredited","trans":["adj. Acceptable, Trustworthy, Recognized, Qualified"]},{"name":"adjacent","trans":["adj. neighboring"]},{"name":"adjunct","trans":["n. Attachments, helpers; adj. subsidiary noun: adjunction adjective: adjunctive"]},{"name":"affair","trans":["n. Matters; affairs; private matters; pompous matters"]},{"name":"aggregate","trans":["n. 'Positive' numbers, total; vt. Total up to...; vt. & vi. Aggregating tense: aggregating, aggregating, aggregates Adverb: aggr..."]},{"name":"alarming","trans":["adj. frightening; disturbing"]},{"name":"albeit","trans":["conj. even; although"]},{"name":"alphabetically","trans":["Adv. Place in alphabetical order"]},{"name":"amateur","trans":["adj. amateur, non-professional; layman; n. amateur; layman, raw noun: amateurism"]},{"name":"ambiguous","trans":["adj. Ambiguous; ambiguous, vague"]},{"name":"ambition","trans":["n. Ambition, ambition; ambition, ambition; vt. Have... ambition; pursuit"]},{"name":"amend","trans":["vt. Improve, improve; modify; vi. correction, improvement; change from the new tense: amending, amends"]},{"name":"amused","trans":["adj. laughed at; amused; playful; amused; made someone happy"]},{"name":"analogy","trans":["n. Similar, similar; analogy, analogy"]},{"name":"anecdote","trans":["n. Accidental facts, anecdotes"]},{"name":"annoying","trans":["adj. obnoxious; annoying, annoying adverb: annoyingly"]},{"name":"antidote","trans":["n. Antidotes, antidotes; means of countermeasures, methods of correction; pesticide adjective: antidotal"]},{"name":"antique","trans":["adj. made in ancient times, antique; ancient; n. antiquing, antiquing tense: antiqued, antiquing, antiques"]},{"name":"apologise","trans":["VT. & vi. apology"]},{"name":"appeasement","trans":["n. Calm; mitigation; satisfaction; appeasement; appeasement policy; appeasement"]},{"name":"appointment","trans":["n. dating, agreement; appointment, delegation"]},{"name":"aptitude","trans":["n. Talent; natural talent; talent"]},{"name":"archive","trans":["v. archive; n. archive file verb: archive"]},{"name":"ascent","trans":["n. Ascent; ascent; uphill ascentABBR. Assembly System for Central Processor CPU Assembly System"]},{"name":"assembly","trans":["n. assembly; assembly, assembly"]},{"name":"astronaut","trans":["n. Astronauts, astronauts"]},{"name":"attachment","trans":["n. Attachment; Attachment; Attachment; Attachment; Connection; Installation; Attachment; Connection; Emotion, Affection; Loyalty; Seizure; Seizure Order"]},{"name":"awesome","trans":["adj. awesome; amazing; frightening; good; amazing"]},{"name":"awful","trans":["a. Terrible, solemn adverb: awfully Noun: awfulness"]},{"name":"backdrop","trans":["n. Backdrop; Background"]},{"name":"bargain","trans":["n. Deals; Contracts; Specials; vi. bargaining; transaction; vt. bargaining; bargaining with... Tense: bargaining, bargains Noun:..."]},{"name":"barrage","trans":["n. Fire networks; barrage; barrage fire; intercepted shooting; dam on the river; heavy artillery fire, heavy artillery fire, heavy rain of bullets; vi. Fire attack; vt. Attack tenses with intensive firepower: barraged, barraging, barr..."]},{"name":"barrier","trans":["n. Obstacles, barriers; boundaries; vt. Put... in the fence"]},{"name":"bead","trans":["n.Beads; rosaries; drops; vi. Form a bead and bubble; vt. Decorate with beads; make bead-like tense: beaded, beading, beads"]},{"name":"belt","trans":["n. Belt, belt; area, zone; vt. tie; punch; hit; vi. gallop; run tense: belted, belting, belts"]},{"name":"beneficiary","trans":["n. Beneficiaries; Beneficiaries; Salaried Pastors, Salaried Clergy; adj. bountiful; adjective to have a fiefdom: benefitted"]},{"name":"betray","trans":["vt. betrayal; betrayal; disclosure; disclosure... signs tense: betrayed, betrays Noun: betrayal Noun: betrayer"]},{"name":"biased","trans":["adj. biased; tendentious; one-sided; biased; biased"]},{"name":"biographer","trans":["n. Biographer"]},{"name":"bizarre","trans":["adj. bizarre noun: bizarrely"]},{"name":"blaze","trans":["n. Flame, blaze; shine, shine; burst, burst; vi. burning violently; glowing, shining Tense: blazed, blazing, blazes"]},{"name":"blossom","trans":["vi. flowering; prosperity; development; n. flower; flowering period; flourishing period; state of flowering tense: blossomed, blossoming, blossom adjective: blossomy"]},{"name":"bold","trans":["adj. brave, fearless; reckless, reckless; obvious, striking; bold, bolded comparative grade: bolder, boldest adverb: boldly Noun: b..."]},{"name":"bonding","trans":["n. Bonding; pressure welding; adj. bonded; bonded; v. linked; bonded"]},{"name":"bracelet","trans":["n.Bracelets"]},{"name":"brew","trans":["vt. brewing; brewing; vi. Winemaking; being brewed; about to happen; n. Beer; texture tense: brewed, brewing, brews Noun: brewing Noun: brewing Noun:..."]},{"name":"browse","trans":["vi. grazing; casually looking through the tense: browsed, browsing, browses Noun: browser"]},{"name":"bucket","trans":["n. Bucket; bucket, bucket; volume of a bucket; v. pouring down; bumpy running tense: bucketed, bucketing, buckets"]},{"name":"bulletin","trans":["n. Announcements, communiqués; vt. Announcement, announcement timing: bulletined, bulletining, bulletins"]},{"name":"burden","trans":["n. Burden; liability; ship's cargo capacity; vt. annoy; burden; load in the tense: burdened, burdening, burdens"]},{"name":"canteen","trans":["n. Kiosks, cafeterias; kettles, jugs"]},{"name":"capsule","trans":["n. Capsule; space capsule; capsule; small container; adj. compressed; summary; vt. Brief description; compression tense: capsulated, capsulated, encapsulated"]},{"name":"carnival","trans":["n. Carnivals, carnivals; drinking parties"]},{"name":"casualty","trans":["n. Accidents; Casualties; Emergency Rooms"]},{"name":"cellular","trans":["adj. cellular; porous; composed of cells; n. mobile phone; unit noun: cellularity"]},{"name":"cemetery","trans":["n. Cemeteries; cemeteries"]},{"name":"champion","trans":["n. Champion; defender, supporter tense: championed, championed, champions"]},{"name":"charcoal","trans":["n.Charcoal, charcoal Tense: charcoaled, charcoaling, charcoals"]},{"name":"charter","trans":["vt. charter; grant of a licence; charter; n. charter; charter; charter; tense: chartered, chartering; charterer Noun: charterer"]},{"name":"chemistry","trans":["n.Chemistry"]},{"name":"chilled","trans":["adj. Frozen; cold; hard; slow to quench; v. makes cold"]},{"name":"chip","trans":["n. Debris; Gaps; French Fries; IC Chips; vt. & vi. Cut out the pieces Tense: chipped, chipping, chips Noun: chip"]},{"name":"chronology","trans":["n. Geochronology; chronology, chronology Noun: chronologist"]},{"name":"clash","trans":["VT. & vi. Make an impact sound; vi. clash; conflict; mismatch; inconsistency; n. harsh impact sound; incoordination; conflict tense: clashed, clashing, clashes"]},{"name":"clutter","trans":["n. Clutter, confusion; vt. make a mess; fill up the tense indiscriminately: cluttered, cluttering, clutters"]},{"name":"coherent","trans":["adj. clear, coherent; consistent adverb: coherent"]},{"name":"cohesion","trans":["n. Cohesiveness; bonding; cohesiveness Adjective: cohesiveness Noun: cohesiveness"]},{"name":"coin","trans":["n. Coin; vt. manufacture coins; tense of creation: coined, coining, coins Noun: coiner"]},{"name":"combustion","trans":["n. Burn, burn adjective: combustive"]},{"name":"command","trans":["vi. command, command; control; vt. command, command; control; vision; n. command; command; command, control tense: commanded, commanding, commands"]},{"name":"commerce","trans":["n. Commerce, trade"]},{"name":"compatible","trans":["adj. An adverb that can coexist, compatible, and harmonize: compatibly"]},{"name":"comply","trans":["vi. Promise; obey; obey the tense: complied, complies"]},{"name":"computational","trans":["adj. computed"]},{"name":"configuration","trans":["n. Structure, shape, appearance, outline"]},{"name":"consecutive","trans":["adj. continuous, coherent adverb: u"]},{"name":"cooperation","trans":["n. Cooperative term: cooperationist"]},{"name":"coordinator","trans":["n. Coordinators; equal people"]},{"name":"correlation","trans":["n. Mutual relationships"]},{"name":"credentials","trans":["n. Qualification certificate; certificate; qualification"]},{"name":"crowd","trans":["n. Crowd; audience; group, batch; bunch; vt. & vi. Crowded, crowded; vt. overcrowded; forced tense: crowded, crowding, crowds Noun:..."]},{"name":"cube","trans":["n. Cube; cube; dice; vt. make a square; multiply by two times; volume tense of quantity...: cubed, cubing, cubes Noun: cuber"]},{"name":"cumulative","trans":["adj. cumulative, incremental adverb: cumulatively"]},{"name":"currency","trans":["n. Currency; currency"]},{"name":"debris","trans":["n. Scattered debris, debris"]},{"name":"decay","trans":["vi. decay, decay; decay, decay; n. decline, decay; decay, decay; vt. Decay, cause corruption; cause decay, cause decay Tense: decayed, decaying"]},{"name":"decompose","trans":["VT. & vi. Get bad, rot; vt. decomposing tense: decomposing, decomposing Noun: decomposability..."]},{"name":"dedicated","trans":["adj. dedicated; dedicated; dedicated"]},{"name":"deficiency","trans":["n. Lack, shortage"]},{"name":"deficit","trans":["n. Deficits; Deficits, Deficits, Losses"]},{"name":"delete","trans":["vt. delete tense: deleted, deleted"]},{"name":"denounce","trans":["vt. denounce; denounce; blatantly criticize; proclamation abolish tense: denounce, denounce"]},{"name":"deny","trans":["vt. denies knowledge; denies tense: denied, denied"]},{"name":"deserve","trans":["vi. Deserved, deserved; vt. deserved, deserved tense: deserved, deserved, deserved"]},{"name":"dessert","trans":["n. After-meal dessert; sweet snack"]},{"name":"deter","trans":["vt. stop, stop; dispel thoughts Tense: deterred, deterring, deters Noun: determent Adjective: deterrable"]},{"name":"devoid","trans":["adj. lacking; none at all"]},{"name":"diagnosis","trans":["n. 'Medical' diagnosis method; diagnosis conclusion"]},{"name":"dictate","trans":["VT. & vi. Speak or read aloud; dictate; vt. instruction; specification; instruction; n. Command, provision, requirement tense: dictated, dictates"]},{"name":"disapprove","trans":["vi. disapproved tense: disapproved, disapprovingly adverb: disapprovingly"]},{"name":"discerning","trans":["adj. discerning; discerning; discerning"]},{"name":"disclose","trans":["vt. disclosure; disclosure tense: disclosing, disclosing, disclosing"]},{"name":"disorderly","trans":["adj. messy, messy; obstructing public order, creating chaos; lawless; n. chaos, cluttering Noun: disorderliness"]},{"name":"dispersal","trans":["n. Dispersion, dispersion, dispersion, evacuation"]},{"name":"disposable","trans":["adj. Throw away after one use; disposable; freely disposable"]},{"name":"dispute","trans":["vt. Debate; block; resist; doubt; vi. dispute; n. debate; quarrel tense: disputed, disputing; dispute Noun: arguer"]},{"name":"disrespectful","trans":["adj. disrespectful, disrespectful"]},{"name":"disseminate","trans":["vt. dispersion, dissemination tense: thinned, disseminated Noun: dispersed Noun: dis..."]},{"name":"distorted","trans":["adj. distorted, misinterpreted"]},{"name":"disturbance","trans":["n. Disturbing; disturbing; disturbing; disturbing"]},{"name":"domesticated","trans":["adj. Loves family life; domesticated"]},{"name":"doomsday","trans":["n. Armageddon; Last Judgment Day Doomsdayn. Last Judgment Day, Armageddon"]},{"name":"dripping","trans":["n.Drops, drops, drops, oil drops"]},{"name":"dub","trans":["vt. Voice over; grant a title; tap; strike; n. Idiot; drumming tense: dubbed, dubbing, dubs Noun: dubber"]},{"name":"durable","trans":["adj. durable, long-lasting; n. Durable adverb: durably"]},{"name":"edible","trans":["adj. edible; n. food; food"]},{"name":"edition","trans":["n. Edition, edition"]},{"name":"elastic","trans":["adj. elastic; easily retractable; flexible; n. elastic band; rubber ring adverb: elusive"]},{"name":"elevated","trans":["adj. elevated; elevated; high; high-rise; noble, sublime; uplifting, joyful; n. Elevated railways"]},{"name":"embed","trans":["vt. cultivate; embed, insert; keep in mind tense: embedded, embedding, embeds Noun: embedment"]},{"name":"embrace","trans":["VT. & vi. Hug; vt. include; include; accept; believe, convert; n. hug, embrace tense: embraced, embraces adjective: embr..."]},{"name":"emulate","trans":["vt. compete with..., try to catch up with the tense: emulated, emulated, emulated adjective: emulated adverb: emulsified name..."]},{"name":"encase","trans":["vt. Put... in the box; pack... tense: encased, encased, encases Noun: encasement"]},{"name":"encompass","trans":["vt. surround; encircle tense: encompass, encompass"]},{"name":"endeavour","trans":["n. (English) Do your best, do your best"]},{"name":"enforcement","trans":["n. Enforce, enforce, enforce"]},{"name":"engross","trans":["vt. focus fully; write in large print; formally written; exclusive; attract tense: engaged, engrossing, engrosses"]},{"name":"enlarge","trans":["vi. expand; enlarge; detail; vt. increase; expand; expand tense: increasing, expanding Noun: enlarger"]},{"name":"envisage","trans":["vt. Facing up; imagining the tense: confronting, imagining"]},{"name":"epic","trans":["adj. Epic, epic poem; n. Epic; Epic; Epic work EpicaBBR. Earth-pointing Instrument Carrier Earth-pointing instrument carrier satellite"]},{"name":"equity","trans":["n. Fair, just; common stock; equity law; net value of encumbered assets"]},{"name":"era","trans":["n. Era; Era; Era EraAbBr. Electrical Research Association ERaABBr. Electrical Research As..."]},{"name":"esteem","trans":["vt. think; respect; consider; evaluate; n. respect; respect tense: esteemed, esteeming, esteems"]},{"name":"ethical","trans":["adj. ethical; ethical; sold by prescription; n. prescription drug adverb: ethically"]},{"name":"ethnographer","trans":["n.Ethnographers, ethnographers"]},{"name":"evoke","trans":["vt. generate, cause, evoke tense: evoked, evokes adjective: evocable"]},{"name":"exempt","trans":["vt. exempt; exempt; adj. Exempted; exempted; n. exempt; exempt from duty tense: exempted, exempt, exempt adjective: exemp..."]},{"name":"exhale","trans":["VT. & vi. exhaled; exhaled tense: exhaled, exhaling, exhales"]},{"name":"fake","trans":["vt. Counterfeiting, tampering with, manipulating...; counterfeiting; vt. & vi. pretend; n. scammer; fake; adj. fake, impersonation tense: faked, faked"]},{"name":"fame","trans":["n. Fame, fame; rumors, legends; vt. make famous, make famous tense: famed, famed"]},{"name":"feeble","trans":["adj. weak, weak, weak comparative grade: feebler, feeblest Noun: feebleness Adverb: feebly"]},{"name":"fellow","trans":["n. Man; lad, guy; researcher, member; companion, comrade"]},{"name":"flee","trans":["vi. Run away, run away; vt. flee, escape tense: fleeing, flees Noun: fleer"]},{"name":"fluctuate","trans":["vi. fluctuating, fluctuating, fluctuating tense: fluctuating, fluctuating adjective: fluctuating noun: fluctuating..."]},{"name":"flush","trans":["v. Blush, redness; rinse; rinse; rinse; wash away; n. Flush, blush; a burst of strong emotion, a burst of passion; rush; a hand with the same flower; adj. Wealthy, very rich; completely in perfect tense: flushed, fl..."]},{"name":"forestry","trans":["n. Forestry; forestry; forest land"]},{"name":"fortnight","trans":["n. 2 weeks, 14 days"]},{"name":"forum","trans":["n. Forums, seminars; courts; open discussion squares"]},{"name":"fracture","trans":["n. Rupture, fracture; fracture; vi. rupture; break; vt. Fracture Tense: fractured, fracturing, fractures"]},{"name":"frustrating","trans":["adj. causing frustration; discouraging, discouraging"]},{"name":"fuzzy","trans":["adj. fuzzy; fuzzy; distorted comparative grade: fuzzier, fuzziest Noun: fuzziness"]},{"name":"gallop","trans":["n. Speeding; speeding; vi. Proceed rapidly; fly fast; speak in a hurry; vt. make it fly; transport quickly Tense: galloped, galloping, gallops Noun: gal..."]},{"name":"garret","trans":["n. Attic; top floor"]},{"name":"grateful","trans":["adj. thankful; pleasant, pleasant adverb: gratefully"]},{"name":"grip","trans":["n. Hold tight; grasp, control; understanding, control; grip, technique; hairpin; handle; vt. & vi. grip, grip; attract, cause tense: gripped, gripping, grips..."]},{"name":"guardian","trans":["n. Guardian, protector; guardian; adj. noun of guardianship: guardianship"]},{"name":"halve","trans":["vt. Divide... in half; divide... in half tense: halved, halving, halves"]},{"name":"handicap","trans":["n. Obstacles; Defects; Disabilities; Adverse Conditions for Stronger Opponents; vt. obstruct; impair; make movement and life abnormal tense: handicapped, handicapping, handicaps"]},{"name":"handy","trans":["adj. At hand, nearby; convenient; easy to obtain; agile Comparative level: handier, handiest Noun: handiness"]},{"name":"haphazard","trans":["adj. incidental, casual, unplanned adverb: haphazardly"]},{"name":"heaven","trans":["n.Paradise; sky; bliss"]},{"name":"heel","trans":["n. Heels; heel, heel; vt. & vi. Inclined tense: heeled, heeling, heels"]},{"name":"heighten","trans":["vt. Improve; strengthen; increase; make more significant; vi. heightened; heightened tense: heightened, heightened"]},{"name":"heredity","trans":["n. Heredity"]},{"name":"heroic","trans":["adj. heroic, heroic, heroic adverb: heroically"]},{"name":"hesitation","trans":["n. Hesitation, hesitation, reluctance; hesitation"]},{"name":"heyday","trans":["n. The most successful, prosperous, and most prosperous period"]},{"name":"hint","trans":["n. Hint; clue; vt. Implying; implying; vi. indicative tense: hinted, hinting, hints"]},{"name":"holistic","trans":["adj. full"]},{"name":"honour","trans":["n. Honor; Respect; Medal; vt. Respect; acceptance; acceptance of forward notes"]},{"name":"hop","trans":["vi. Bounce on one foot, jump; jump on; vt. Jump, skip; ride; n. Bounce, jump; dance; distance in one flight hopabBr. When high oxygen pressure is high..."]},{"name":"humble","trans":["adj. Humble, humble; lowly, humble; humble, humble; vt. humbleness, demeans comparative rank: humbler, humblest Noun: humbleness..."]},{"name":"humid","trans":["adj. humid; moist; humid"]},{"name":"hurl","trans":["vt. Throw away; throw hard; say indignantly; vi. slam throw; n. throw with force tense: hurled, hurling, hurls Noun: hurl Noun:..."]},{"name":"hypothetical","trans":["adj. hypothetical; hypothetical; to be proven Noun: hypothetical Adverb: hypothetically"]},{"name":"illuminate","trans":["vt. brighten; illuminate; decorate; explain, clarify tense: illuminated, illuminates adverb: illuminatingly"]},{"name":"immobile","trans":["adj. inmobile, immobile; inactive, static noun: immobility"]},{"name":"impersonal","trans":["adj. unaffected by personal emotions, callous; objective; n. unrelated to individuals; adv. coldly; objectively Noun: impersonality Adverb: impersonal"]},{"name":"implementation","trans":["n. Follow-up, implementation"]},{"name":"imply","trans":["vt. implied; implied; implied tense: implied, implied"]},{"name":"impractical","trans":["adj. unrealistic, useless, unrealistic; a term for not doing actual work well: impracticality"]},{"name":"inaccurate","trans":["adj. Wrong, incorrect; adv. imprecisely, inaccurately"]},{"name":"inappropriate","trans":["adj. inappropriate, inappropriate adverb: inappropriately"]},{"name":"incendiary","trans":["adj. arson, arson; inflammable; inflammatory noun: sensationalism"]},{"name":"indiscriminate","trans":["adj. indiscriminate, indiscriminate, undiscriminate, indiscriminate adverb: indiscriminately"]},{"name":"indispensable","trans":["adj. essential, necessary; n. indispensable adverb: indispensably"]},{"name":"indulge","trans":["vt. Satisfy; indulge in...; make happy; condone; vi. satisfy; indulge; indulge tense: indulged, indulges"]},{"name":"inefficient","trans":["adj. inefficient, inefficient, incompetent, incompetent adverb: incompetent"]},{"name":"inequity","trans":["n. Unfair, unjust"]},{"name":"infancy","trans":["n. Infancy; infancy; early life"]},{"name":"infest","trans":["vt. harassment; parasitism; mass infestation; mass breeding tense: infested, infests Noun: infestation"]},{"name":"inhale","trans":["vt. Inhale; binge eat and drink; vi. Inhalation timing: inhaled, inhaled"]},{"name":"insecure","trans":["adj. unsure; indecisive; unstable; unsafe adverb: insecticide Noun: dangerous"]},{"name":"intensify","trans":["VT. & vi. intensifying, intensifying tense: intensifying, intensifying Noun: intensifying"]},{"name":"interface","trans":["n. 'Meter' interface; interface, sub-interface InterfaceABBR. International Commercial Format for Automatic Commercial Ex..."]},{"name":"interference","trans":["n. Interfering; interfering; obstructing, interfering adjective: interferential"]},{"name":"intermediate","trans":["adj. intermediate; intermediate tense: intermediated, intermediates Noun: intermediacy Adverb:..."]},{"name":"intervening","trans":["adj. The one that occurred in between"]},{"name":"intrigue","trans":["vi. Engage in intrigues and tricks; vt. arouses the curiosity of...; n. Conspiracy, intrigue; conspiracy, trickery Timing: intrigued, intriguing Noun:..."]},{"name":"introspection","trans":["n.Reflection, introspection"]},{"name":"invoice","trans":["n. Invoices; Invoices; Goods; vt. invoice; note list tense: invoiced, invoiced, invoiced"]},{"name":"irony","trans":["n. Contradictions; objections; ironic situations; unexpected situations; ironic situations; ironic things"]},{"name":"irritable","trans":["adj. irritable, impatient adverb: reluctantly"]},{"name":"jeopardise","trans":["vt. jeopardize, damage"]},{"name":"knowledgeable","trans":["adj. knowledgeable; knowledgeable adverb: knowledgeably"]},{"name":"laden","trans":["adj. full; distressed; burdened; vt. loading; vi. loading; v. loading"]},{"name":"lateral","trans":["adj. lateral, transverse; n. side; side sound; vt. Horizontal pass tense: lateraled also lateralled lateraling lateralling lat..."]},{"name":"legally","trans":["Adv. legally; lawfully"]},{"name":"lesser","trans":["adj. Fewer; smaller; secondary; adv. less; smaller; less than A lesser"]},{"name":"lethal","trans":["adj. fatal, lethal; n. lethal factor Noun: lethality Adverb: lethally"]},{"name":"liaise","trans":["vi. Be a contact person; contact tense: liaised, liaised"]},{"name":"ligament","trans":["n.Ligament; bond, laceration Adjective: ligamental"]},{"name":"linger","trans":["vi. stay, wander; slowly disappear tense: lingered, lingering, lingers Noun: lingerer Adverb: lingeringly"]},{"name":"lip","trans":["n. Lips; margins; vt. Touch with lips; adj. Verbal; vi. Use lips LipabBr. Laser Integrated Periscope Laser Integrated Periscope Timing: l..."]},{"name":"livestock","trans":["n.Livestock, livestock"]},{"name":"lush","trans":["adj. Rich, luxurious; verdant; vi. drinking alcohol; n. alcoholic; alcohol; vt. Drink comparison level: lusher, lushest Adverb: lushly Noun:..."]},{"name":"manifest","trans":["vt. prove, indicate; show; vi. display, appearance; n. Passenger list; Bill of lading, bill of lading; adj. Understood; obvious, obvious tense: manifesting, ma..."]},{"name":"manuscript","trans":["n. Manuscripts, manuscripts, manuscripts; handwriting"]},{"name":"marital","trans":["adj. matrimony; marital adverb: maritally"]},{"name":"medieval","trans":["adj. second-hand, medieval"]},{"name":"mediocre","trans":["adj. average, average"]},{"name":"mercy","trans":["n. Kindness, tolerance; mercy; good fortune; good deeds"]},{"name":"minister","trans":["n. Ministers, ministers; ministers, diplomatic envoys; priests; vi. auxiliary; serving tense: ministered, ministered, servant"]},{"name":"miserable","trans":["adj. miserable, unfortunate, pathetic; distressing; unpleasant; poor; despicable, shameful, abominable Noun: miserable Noun: miserableness..."]},{"name":"misfortune","trans":["n. Misfortune, bad luck, adversity; misfortune, disaster"]},{"name":"mission","trans":["n. Mission; vocation; mission, travel; diplomatic missions, missions; diplomatic missions, mission locations; military operations; space missions; v. difficult long-distance travel situations: missioned, missionary..."]},{"name":"mock","trans":["VT. & vi. Fooling; mocking; vt. Be frustrated; adj. imitation; simulated tense: mocked, mocking, mocks Noun: mocker Adverb:..."]},{"name":"muddle","trans":["n. Confused; confused, cluttered; vt. mess up; make a mess; make a mess; vi. Deal with, mix the days; mix the days; get by; barely cope with the past; make confusion; confuse...; confuse...; mess up... whatever; make chaotic tense: m..."]},{"name":"mutual","trans":["adj. mutual, mutual; common, shared noun: mutualistic adverb: mutual"]},{"name":"mythology","trans":["n.Mythology; mythology"]},{"name":"necessity","trans":["n. Necessity; Needs; Necessity; Natural Laws"]},{"name":"neglect","trans":["vt. negligence; neglect; n. negligence, neglect; lazy tense: neglected, neglected"]},{"name":"neutral","trans":["adj. neutral, neutral; neutral; uncolored; n. neutral country; neutral; uncolored; empty adverb of gear: neutral"]},{"name":"nitrogen","trans":["n. Nitrogen adjective: nitronitrogen"]},{"name":"nocturnal","trans":["adj. nocturnal, occurring at night; nocturnal activity; n. nocturnal activity; adv. nocturnal adverb: nocturnally"]},{"name":"notoriously","trans":["Adv. infamous, notorious; famous, well known"]},{"name":"obesity","trans":["n.Hypertrophy, obesity"]},{"name":"obliged","trans":["adj. Grateful; Responsible; Necessary; v. Requirements; Restraint; Favourite"]},{"name":"obscure","trans":["adj. Nameless; little-known; obscure; obscure; obscure, hazy; unclear; v. conceal; obscure; obscure; obscure; obscure; make it difficult to understand, make obscure; make obscurer, o..."]},{"name":"occasional","trans":["adj. Occasionally, infrequently"]},{"name":"ongoing","trans":["adj. moving forward; uninterrupted, ongoing; n. moving forward; conduct, conduct"]},{"name":"opulence","trans":["n. Wealthy, rich"]},{"name":"orchard","trans":["n. Orchards; fruit groves"]},{"name":"orient","trans":["vt. familiarize, adapt; orient; determine location; n. orienting, orienting"]},{"name":"outdated","trans":["adj. out of date; old style; v. obsolete"]},{"name":"outlook","trans":["n. Prospects; attitudes, opinions; views vt. Better looking than...; overwhelm vi with your gaze. Looking outwardly, Outlook is an email sending and receiving software developed by Microsoft"]},{"name":"output","trans":["n. Production; output, output volume; production; vt. output tense: outputted, output outputted, outputs"]},{"name":"outset","trans":["n. Start, start"]},{"name":"outskirts","trans":["n. Peripheral area, suburb, suburb"]},{"name":"overhang","trans":["VT. & vi. stick out; hang above... Tense: overhung overhanging, overhangs"]},{"name":"overheads","trans":["n. Funding"]},{"name":"overload","trans":["vt. overloading; overloading; overloading; overloading; overloaded"]},{"name":"overly","trans":["Adv. unduly"]},{"name":"overrate","trans":["vt. Overestimating; overestimating... tense: overrated, overrated, overrates"]},{"name":"overtake","trans":["vt. Catch up; overwhelm; strike suddenly; vi. Overtaking tense: overtaken, overtaken, overtaken"]},{"name":"overuse","trans":["n. Overuse; vt. use... excessive tense: overused, overusing, overuses"]},{"name":"par","trans":["n. Face value; average quantity; standard; adj. Standard; faceted ParaBbR. Peak Average Recorded corrected peak-average tenses: parred, parri..."]},{"name":"parliament","trans":["n. Parliament, National Assembly"]},{"name":"partnership","trans":["n. Partnerships; partner status; partnerships; partnerships"]},{"name":"patch","trans":["n. Blindfold; speck; debris; small plot of land; vt. patch; disguise; resolve; vi. patching tense: patched, patching, patches Noun: patcher"]},{"name":"perceptual","trans":["adj. perceptive, sentient"]},{"name":"perennial","trans":["adj. frequent; long-term; long-lasting; adv. frequently occurring; protracted; enduring adverb: perennially"]},{"name":"perpetuate","trans":["vt. perpetuate; make people remember not to forget the tense: perpetuating, perpetuating, perpetuates Noun: perpetuator"]},{"name":"personalise","trans":["vt. On the crop owner's logo; makes it personal, affectionate, or personalized"]},{"name":"pessimistic","trans":["adj. pessimistic; pessimistic"]},{"name":"poisoning","trans":["n.Poisoning; Poisoning; Poisoning"]},{"name":"polluter","trans":["n. polluter; source of pollution; pollutant"]},{"name":"poster","trans":["n. Posters, posters; printed large paintings"]},{"name":"poultry","trans":["n.Poultry; poultry meat"]},{"name":"practicable","trans":["adj. feasible; applicable noun: practicability adverb: practicably"]},{"name":"predecessor","trans":["n. predecessor, predecessor; original thing, predecessor"]},{"name":"prevail","trans":["vi. persuade; persuade; induce; prevail, be popular; win; dominant tense: prevailed, prevailed"]},{"name":"principally","trans":["Adv. primarily"]},{"name":"privacy","trans":["n. Seclusion, solitude; private matters, privacy"]},{"name":"privileged","trans":["adj. confidential, confidential; privileged"]},{"name":"procurement","trans":["n. Acquisition; procurement"]},{"name":"promptly","trans":["Adv. Agile; quickly; immediately; on time, exactly"]},{"name":"propagate","trans":["VT. & vi. Reproduction, multiplication; vt. propagate; propagate; propagate; propagate; propagate adjective: propagable..."]},{"name":"prorate","trans":["vt. Proportional distribution; vi. proportional allocation tense: prorated, prorated Noun: proration"]},{"name":"prosperous","trans":["adj. successful, prosperous, prosper adverb: prosperously"]},{"name":"punctual","trans":["adj. punctual, punctual; precise noun: punctuality Adverb: punctuality"]},{"name":"purse","trans":["n. Wallets, small purses; money, financial resources; vt. Wrinkle, shrink tense: pursed, pursing, purses"]},{"name":"quadruple","trans":["adj. quadruple; quadruple; four-part; n. quadruple; vt. & vi. quadrupled tense: quadrupled, quadrupling, quadruples adverb: q..."]},{"name":"quit","trans":["VT. & vi. from leaving; leaving; vt. stop tense: quit, quitting, quits"]},{"name":"quota","trans":["n. Quantification, quotas, quotas"]},{"name":"racket","trans":["n. Racket; loud noise; extortion, fraud, illegal activity Status: racketed, racketing, racketing"]},{"name":"radius","trans":["n. Radius, radius range; radiated light; effective range; radial plural: radii"]},{"name":"ration","trans":["n. Quantification; rations; vt. Limited supply; rationing timing of supply: rationed, rationing, rations"]},{"name":"recipient","trans":["n. Recipients"]},{"name":"rectangular","trans":["adj. (number) rectangular; noun of rectangle: rectangularity"]},{"name":"redundant","trans":["adj. dismissed due to overstaffing; unnecessary; redundant adverb"]},{"name":"refresh","trans":["vt. restore...; renew; freshen...; eliminate the fatigue of...; vi. Refresh your mind; drink drinks, eat snacks; refill time: refreshed, refreshes"]},{"name":"regain","trans":["vt. recover; win back; return, return to a certain place tense: regained, regains"]},{"name":"regenerate","trans":["VT. & vi. regeneration; regeneration tense: regenerated, regenerates Noun: regenerator"]},{"name":"relic","trans":["n. Relics, ruins, heritage; remains, corpses"]},{"name":"remark","trans":["n. Discourse, Comment; Note; Watch; Observe; vt. & vi. Talk, comment; vt. notice... tense: remarked, remarked, observed"]},{"name":"residue","trans":["n. Residues; surpluses; filter slag"]},{"name":"resonance","trans":["n. Echo, reverberation; loud; resonance"]},{"name":"retard","trans":["vt. slow down; hinder; block; delay, delay; delay; vi. slowed; blocked; n. decelerated; blocked; delayed tense: delayed, retards Noun:..."]},{"name":"retreat","trans":["n. Retreat; rest home; retreat; vi. retreat; retreat; lean backwards; vt. take back; retreat tense: reconsider, retreat Noun: ret..."]},{"name":"retrenchment","trans":["n. Save, delete"]},{"name":"revitalise","trans":["vt. Revitalize your energy and give you new vitality"]},{"name":"revive","trans":["vi. awakening; revival; resurrection; restoration of spirit; vt. awaken; revive; recall; repeat, replay tense: revived, reviving, revives Adjective: revivab..."]},{"name":"sacrifice","trans":["n. Sacrifice, sacrifice; sacrifice, offering; offerings; vt. & vi. Sacrifice; vt. sacrifice, offering tense: sacrificed, sacrificing, sacrifices"]},{"name":"sanction","trans":["n. Sanctions, penalties; recognition; support; vt. sanction; sanction; approval; encouragement; moment of sanction: sanction, sanction"]},{"name":"saver","trans":["n. Rescuers; thrifty people; saving devices"]},{"name":"scenario","trans":["n. Plot; script; plan"]},{"name":"scepticism","trans":["n. Skepticism; skepticism"]},{"name":"scientifically","trans":["Adv. scientifically"]},{"name":"scream","trans":["vi. Screaming; making a sharp, harsh sound; howling; shocking; vt. Screaming; yelling and demanding; n. screaming; sharp, harsh sound; extremely funny and ridiculous human tense: screamed, screamed..."]},{"name":"scrutinise","trans":["vt. Check in detail; take a closer look; vi. Check carefully; read carefully"]},{"name":"secrecy","trans":["n. Confidential; Confidential; Concealment"]},{"name":"secrete","trans":["vt. concealing; secreting; secreting tense: secreted, secreted"]},{"name":"seize","trans":["VT. & vi. Catch, catch; vt. seize; seize tense: seize, seize adjective: seizable Noun: seizer"]},{"name":"shame","trans":["n. Shame, shame; regrets, people who bring shame; vt. humiliate, shame tense: shamed, shamed"]},{"name":"sharpen","trans":["v. sharpen; improve, improve; intensify tense: sharpened, sharpened, sharpens Noun: sharpener"]},{"name":"shield","trans":["n. Shield; protective material; protector; vt. Defend; cover up; cover up; avoid; vi. Protects; defensive tense: shielded, shielded, shields"]},{"name":"shiny","trans":["adj. shiny, polished; clear; shiny; worn comparative grade: shinier, shiniest Noun: shininess"]},{"name":"shoulder","trans":["n. shoulder, shoulder; upper back; responsible person; vt. carry, bear, pick; use the top of the shoulder...; bear the tense: shouldering, shouldering, picking"]},{"name":"simultaneous","trans":["adj. concurrent; concurrent adverb: simultaneous"]},{"name":"sizeable","trans":["adj. Big, pretty big"]},{"name":"smart","trans":["adj. Clean and beautiful; well-dressed; stylish; quick-thinking, intelligent; smart; powerful, fierce; vi. Feeling tingling; n.Trauma SmartaBr. Satellite Maintena..."]},{"name":"soften","trans":["vt. Make soft; make gentle; ease; vi. softening; softening; easing tense: softening, softens Noun: softener"]},{"name":"solicitor","trans":["n. Junior lawyers"]},{"name":"soluble","trans":["adj. soluble, soluble; solvable noun: solubleness"]},{"name":"spacious","trans":["adj. spacious, expansive; infinity adverb: spaciously Noun: spaciously"]},{"name":"spade","trans":["n. Shovels, shovels; vt. Shovel; smooth out...; vi. Shovel SpadeAbbr. Spare Parts Analysis, Documentation and Evaluation..."]},{"name":"spirit","trans":["n. Spirit; Mind; Ambition; Spirits; Emotions; vt. encouraging; encouraging; abducting tense: spirited, spiriting, spirits"]},{"name":"spit","trans":["VT. & vi. spitting; spitting; purring; n. drooling, spitting; spitting, spitting tense: spat, spit"]},{"name":"spy","trans":["vt. reconnaissance; discovery; covert surveillance; vi. scouting; being a spy; n. espionage; undercover"]},{"name":"standby","trans":["n. A backup person or thing; on standby; ready to act at any time; on standby; awaiting a refund"]},{"name":"startling","trans":["adj. shocking, amazing"]},{"name":"stationary","trans":["adj. fixed; stationary; settled; n. immobile person of the standing army; garrison"]},{"name":"steering","trans":["n. Steer; Manipulate; Guide; v. Drive; Steer"]},{"name":"stir","trans":["VT. & vi. stirring; moving; excited; n. stirring; stirring; stirring; agitation; disturbance; riots StirabBr. Surveillance and Target Surveillance Rada..."]},{"name":"stockpile","trans":["n. Hoarded supplies; vt. Massive storage time: stockpiled, stockpiling, stockpiles"]},{"name":"strand","trans":["n. Seaside; line; string; vt. Stranded; bogged down; disrupted; left behind; vi. Stranded tense: stranded, stranded, stranded"]},{"name":"stride","trans":["n. stride length; big step; progress; vt. Cross; walk in big steps; sit across...; vi. crossing; crossing; walking on a big walk tense: strode stridden striding, strides..."]},{"name":"stunt","trans":["n. Stunts; gimmicks, wits; vt. Obstructs the normal growth or development of...; vi. Perform stunts; perform amazing tenses: stunted, stunting, stunts"]},{"name":"stylish","trans":["adj. fashionable; chic; modern adverb: stylishly"]},{"name":"subjective","trans":["adj. subjective; subjective adverb: subjectively"]},{"name":"subliminal","trans":["adj. subliminal, subconscious; too weak or too fast to notice"]},{"name":"subtlety","trans":["n. Subtle; sharp; shrewd"]},{"name":"subtropical","trans":["adj. subtropical; characteristic of the subtropics"]},{"name":"suction","trans":["n. Suction; suction; suction timing: suctioning, suctions"]},{"name":"suicide","trans":["n. Suicide; person who committed suicide; suicidal behavior; adj. Suicidal; vt. Suicide; vi. suicides"]},{"name":"superficially","trans":["Adv. Shallow ground"]},{"name":"supersede","trans":["vt. replace, succession tense: superseded, superseding, supersedes noun: supersession"]},{"name":"supervisory","trans":["adj. managerial, supervisory"]},{"name":"suppress","trans":["vt. suppress; suppress; prohibit publication, ban; conceal; suppress, hold back; stop the growth of... tense: suppressed, suppressed, suppressed Noun: suppre..."]},{"name":"surfing","trans":["n. Surfing games; v. Surfing"]},{"name":"surveillance","trans":["n. Stalking, surveillance"]},{"name":"swamp","trans":["n. Swamps, lowlands, puddles; wetlands; degree of flooding in a certain area; dilemmas of progress and retreat v. Unbearable, exhausting, and overwhelmed; flooded; engulfed by water, sunken; troubled tense: swamped, swamped..."]},{"name":"sweat","trans":["vt. Excretion; causes sweating; causes hard work; exploits; relieves through sweat; anticipates anxiously; n. Sweat; water droplets; anxiety; suffering; vi. Sweating; hard work; chagrin; watery drops Tense: sweated, sweaty sw..."]},{"name":"swift","trans":["adj. Fast, fast; agile, responsive SwiftABR. Society for Worldwide Interbank Financial Telecommunica..."]},{"name":"symbolism","trans":["n. Symbolism, symbolic methods"]},{"name":"taper","trans":["n. Thin candles, candle wicks; gradually weakening; conical objects; vi. Decrease gradually; gradually weaken; vt. gradually diminish; make into a cone tense: tapered, tapering, tapers Adverb:..."]},{"name":"tariff","trans":["n. Tariff, tariff, goods tax schedule; fee schedule, price list tense: tariffing, taxation"]},{"name":"taxation","trans":["n. Taxation, taxation; taxes"]},{"name":"tensile","trans":["adj. tensivity; stretchable; stretchable; stretchable noun"]},{"name":"terrace","trans":["n. Terraces; balconies; platforms; vt. Make terraces, make terraces; make roofs with platforms; vi. Form terraces; form terraces; build altars; adj. Stacked tenses: terraced, terracing, te..."]},{"name":"terrain","trans":["n. Terrain, ground, region, zone"]},{"name":"terrestrial","trans":["adj. terrestrial; terrestrial; terrestrial; terrestrial; terrestrial; terrestrial; terrestrial; earthly; terrestrial; n. earthlike; terrestrial"]},{"name":"terrific","trans":["adj. extremely, very; excellent, amazing, very beautiful; terrifying, terrifying, appalling adverb: terrifically"]},{"name":"testimony","trans":["n. Testimony; proof, evidence"]},{"name":"thermal","trans":["adj. hot, thermal, heat-induced adverb: thermally"]},{"name":"thrilled","trans":["adj. very excited; extremely excited; v. tremor; excited"]},{"name":"tissue","trans":["n. Organization; tissue paper, cotton paper; set, series of adjectives: tissular"]},{"name":"tolerate","trans":["vt. allow; acknowledge; endure; tolerate tense: tolerated, tolerates Noun: tolerator"]},{"name":"toll","trans":["vt. levy; ring a bell; n. toll; price; bell; vi. bell ringing; tax timing: tolled, tolling, tolls"]},{"name":"toss","trans":["n. Throw; fluctuation; throw distance; coin toss to bet on victory or loss; vt. Throw; make... uneasy; lift it suddenly; shake... up and down; bet with... tossing coins; vi. Being thrown around; bumping; rolling; tossing a coin determines the tense of something: tossed, t..."]},{"name":"tragic","trans":["adj. Tragic; sad, unfortunate"]},{"name":"trainee","trans":["n. Recruit; trainee; trainee, intern; animal in training Noun: traineeship"]},{"name":"transcribe","trans":["vt. Transcribe, transcribe, or print with a typewriter; transcribe into another form; translate... into text; translate; use phonetic transcription; adapt; transcribe, copy; n. Scribed, transcribi..."]},{"name":"tricky","trans":["adj. astute; cunning Comparative level: trickier, trickiest Adverb: trickily Noun: trickiness"]},{"name":"tube","trans":["n. Tubes; electronic tubes; tunnels; televisions; vt. Put... in a tube; transport it in a tube; make it into a tube; vi. Failed; subway ride time: tubed, tubing, tubes"]},{"name":"turnover","trans":["n. Overturning; Turnover; Circulation; Semicircular Wraps; Errors; adj. reversable; reversible"]},{"name":"ultraclean","trans":["adj. Ultra clean, extra clean"]},{"name":"unaided","trans":["adj. without foreign aid; alone"]},{"name":"underpin","trans":["vt. Use masonry structures, etc. to support from below; reinforced foundation; to lay the foundation; strengthen; consolidate; n. Basic materials, infrastructure; foundation; leg tense: underpinned, underpinning, underp..."]},{"name":"unfold","trans":["vt. Open; render; vi. unfold; reveal tense: unfolded, unfolded, unfolded"]},{"name":"urge","trans":["vt. exhorting; urging; encouraging; strong assertion; driving, motivating; n. strong desire tense: encouraging, urging, encouraging"]},{"name":"vague","trans":["adj. unclear; vague; vague; ambiguous comparative level: vaguer, vaguest adverb: vaguely Noun: vagueness"]},{"name":"ventilation","trans":["n. Air circulation; ventilation equipment; ventilation methods"]},{"name":"vibration","trans":["n. Vibration; one-time reciprocating vibration; swing; sway; feel, resonate; telepathic adjective: vibrational"]},{"name":"vice versa","trans":["Adv. The reverse is also true"]},{"name":"vigorous","trans":["adj. powerful; energetic adverb: vigorous Noun: vigorious"]},{"name":"vocal","trans":["adj. verbal, vocal, pronounced adverb: vocally"]},{"name":"vocational","trans":["adj. professional, career-ready adverb: vocationally"]},{"name":"volatile","trans":["adj. unstable; volatile; irritable, moody; likely to fluctuate rapidly; unstable; easily deteriorated; volatile, easily gasified; volatile; n. volatile; winged animal Noun: volatile"]},{"name":"wag","trans":["VT. & vi. Shake, swing tense: wagged, wagging, wags"]},{"name":"warehouse","trans":["n. Warehouse, warehouse tense: warehoused, warehousing, warehouse also"]},{"name":"waterfront","trans":["n. Seaside [lake]; riverside"]},{"name":"waterproof","trans":["adj. impermeable, waterproof; vt. Make waterproof; make impermeable when: waterproofed, waterproofs"]},{"name":"weird","trans":["adj. bizarre; mysterious and scary; transcendent; eccentric; bizarre Comparative level: weirder, weirdest adverb: weirdly Noun: weirdness"]},{"name":"wobble","trans":["vi. Shake; wobble; wobble; wobble; wobble; wobble; vt. shake; make it flutter; shake tense: wobbled, wobbling, wobbles Noun: wob..."]},{"name":"wrap","trans":["vt. Package; hide; entangle; cover; vi. wrap; wear a coat; wrap up; n. jacket; scarf wrapabBr. Web-Ready Appliances Protocol Internet Access Appliance Protocol Tense.."]}]