[{"name":"abundant","trans":["adj. plentiful, plentiful adverb"]},{"name":"accumulate","trans":["VT. & vi. accumulation; accumulation tense: accumulating, accumulating"]},{"name":"acid","trans":["adj. sour, sour; sharp; n. 'acidifying' acid; sour substance Adverb: acidness Noun: acidness"]},{"name":"advisable","trans":["adj. wise; desirable adverb: advisably"]},{"name":"artefact","trans":["n.Artificial products, processed goods"]},{"name":"artifact","trans":["n. Artefacts; Handicrafts; Processed goods"]},{"name":"aspiration","trans":["n. Strong wishes, aspirations, and ambitions"]},{"name":"attain","trans":["vt. Reach, achieve; obtain; arrive; vi. achieve; attain; attain; n. Achievement tense: attainable, attainable"]},{"name":"audit","trans":["v. Check; Audit; Audit; Observe; n. Audit; Audit; Review, Check Status: audited, audited, reviewed"]},{"name":"avenue","trans":["n. boulevard, street; path, means"]},{"name":"ban","trans":["vt. ban, block, ban; n. ban, ban tense: ban, ban"]},{"name":"band","trans":["n. Band, hoop; stripe; range of value, quantity, etc.; radio band, band; group, group; band, band; vt. Tie it with a strap; vt. & vi. Combine; buddy situation: band, band..."]},{"name":"behalf","trans":["n. Aspects, interests, approval"]},{"name":"beneath","trans":["prep. Under...; adv. At the bottom"]},{"name":"blend","trans":["VT. & vi. mixed, mixed; n. Mixture tense: blended, blended, blends"]},{"name":"border","trans":["n. Edge, edge; border, border; vt. & vi. bordering..., on the edge of... tense: bordering, bordering, borders Noun: borderer"]},{"name":"bow","trans":["n. Bow; bow; bow; vi. bow; bend over; vt. bow; bend over; adj. Curved Tense: Bowed, Bowed, Bows"]},{"name":"bullet","trans":["n. Bullets; votes to select only all candidates from a party; beans; vi. Shoot; move quickly"]},{"name":"calibrate","trans":["vt. calibrate; standardize, conform to standards; measure caliber tense: calibrated, calibrating, calibrates Noun: calibrator"]},{"name":"canvas","trans":["n.Canvas; vt. covered with canvas, equipped with canvas; adj. Made of canvas"]},{"name":"capitalism","trans":["n. Capitalism; Ownership of capital; dominant position of capital"]},{"name":"cautious","trans":["adj. careful, discreet adverb: cautiously noun: cautiously"]},{"name":"cement","trans":["n. Cements; adhesives, adhesives; vt. apply cement to...; adhere; strengthen, strengthen tense: cementing, strengthening; noun: cementer"]},{"name":"collate","trans":["vt. proofreading, collating; n. checking; snacks; n. proofreader, collator tense: collated, collates Noun: collator"]},{"name":"commence","trans":["vt. Begin; begin; vi. make... begin; make... get a degree tense: commenced, commenced"]},{"name":"commentary","trans":["n. Fact sheets, narratives; reviews; commentaries"]},{"name":"compact","trans":["n. Contract, contract; small powder box; adj. compact, tight; simple; vt. make close combinations; make simple tenses: compacted, compacting, compacts adverbs..."]},{"name":"compile","trans":["vt. collect; edit, compiling tenses: compiled, compiling, compiles"]},{"name":"comprehend","trans":["v. Understanding, understanding; including, tenses: comprehended, comprehended, comprehends"]},{"name":"compromise","trans":["n. Compromise, compromise approach; vi. A compromise solution; vt. Accumulation, Harm, Damage Tense: Compromise, Compromise"]},{"name":"conceive","trans":["vt. Idea; Possession; Thought; Pregnancy; vi. pregnancy; conceive; consider tense: conceived, conceived adjective: conceivable..."]},{"name":"concession","trans":["n. Acknowledge, allow; compromise, concession; concession adjective: concessional adjective: concessionary"]},{"name":"confine","trans":["n. Limits, boundaries; vt. restrictions; confinement tense: confining, confining, confines"]},{"name":"consciousness","trans":["n. Perception; awareness, idea, awareness; perception, feeling"]},{"name":"constrain","trans":["vt. to force; to force; to limit, to constrain tense: constrained, constrained adverb: constrained noun: cons..."]},{"name":"controversy","trans":["n. Arguments; arguments; debates"]},{"name":"convenience","trans":["n. Convenience, convenience; useful, beneficial, or suitable arrangement, utensil, or facility; toilet"]},{"name":"cookery","trans":["n. Culinary arts; cooking industry"]},{"name":"county","trans":["n. county, county adjective: county"]},{"name":"coverage","trans":["n. News coverage, coverage; coverage"]},{"name":"cradle","trans":["n. Cradle; boat stand; birthplace; birthplace; vt. nurture; place... on a stand; place... in the cradle tense: cradled, cradling, cradles"]},{"name":"crude","trans":["adj. rough; rude; natural, unprocessed; rough; n. natural substance; crude oil Comparative grade: cruder, crudest adverb: crudely Noun: cru..."]},{"name":"crush","trans":["VT. & vi. Crush, crush; vt. Wrinkle up; suppress, destroy; vi. Squeeze in, squeeze in; n. Crowded crowd tense: crowded, crushing, crushing..."]},{"name":"declaration","trans":["n. Declarations, Declarations, Declarations; Declarations"]},{"name":"decode","trans":["vt. Decode, decode; vi. Engage in decoding work Tense: decoded, decoding, decodes Noun: decoder"]},{"name":"defence","trans":["n. defense; defense; defense equipment; defense"]},{"name":"definite","trans":["adj. unequivocal; definite, definite adverb: definite noun: definiteness"]},{"name":"deforestation","trans":["n. Deforestation, deforestation"]},{"name":"democratic","trans":["adj. An adverb of democratic, democratic spirit or style of work: democratically"]},{"name":"demonstration","trans":["n. Show; prove; demonstrate; demonstrate"]},{"name":"designate","trans":["vt. assign, appoint; indicate, name tense: designate, designate; designates; noun: designator"]},{"name":"desperate","trans":["adj. desperate; desperate; desperate; desperate, desperate; extremely serious; desperate; desperate; desperate; desperate adverb: desperate Noun: desperate..."]},{"name":"destructive","trans":["adj. destructive, destructive adverb: destructively"]},{"name":"deteriorate","trans":["vi. deteriorating, deteriorating tense: deteriorating, deteriorating noun: deteriorating adjective: det..."]},{"name":"discharge","trans":["vt. Unloading; Reimbursement; Enforcement; Fulfilment; vt. & vi. Emission; outflow; firing; firing; n. Permission to leave, release; state of the ejected object: discharged, discharging, di..."]},{"name":"dismantle","trans":["vt. disassemble; dismantle; abolish; cancel tense: disassemble, dismantle; dismantle Noun: disassemble"]},{"name":"disrupt","trans":["vt. disrupt, disrupt tense: disrupt, disrupt noun: disrupt"]},{"name":"dive","trans":["vi. diving; diving; diving; sharp descent; n. diving; diving; diving; diving; timing: dived, dove dived, diving, dives"]},{"name":"dock","trans":["n. Dock; pier; dock; dock; bone-and-meat part of tail; vt. Cut it short; let it rely on the pier; vi. Dock timing: docked, docked, docks"]},{"name":"elaborate","trans":["vi. Detailed instructions; vt. Detailed formulation; adj. complex; elaborate tense: interpreted, exaggerated adverb: elabora..."]},{"name":"endure","trans":["vt. patience; tolerance; vi. patience; continuous tense: endured, enduring, endures"]},{"name":"entail","trans":["vt. make... necessary, necessary; define the inherit tense: entailed, entailing, entails Noun: entailment"]},{"name":"enthusiasm","trans":["n. Enthusiasm, enthusiasm; great interest, passionate things"]},{"name":"episode","trans":["n. Interlude; interlude; plot; interesting event"]},{"name":"excursion","trans":["n. Excursions, excursions"]},{"name":"exemplify","trans":["vt. It is typical of...; exemplify, prove by example the tense: exemplified, exemplified, exemplified"]},{"name":"expenditure","trans":["n. Cost, use; amount of expenditure"]},{"name":"exterior","trans":["adj. external; superficial; external; n. external; surface; appearance; outward appearance adverb: exterially"]},{"name":"fallow","trans":["adj. plowed and unplanted, recreational; uncultivated; n. recreational land, fallow tense: fallowed, fallow Noun: fallowness"]},{"name":"fatigue","trans":["n. Fatigue, exhaustion; chores; vt. Makes you tired; weakens the mind; vi. fatigue; adj. Tense of fatigue: fatigued, fatigued, fatigues"]},{"name":"federal","trans":["adj. federal; an adverb of federal government: federally"]},{"name":"fibrous","trans":["adj. fibrous, fibrous; fibrous noun: fibrous"]},{"name":"flavour","trans":["n. Fragrance; taste; vt. Spice up...; spice up..."]},{"name":"gadget","trans":["n. Small gadgets; small devices; ingenious gadgets Adjective: gadgety"]},{"name":"grasp","trans":["n. Understand; control; seize; vt. Seize; understand; vi. Grasped timing: grasped, grasping, grasps"]},{"name":"hail","trans":["n. Hail; salute; hello; a moment; vt. Greet; burst forth; salute; cheer...; make it fall like hail; vi. hail; hello; int. Welcome; long live tense: hailed, hailing, h..."]},{"name":"handful","trans":["adj. one; few"]},{"name":"hazard","trans":["vt. trying to do; taking risks; n. danger; pollution Hazard Hazard Hazard tense: hazarded, hazarded, threatened"]},{"name":"herd","trans":["n. Herds of animals, herds; herders; vi. Get together in groups; vt. herding; herding; herding tenses: herded, herding, herds"]},{"name":"hockey","trans":["n.Ice hockey; field hockey"]},{"name":"humanity","trans":["n. Humanity; Humanity; Kindness; Humanities"]},{"name":"immune","trans":["adj. Immune, immune; unaffected; exempt..., exempt"]},{"name":"impress","trans":["vt. Impress... and remember; print, imprint tense: impressed, impresses"]},{"name":"inadequate","trans":["adj. Inadequate, inappropriate; incompetent, unconfident; adv. insufficiently, improperly; incompetently adverb: insufficiently"]},{"name":"inferior","trans":["adj. inferior, inferior; poor; inferior; inferior; n. defective; subordinate noun: inferiority"]},{"name":"inhibit","trans":["vt. suppress; inhibit; inhibit; inhibit adjective: inhibiting"]},{"name":"inquiry","trans":["n. investigation; inquiry; inquiry"]},{"name":"insulate","trans":["vt. isolate; insulate; insulate; insulate; insulate"]},{"name":"intricately","trans":["Adv. cluttered; intricately; incomprehensible"]},{"name":"intuition","trans":["n. Intuition; intuitively perceived intellectual adjective: intuitive"]},{"name":"invader","trans":["n. invaders, invaders; intruders"]},{"name":"investigator","trans":["n. Investigator; examiner adjective: investigator"]},{"name":"isolation","trans":["n. Isolation, isolation from the world"]},{"name":"itinerary","trans":["n. Itinerary; itinerary"]},{"name":"justice","trans":["n. Justice; Fair and Reasonable; Legal Sanctions; Administration of Justice; Trial; Judges"]},{"name":"landlord","trans":["n. Landlord, boss; landlord"]},{"name":"leak","trans":["n. Bugs, cracks; leaks; vt. Make it leak, leak; vi. leak, seep out; leak out tense: leaked, leaking, leaks Noun: leaker"]},{"name":"leap","trans":["vi. jump, jump; n. jump; leap; vt. jump, skip; make leap over tense: leaped, leapt leaping, leaps Noun: leaper"]},{"name":"lifespan","trans":["n. Expected life span; lifespan; expected period of use"]},{"name":"likelihood","trans":["n. Possible, likely"]},{"name":"litter","trans":["n. Waste; garbage; messy, messy; a nest; vt. & vi. make a mess; throw away clutter tense: littered, littering, litters Noun: litterer"]},{"name":"log","trans":["vi. Logging; vt. logging; sailing; cutting; n. Sailing log; garden; recording timing: logged, logging, logs"]},{"name":"lounge","trans":["n. Lounge; lounging; lounge; bar room; vi. Hanging out; lying lazily; hanging out; vt. waste of time tense: lounged, lounging, lounges Noun: lou..."]},{"name":"magical","trans":["adj. magical, incredible, charming adverb: magically"]},{"name":"malaria","trans":["n. Malaria; Pandemic"]},{"name":"manipulate","trans":["vt. skilled control tense: manipulated, manipulated Adjective: manipulated Noun: manipulated..."]},{"name":"manual","trans":["adj. by hand, by hand; n. Manual, guide adverb: manually"]},{"name":"menace","trans":["n. Threats; intimidation; vi. Intimidate; make threats; vt. threatening; threatening tense: menaced, menacing, menaces Noun: menacer Adverb:..."]},{"name":"merchandising","trans":["n. Product advertising, sales planning"]},{"name":"meteorological","trans":["adj. relating to meteorology, meteorology"]},{"name":"mimic","trans":["vt. imitation, imitation; n. clown; imitation; supporter, imitator; adj. imitating, simulating; pretending tense: mimicked, mimicking, mimics Noun:..."]},{"name":"modest","trans":["adj. humble, humble; moderate; dignified; shy adverb: modestly"]},{"name":"monoculture","trans":["n. Monoculture, single crop"]},{"name":"mundane","trans":["adj. worldly, ordinary; worldly, cosmic"]},{"name":"municipal","trans":["adj. municipal, adverb of municipal: municipal"]},{"name":"navigate","trans":["vt. sail; drive, manipulate; pass; vi. Navigation, aviation timing: navigated, navigated"]},{"name":"neighbourhood","trans":["n. Area; people in an area; an area close to a certain place"]},{"name":"nerve","trans":["n. Nerves; nervousness; nervousness; courage; guts; tense tense: nervous, nervous"]},{"name":"notable","trans":["adj. notable; famous; n. celebrity, prominent person adverb: notable"]},{"name":"offspring","trans":["n. Children, descendants, offspring; cubs"]},{"name":"Olympic","trans":["adj. Mount Olympus's, Olympia's; Olympic's"]},{"name":"operational","trans":["adj. ready to use; operated, operated"]},{"name":"opposition","trans":["n. Opposition; rival, antagonist; opposition party, opposition party; strong opposition to someone/something; contrast; adj. opposing, antagonistic; n. Oppositional"]},{"name":"optical","trans":["adj. optical; ocular, visual adverb: optically"]},{"name":"orbit","trans":["n. Orbit; Eye; Sphere of Influence; Life Routine; vi. Circling; orbiting; vt. Orbiting... tenses: orbited, orbiting, orbits"]},{"name":"outlay","trans":["vt. expenses; n. Expenses; Expenses; timing of expenditure: outlaid outlay, outlays"]},{"name":"overweight","trans":["adj. Overweight timing: overweighted, overweighting, overweights"]},{"name":"overwhelming","trans":["adj. unstoppable, overwhelming; huge adverb: overwhelmingly"]},{"name":"owe","trans":["vt. owe... debt; give; credit...; be grateful tense: sorry, owing, owes"]},{"name":"ownership","trans":["n. The identity of the owner; ownership, ownership"]},{"name":"pace","trans":["VT. & vi. Walking, moving; vt. Step measurement; step measurement; fixed pace for...; n. pace; planned progress; step, step; raceAbbr. Performance and Cos..."]},{"name":"parallel","trans":["n. Parallel lines; contrast; vt. Make... parallel to...; adj. parallel; similar, same tense: simultaneously also parallelled paralleling paral..."]},{"name":"password","trans":["n. Password; password Password; password word"]},{"name":"plausible","trans":["adj. seems to be true; a flattering, eloquent adverb: plausibly"]},{"name":"pliable","trans":["adj. soft; easily tortuous; flexible; smooth adverb: pliably"]},{"name":"portable","trans":["adj. portable; portable; lightweight"]},{"name":"possession","trans":["n. Possession, possession; personal property, private property; territory, territory, colony"]},{"name":"postage","trans":["n. Postage, postage"]},{"name":"postcode","trans":["n. Zip code; postal code"]},{"name":"posture","trans":["n. Posture; Situation; Attitudes; vi. Posing; vt. posture for... tense: postured, posturing, postures Adjective: postural"]},{"name":"poverty","trans":["n. Poverty; scarcity; substandard; difficulties"]},{"name":"pride","trans":["n. Pride; Pride; Self-Esteem; vt. Make the intention, take pride in...; vi. Pride Pride tense: prided, prided, prides"]},{"name":"promotional","trans":["adj. Of promotion"]},{"name":"realism","trans":["n. Realism; Realism; Realist attitudes and behaviors"]},{"name":"refine","trans":["vt. refining; refining; making... elegant; improving tense: refining, refining Noun: refiner"]},{"name":"reliance","trans":["n. Depend, depend"]},{"name":"repertoire","trans":["n. All programs"]},{"name":"replenish","trans":["vt. supplementary tense: replenished, replenished noun: replenisher noun: replenished"]},{"name":"resist","trans":["VT. & vi. use of force to prevent occurrence; resistance; confrontation; vt. unharmed; resistant; unyielding; able to withstand tense: resisted, resists Noun: re..."]},{"name":"respectively","trans":["Adv. each place, each place, separately"]},{"name":"retail","trans":["vt. Retail; paraphrase; vi. retail; n. retail; adv. In retail; adj. The tense of retail: retailed, retailing, retails Noun:..."]},{"name":"rhythm","trans":["n.Rhythm; rhythm"]},{"name":"roam","trans":["vi. roaming, strolling; wandering; vt. wandering in...; walking, roaming in...; n. walking, roaming; wandering tense: roamed, roaming, roams Noun: roamer"]},{"name":"robust","trans":["adj. strong; healthy; crude; rude adverb: robustly Noun: robustness"]},{"name":"scan","trans":["vt. Scan; take a close look; browse; investigate in detail; mark the pattern; vi. Scan; Sweep; n. Scan; Browse; Examine; Look closely at ScanAbbr. Self-Contained Automatic Navig..."]},{"name":"scare","trans":["vt. Scare; scare... away; vi. frightened; n. frightened; panicked; frightened; adj. horrible tense: scared, scaring, scares Noun: scarer"]},{"name":"scatter","trans":["vi. dispersion, dispersion; scattering; vt. scatter, scatter; scatter; scatter; spread; n. disperse; spread, spread tense: scattered, scattering, scatters..."]},{"name":"scent","trans":["n. Odor, fragrance; perfume; odor, odor; clue; smell; vt. Smell the smell of..., smell the presence of...; notice the presence; feel it, doubt it; fill it with fragrance; sprinkle perfume in the tense: scented, scent..."]},{"name":"scope","trans":["n. Field of view; vision; range; margin; missile range; vt. Examining the tense: scoped, scoped, scopes"]},{"name":"score","trans":["n. Engraving; soundtrack; score; twenty; vt. Evaluate; obtain; draw, draw; write down...; vi. Score; indent; score scoreAbBr. Satellite Computer-Operated..."]},{"name":"segment","trans":["vi. split; n. segment; part; vt. segmented tense: segmented, segmenting, segmented adjective: segmentary"]},{"name":"sensible","trans":["adj. wise; aware; understandable; obvious; n. something that can be sensed; sensitive person Adverb: sensitive"]},{"name":"severity","trans":["n. Strict, severe, demanding; serious; drastic; simple; simple; strict treatment, difficult environment"]},{"name":"sheer","trans":["adj. complete; full; steep; vertical; extremely thin, light, transparent; adv. vertically, steeply; vi. avoid, suddenly turn to the tense: sheered, sheering, sheers..."]},{"name":"shower","trans":["n. Showers, snow; showers; vi. Showers; falling like showers; vt. Give plenty of tense: showered, showering, showers Adjective: showery"]},{"name":"simplicity","trans":["n. Simple, plain, straightforward"]},{"name":"skim","trans":["vt. Removing the floating object of...; flying past the surface of...; removing; skimming; concealing; vi. skipping; browsing; n. skipping; skipping things; superficial materials; income from concealment of reports; adj. Removing foam; defatted; surface tense: s..."]},{"name":"sledge","trans":["n. Sleds, snowmobiles; vi. Sleigh ride; vt. Carrying time with a sled: sledged, sledging, sledges"]},{"name":"slope","trans":["n. Inclination; slope; slope; gun carrying position; vi. tilt; escape; vt. lift; tilt; tilt tense: sloped, sloping, sloping Noun: sloper"]},{"name":"smooth","trans":["adj. smooth; smooth; smooth; vt. smooth; soften; eliminate; make elegant; n. smooth part; a flat area; vi. Become calm; become smooth; adv. Smoothly; smoothly; smoothly compare levels: smoo..."]},{"name":"solidify","trans":["vt. Solidarity; Solidification; vi. unity; solidification tense: solidified, solidified, solidified Noun: solidification"]},{"name":"specify","trans":["vt. specify; list; specify; include... in the specification tense: specified, specified, specified Noun: specifier"]},{"name":"sphere","trans":["n. Range; sphere; vt. Surround; put in a ball; shape... into a ball; adj. Sphere tense: sphered, sphering, spheres Noun: sphericity"]},{"name":"spontaneous","trans":["adj. spontaneous, unconscious; natural, innocent and straightforward adverb: spontaneously Noun: spontaneously"]},{"name":"spouse","trans":["n. Spouse, Husband, or Wife tense: spoused, spoused, married"]},{"name":"stabilise","trans":["VT. & vi. stable; stable"]},{"name":"starve","trans":["VT. & vi. starved, starved tense: starved, starving, starves"]},{"name":"striking","trans":["adj. remarkable, prominent; attention-grabbing; good-looking adverb: strikingly Noun: strikingness"]},{"name":"substitute","trans":["VT. & vi. substitute, substitute tense: substituted, substituting, substitutes Noun: substitutability..."]},{"name":"suffrage","trans":["n. Right to vote; right to vote; right to participate; intercession; affirmative vote"]},{"name":"superior","trans":["adj. superior; proud; excellent, outstanding; n. superior, chief; elder; winner, superior Noun: superiority Adverb: superiority"]},{"name":"supplier","trans":["n. Supplier; supplier, supplier country"]},{"name":"surname","trans":["n. Last name, last name; nickname, alias; vt. Give... an alias; give... last name tense: surnamed, surname, surnames"]},{"name":"suspense","trans":["n. Suspense; anxiety; suspense; unresolved adjective: suspenseful"]},{"name":"systematic","trans":["adj. systematic; regular; thorough adverb: systematic"]},{"name":"toxin","trans":["n.Toxins"]},{"name":"transcend","trans":["vt. beyond or beyond; superior or superior to... tense: transcended, transcended"]},{"name":"traverse","trans":["n. Z climbing; vt. crossing, crossing, crossing; vi. Z-shaped climbing tense: traversed, traversing, traverses Adjective: traversab..."]},{"name":"treadmill","trans":["n. Boring work [lifestyle]; bicycles; treadmills, treadmills"]},{"name":"unravel","trans":["vt. unraveling; clarifying; resolving; breaking up; vi. disperse; resolve tense: unraveled, unraveled unraveling, unravelling unravels,..."]},{"name":"utterance","trans":["n. Voice, expression; manner of speech; tone; speech; opinion; speech"]},{"name":"vacuum","trans":["n. Vacuum; 'Mouth' Vacuum Cleaner; Space; Emptiness; Blank; vt. Clean with a vacuum"]},{"name":"vicinity","trans":["n. Close, close, close; near, close"]},{"name":"vicious","trans":["adj. evil, wicked; cruel, vicious adverb: viciously Noun: viciously"]},{"name":"virtue","trans":["n. Virtue, virtue; merit, strength"]},{"name":"vivid","trans":["adj. vivid; vivid; vivid Comparative level: vivider, vividest Adverb: vividly Noun: vividness"]},{"name":"voucher","trans":["n. Witness; Guarantor; Attestor; Receipt Status: vouchered, vouchers"]},{"name":"wander","trans":["vi. wandering; strolling; digressing; getting lost; vt. wandering, wandering; n. hanging out; sneaking around; wandering; wandering tense: wandered, wandering; wanders Noun: wan..."]},{"name":"wise","trans":["adj. Clever; wise; erudite; vt. Make aware; teach; vi. Understanding Comparative Level: Wiser, Wisest Adverb: Wounded Noun: Wiseness"]},{"name":"yoga","trans":["n. Yoga; yogic adjective: yogic"]},{"name":"youngster","trans":["n.Young people; teenagers, children"]}]