[{"name":"abate","trans":["vt. reduce, mitigate; abolish; vi. reduce, expire; n.Name of person; Abate tense: abated, abating, abates"]},{"name":"abide","trans":["vt. Tolerate, endure; wait; vi. stay, residence tense: abode, abided abiding, abides"]},{"name":"abject","trans":["adj. miserable; hopeless; awful, crappy; despicable, despicable; bowed, servile; n. abandonment; adv. miserable; hopeless; awful, crappy; n. miserable; hopeless; despicable, despicable; n. miserable; absolutely..."]},{"name":"abnormal","trans":["adj. abnormal, abnormal; perverted adverb: abnormally"]},{"name":"abolish","trans":["vt. 废除, 废止时 态: abolished, abolishing, abolishes 形容词: abolishable 名 词: abolisher 名 ..."]},{"name":"absolute","trans":["adj. absolute; perfect; authoritarian; n. absolute thing; absolute noun: absolute"]},{"name":"absurdity","trans":["n. Extreme irrationality, paradox; absurdity; fallacy; absurd behavior"]},{"name":"accentuate","trans":["vt. highlight; emphasize; reread, read out with emphasis; accentuate the phonetic symbol to; worsen, make serious tense: accentuating, accentuates noun:..."]},{"name":"acclaim","trans":["vt. cheer for..., applaud...; praise...; cheer or hug for...; n. Warmly welcome or approve; praise tense: acclaim, acclaim"]},{"name":"acclimatise","trans":["vi. & vt. Serves soil and water, adapts to a new climate or environment"]},{"name":"accrue","trans":["vi. natural growth or increase in benefits; generation; vt. accumulate; acquire tense: accrued, accruing, accrues Noun: accruement"]},{"name":"accuse","trans":["v. accuse; accuse; denounce; blame tense: accusingly, accusations Noun: accuser Adverb: accusingly"]},{"name":"achievable","trans":["adj. What can be done, what can be done, what can be achieved"]},{"name":"acrobatic","trans":["adj. acrobatic, acrobatic, acrobatic"]},{"name":"adjoin","trans":["vi. 毗连，邻接; vt. 毗连，邻接 时 态: adjoined, adjoining, adjoins"]},{"name":"adolescence","trans":["n. Adolescence"]},{"name":"adornment","trans":["n.Ornaments, ornaments"]},{"name":"aeration","trans":["n. Ventilation; inflation; aeration"]},{"name":"aerobics","trans":["n.Aerobic fitness method, aerobics"]},{"name":"aeronautical","trans":["adj. aeronautical"]},{"name":"affiliation","trans":["n. Connections; Affiliations; Affiliations, Affiliations, Branches, Branches, Branches, Clubs, Divisions; Acceptance, Membership, Interaction, Social Relationships; Affinity, Cohesiveness; Paternity Testing"]},{"name":"afflict","trans":["vt. torment; cause pain; cause distress tense: afflicted, afflicting adjective: afflictive"]},{"name":"affluent","trans":["adj. affluent; abundant; fluent; n. tributary; rich adverb: affluently"]},{"name":"afield","trans":["Adv. On the battlefield; out in the wild; in the distance; far away"]},{"name":"aggravate","trans":["vt. worsen, make more serious; irritate, irritate tense: irritate, irritate noun: irritator"]},{"name":"agreeable","trans":["adj. readily agreed; pleasant, pleasant adverb: agreeably"]},{"name":"airy","trans":["adj. Aerial; atmospheric; aerial; towering; airy, fresh; illusory; imaginative; light and thin; light and thin; light; beautiful; cheerful; crafty; proud; reckless comparative grade: air..."]},{"name":"align","trans":["vt. Make an alliance; form a line; match; vi. Arrange; arrange in one line tense: aligned also alined alined alining aligns alines name..."]},{"name":"alleged","trans":["adj. claimed, alleged adverb: supposedly"]},{"name":"allowance","trans":["n. 津贴, 补助, 零用钱时 态: allowanced, allowancing, allowances"]},{"name":"alpine","trans":["adj. Alpine, Alpine Alpineadj. Alpine; Alpine residents; those with Alpine ethnic characteristics; Alpine"]},{"name":"altruistic","trans":["adj. altruistic, selfless"]},{"name":"ambassador","trans":["n. ambassador, envoy Adjective: ambassadorial Noun: ambassadorship"]},{"name":"amidst","trans":["prep. Among..."]},{"name":"amphibious","trans":["adj. amphibious, amphibious; amphibious; dual"]},{"name":"amplifier","trans":["n. Megaphone, amplifier; magnifier; detailer"]},{"name":"amplify","trans":["vt. amplify, expand; enhance; vt. & vi. Detailed tense: amplified, amplified, amplified"]},{"name":"anatomist","trans":["n.Anatomists, Analysts"]},{"name":"animate","trans":["v. Energize; invigorate; make... into a cartoon; adj. living; energetic; animated tense: animated, animating"]},{"name":"anniversary","trans":["n. Anniversary"]},{"name":"antenna","trans":["n. sun；，antennan. antenae: antennal"]},{"name":"apace","trans":["Adv. rapidly; rapidly, rapidly"]},{"name":"appalling","trans":["adj. appallingly; horrible, very serious adverb: appallingly"]},{"name":"apparatus","trans":["n. Sports equipment, apparatus, instruments; organs, tissues; organs"]},{"name":"apportion","trans":["vt. 分摊, 分配时 态: apportioned, apportioning, apportions"]},{"name":"apprehensive","trans":["adj. uneasy; afraid; worried; fearful; anxious; good at understanding; perceptive; aware, understanding adverb: apathetic"]},{"name":"aquarium","trans":["n. Fish tank, aquarium plural: aquaria"]},{"name":"arable","trans":["adj. suitable for cultivation; n. Cultivated land Noun: arability"]},{"name":"arduous","trans":["adj. arduous; arduous; difficult adverb: arduously"]},{"name":"arena","trans":["n. Arena; stage"]},{"name":"ascribe","trans":["vt. 把…归于时 态: ascribed, ascribing, ascribes"]},{"name":"ashamed","trans":["adj. ashamed, embarrassed; ashamed..."]},{"name":"assimilation","trans":["n. The process of absorption; digestion; absorption or assimilation"]},{"name":"assortment","trans":["n. Classification; collection of various items or similar items; mixtures"]},{"name":"astound","trans":["see. Operating time: astounded, astounding, astounds"]},{"name":"astray","trans":["Adv. lost; lost; misplaced; adj. deviant from the right path; misguided adjective: astray"]},{"name":"atom","trans":["n. Atoms"]},{"name":"attendance","trans":["n. Attendance, participation, number of attendants; number of participants"]},{"name":"audio-visual","trans":["adj. Audiovisual; Audiovisual teaching"]},{"name":"autocratic","trans":["adj. authoritarian; tyrannical; bossy"]},{"name":"automobile","trans":["n. “American” automobile noun: automobilist"]},{"name":"avid","trans":["adj. eager, greedy; ardent adverb: avidly"]},{"name":"await","trans":["vt. wait, wait; expect tense: waiting, awaiting, expecting"]},{"name":"awkward","trans":["adj. clumsy; awkward; tricky; inappropriate adverb: awkward noun: awkward wardness"]},{"name":"babyish","trans":["adj. infantile; baby-like; childish; childish; childish"]},{"name":"bachelor","trans":["n. Single man, bachelor; bachelor's degree; bachelor's degree"]},{"name":"backlash","trans":["n. Strong reaction, antagonistic reaction; backlash, counterattack; recoil verb: backlash"]},{"name":"backup","trans":["n. Support; Back-up; Blocking; adj. Alternate; Supported; vt. Make a backup"]},{"name":"baggage","trans":["n. Baggage"]},{"name":"bale","trans":["n. Package, bundle; vt. packing or wrapping something into a bundle tense: baled, baling, bales Noun: baler"]},{"name":"banal","trans":["adj. trite; mediocre; cliché verb: banalize adverb: banally"]},{"name":"barge","trans":["n. Shipping; vi. Barging, barging, barges: barged, barging, barges"]},{"name":"basement","trans":["n. Basement; cellar"]},{"name":"bathing","trans":["n. Swimming; Bathing in the Sea; Bathing; v. Bathing"]},{"name":"batter","trans":["n. Hitter; paste; wall inclination; vt. Strike; damage; tilt upward; vi. Bombings one after another; tilted upward tense: battered, battering, batters"]},{"name":"baulk","trans":["vi. Crying in, hesitating; vt. obstruct, hinder, defeat; n. hinder; obstacle, stumbling block"]},{"name":"besiege","trans":["vt. besieged; besieged; besieged tense: besieged, besieges Noun: besieger"]},{"name":"bestow","trans":["vt. grant; use; place; stay tense: bestowing, bestows, bestows"]},{"name":"bewildering","trans":["adj. Confusing; inexplicable; dazzling"]},{"name":"blade","trans":["n. Blade, blade; sword Adjective: bladed"]},{"name":"bleeper","trans":["n. Radio pagers, BP machines"]},{"name":"blink","trans":["vt. Blink; make... blink; vi. blink; blink; n. flash; blink; instantaneous tense: blinking, blinking"]},{"name":"blonde","trans":["adj. Linen-colored; fair; blond with white skin; n. blond woman with white skin"]},{"name":"bloom","trans":["n. Flowers; best period, flourishing period; vi. (Blossoming Bloom, Harold) Tense: bloomed, blooming, blooming adjective: bloomy"]},{"name":"bombard","trans":["vt. bombardment; bombardment; n. rocketry tense: bombarded, bombarding, bombards Noun: bombarder Noun: bombarder Noun: bombar..."]},{"name":"booth","trans":["n. Stalls; public telephone booth Booth"]},{"name":"botanist","trans":["n.Botanist"]},{"name":"bounty","trans":["n. Bonuses, bounties; generosity, generosity"]},{"name":"bout","trans":["n. Confrontation; seizure; round; period"]},{"name":"breast","trans":["n. Breasts, Chest; Mind; Mood; vt. Face your chest; fight with... tense: breasted, breasted, breasts"]},{"name":"bribe","trans":["VT. & vi. bribe; n. bribe tense: bribed, bribing, bribes adjective: bribable Noun: briber"]},{"name":"brittle","trans":["adj. Fragile; easily irritated comparative grade: brittler, brittlest Noun: brittleness"]},{"name":"broker","trans":["n. Brokers; intermediaries, agents; intermediaries; vi. Being a broker; negotiating as a power broker; vt. Arrange as intermediaries, etc... Tense: brokered, brokering, brokers"]},{"name":"brood","trans":["vt. contemplation; n. group; bunch of tenses: brooded, brooding, broods"]},{"name":"brute","trans":["adj. irrational; cruel; n. animal; cruel person Noun: brutism"]},{"name":"bulge","trans":["n. Swelling, swelling; vi. bulging, bulging tense: bulged, bulging noun: bulginess adjective: bulgy"]},{"name":"bulk","trans":["n. Volume, capacity; large block; most, most; vt. expand to form a large number; make it appear important tense: bulked, bulking, bulks"]},{"name":"bump","trans":["n. Lumps, protuberances; impact; vi. Collision, impact; moving on bumps; vt. Touch, hit; bump; adv. abruptly, violently tense: bumped, bumped"]},{"name":"bumper","trans":["adj. hearty, plentiful; n. buffer; vt. Fill up; toast to...; vi. Cheers"]},{"name":"bureaucratic","trans":["adj. bureaucratic, bureaucratic, bureaucratic"]},{"name":"burglar","trans":["n. Night thieves, thieves"]},{"name":"bygone","trans":["adj. long ago; past; n. past events"]},{"name":"camouflage","trans":["n. Camouflage; concealment; concealment; disguise; means of masking; protective color; vt. & vi. conceal; conceal; conceal; conceal tense: camouflage, camouflage"]},{"name":"capsize","trans":["vt. & vi. 翻,倾覆时 态: capsized, capsizing, capsizes"]},{"name":"carefree","trans":["adj. carefree; irresponsible"]},{"name":"carton","trans":["n. Cardboard box; bullseye white spot; vt. Packed in a box; vi. Carton production time: cartoned, cartoning, cartons"]},{"name":"cartoon","trans":["n. Cartoons, cartoons; comic strips; vt. Draw comics for...; vi. draw comics tense: cartooned, cartooning, cartoons Noun: cartoon..."]},{"name":"catastrophic","trans":["adj. disastrous; disastrous; miserable"]},{"name":"cavern","trans":["n. giant, great cave time: caverned, caverning, caverns"]},{"name":"cavort","trans":["vi. 腾跃；欢跃 时 态: cavorted, cavorting, cavorts"]},{"name":"cease","trans":["VT. & vi. stop, terminate, end tense: cease, cease"]},{"name":"censor","trans":["vt. censorship, inspection; n. inspector; subconscious suppression; letter inspector tense: censored, censoring, censors adjective: censorable describe..."]},{"name":"cerebrospinal","trans":["adj. cerebrospinal"]},{"name":"certify","trans":["vt. certify; issue a certificate to... Tense: certified, certifying, certifies Noun: certifier"]},{"name":"chant","trans":["n. Chants; hymns; vt. Sing; recite; vi. Singing; singing repeatedly tense: chanted, chanting, chants"]},{"name":"chaplain","trans":["n. Affiliated church pastors; priests; rabbis; priests performing religious ceremonies"]},{"name":"cheat","trans":["vt. Deceive; defraud; vi. deception; cheating; n. liar; deception, cheating tense: cheated, cheating Noun: cheater"]},{"name":"checklist","trans":["List of selected books, prose catalogues, lists; electoral lists"]},{"name":"chic","trans":["n. Fashionable; chic style; adj. Comparative level of chic: chicer, chicest adverb: chicly"]},{"name":"chorus","trans":["n. Choir; chorus, choir, singing team; vt. Sing in chorus, memorize in unison, speak in unison"]},{"name":"cinematic","trans":["adj. Movie's, Video's"]},{"name":"cipher","trans":["n. Password; cipher; zero; vi. Doing arithmetic; calculating; using passwords; vt. Do arithmetic; calculate; translate... into cryptographic tenses: ciphered, ciphering, ciphers"]},{"name":"circumscribe","trans":["vt. draw a line around...; delimit the scope of...; limit, define the tense: circumscribed, circumscribing, circumscribes"]},{"name":"civic","trans":["adj. urban; civic, civic"]},{"name":"cling","trans":["vi. clingy; clinging; clinging; adhering tense: clung clinging, clings adjective: clingy"]},{"name":"coffer","trans":["n. Safes, safes; treasury, funding conditions: coffered, coffers"]},{"name":"cognition","trans":["n. “Philosopic” knowledge; cognitive ability"]},{"name":"collateral","trans":["n. Ancillary collateral; adj. relevant"]},{"name":"collectively","trans":["Adv. All land; common land"]},{"name":"collision","trans":["n.,,: collisional"]},{"name":"colonist","trans":["n. Colonial pioneers, immigrants; colony residents"]},{"name":"colourfast","trans":["adj. The one that won't fade, the one that won't fade"]},{"name":"comic","trans":["adj. funny, funny; comedic; n. comic magazine; comedians"]},{"name":"commute","trans":["vt. Exchange; commutation of sentence; exchange with...; make... into; vi. commuting; compensation; n. commuting tense: commuted, commuting"]},{"name":"compassionate","trans":["adj. A compassionate, compassionate vt. Sympathy, mercy tense: compassionated, compassionating, compassionates"]},{"name":"complement","trans":["n. Complements, things that complement each other; amounts required or permitted; supplementary terms; vt. complement, complement tense: complementing, complements"]},{"name":"compression","trans":["n. Squeeze, compress; compression stroke Adjective: compressional"]},{"name":"concise","trans":["adj. concisely adverb: concisely Noun: conciseness"]},{"name":"condemn","trans":["see. Condemnation, condemnation, condemnation, condemnation, condemnation, condemnation, condemnation, condemnation, condemnation, condemnation, condemnable, condemnable, condemnable, condemnable, condemnable, condemnable, condemnable, condemnation"]},{"name":"conditioner","trans":["n.Hair conditioner, hair conditioner; softener, softener"]},{"name":"confer","trans":["vt. grant; grant; vi. negotiation tense: conferred, conferring, confers noun: conferment adjective: confer..."]},{"name":"conform","trans":["vi. Comply; comply; adapt to the environment; vt. make consistent; make comply; make compliant; adj. submissive; consistent tense: conformed, conforming, conforms Noun:..."]},{"name":"congratulation","trans":["n. Congratulations, congratulations; congratulations"]},{"name":"connotation","trans":["n. Connotation; implicit; implied, implied meaning; saving something Adjective: connotative"]},{"name":"consequent","trans":["adj. As a result, what ensued"]},{"name":"consignment","trans":["n. Consignment of goods; goods on consignment; consignment; consignment; delivery; by means of consignment"]},{"name":"conspicuous","trans":["adj. conspicuous, obvious adverb: conspicuously noun: conspicuously"]},{"name":"containerization","trans":["n. Container transportation"]},{"name":"contingent","trans":["adj. incidental; incidental; factual; varied by circumstances n. Delegation; detachment adverb: incidental"]},{"name":"contradiction","trans":["n. Contradiction; denial, refutation"]},{"name":"converge","trans":["vi. will meet at one point, towards a point; similar or identical states: converged, converged, converges"]},{"name":"converse","trans":["adj. opposite, reverse; reversed; vi. conversation, conversation; understanding; n. The opposite; retrograde, reverse; inverse tense: conversed, conversing, converses..."]},{"name":"conversion","trans":["n. Transformation, transformation; complete change; conversion"]},{"name":"convict","trans":["vt. 宣判有罪; n. 囚犯 时 态: convicted, convicting, convicts"]},{"name":"cornerstone","trans":["n. Foundation; foundation"]},{"name":"corps","trans":["n. Legions; Soldiers; branches of arms; student federations"]},{"name":"cortical","trans":["adj. cortical; cortical; integumental"]},{"name":"costume","trans":["n. Clothing, clothing style; women's jacket, women's clothing tense: costumed, costuming, costumes"]},{"name":"counterproductive","trans":["adj. counterproductive, causing the intended goal to be not achieved"]},{"name":"courtship","trans":["n. Courtship period, pursuit period"]},{"name":"craze","trans":["n. Fanaticism; vi. Crazy; causes wrinkles; vt. freak out; cause cracks tense: crazed, crazed, crazes"]},{"name":"credibility","trans":["n. Reliability, trustworthiness"]},{"name":"cruel","trans":["adj. cruel, cruel; painful, distressing comparative level: crueler, crueller cruelest, cruellest adverb: cruelly"]},{"name":"crystalline","trans":["adj. crystalline; crystal-like; crystalline; n. crystallinity, crystallinity Noun: crystallinity"]},{"name":"curb","trans":["n. Side stone, side stone; limit, restraint; vt. limit, restrain, suppress tenses: curbed, curbing, curbs"]},{"name":"curly","trans":["adj. curly; curly; wrinkled; curled up Comparative grade: curlier, curliest adverb: curlily Noun: curlily"]},{"name":"curtail","trans":["vt. 截断, 缩短时 态: curtailed, curtailing, curtails 名 词: curtailment"]},{"name":"dearth","trans":["n. Scarce, scarce"]},{"name":"deception","trans":["n. Deception; deception, trick"]},{"name":"decipher","trans":["vt. 破译, 辨认时 态: deciphered, deciphering, deciphers 形容词: decipherable 名 词: decipherer ..."]},{"name":"decrepit","trans":["adj. aging, decrepit, dilapidated"]},{"name":"defer","trans":["vt. delay, delay, delay; vi. obey someone's wishes, follow the tense: deferred, deferring, defers Adjective: deferrable Noun:..."]},{"name":"degenerate","trans":["vi. decline; depravity; degradation; adj. decaying, depraved tense: degenerated, degenerated, degenerated"]},{"name":"delegate","trans":["n. Representatives, members of delegations; vt. appoint or delegate... as representative; entrustment tense: delegated, delegate"]},{"name":"delightful","trans":["adj. very happy, flattering adverb: delightfully"]},{"name":"dementia","trans":["n. (Medical) dementia"]},{"name":"demographer","trans":["n. Demographers"]},{"name":"demolish","trans":["see. Construction time: demolished, demolished, demolishes"]},{"name":"denomination","trans":["n. Denomination, denomination; denomination, unit; name, class name, nominal adjectives: denomination"]},{"name":"deploy","trans":["vt. deploy; deploy; deploy tense: deploy, deploy Noun: deployer Noun: deployment"]},{"name":"deregulate","trans":["vt. deregulate and restrict... tense: deregulated, deregulated noun: deregulation"]},{"name":"desolate","trans":["adj. Nobody's, desolate; gloomy, lonely and desolate; vt. destroy, greatly destroy; cause depression, make painful tense: desolated, desolated, desolates..."]},{"name":"despise","trans":["vt. despise, despise tense: despised, despises"]},{"name":"detach","trans":["vt. detach; dispatch; make transcendent tense: detached, detaching, detaches noun: detachability adjective: detachable"]},{"name":"detergent","trans":["n. Detergents"]},{"name":"devour","trans":["vt. destroy; devour; gaze tense: devoured, devouring, devours Noun: devourer Adverb: devouringly"]},{"name":"dilapidate","trans":["v. 荒废,毁坏,浪费时 态: dilapidated, dilapidating, dilapidates 名 词: dilapidation"]},{"name":"dilemma","trans":["n. Confusing Adjective: dilemmatic"]},{"name":"diligent","trans":["adj. diligent, diligent adverb: diligently"]},{"name":"dilute","trans":["vt. dilute, dilute; adj. diluting, diluting tense: diluting, diluting adjective: diluting"]},{"name":"diplomatic","trans":["adj. diplomatic, diplomatic; skilled, strategic, bargaining, smooth adverb: diplomatically"]},{"name":"discontinue","trans":["vt. & vi. 终止,中断,中止时 态: discontinued, discontinuing, discontinues"]},{"name":"discouraging","trans":["adj. depressing; discouraging; deterring"]},{"name":"disdain","trans":["n. Contempt, contempt; vt. disdain; disdainful, unwilling to act tense: disdained, disdains"]},{"name":"disguise","trans":["vt. pretend; disguise; conceal; n. disguise; pretend; something used as disguise tense: disguised, disguised, disguises adverb: disguisised..."]},{"name":"disgusting","trans":["adj. disgusting, disgusting; extremely unpleasant, extremely bad, extremely bad adverb: disgustingly"]},{"name":"disillusioned","trans":["adj. The one that no longer has illusions, the one that greatly disappoints"]},{"name":"disjunction","trans":["n. Separation"]},{"name":"disparate","trans":["adj. Fundamentally different, incomparable"]},{"name":"disqualify","trans":["vt. disqualifying, disqualifying, disqualifying tense: disqualifying, disqualifying"]},{"name":"dissolve","trans":["v. Dissolve; dissolve; cancel; terminate; dissolve; eliminate; disappear, dissipate; cannot be prevented; remove, disperse; destroy; n. Fade in, superposition, fade in and out tense: dissolves, d..."]},{"name":"distaste","trans":["n. Disgust; hate; vt. Dislike; dislike; vi. I don't like tense: distasted, distasted, distastes"]},{"name":"distressing","trans":["adj. Painful, distressing"]},{"name":"divert","trans":["vt. Divert; entertain...; steer...; vi. diverted tense: diverted, diverted noun: diverter adverb: div..."]},{"name":"dizziness","trans":["n. Dizziness"]},{"name":"dot","trans":["n. Dots, dots; dowry; vi. Hit the dots; vt. Add small dots to dotABBr. Department of Transport Department of Transport) DOT document template format DotABBr. D..."]},{"name":"downside","trans":["adj. Of a downward trend"]},{"name":"downwind","trans":["Adv. Good wind; under wind; adj. Adjective of downwind: downwind"]},{"name":"drab","trans":["adj. monotonous; earthy brown; n. light brown; lifeless; sloppy; small; vt. Make it lifeless; vi. Prostitutes Comparative grade: drabber, drabbest Adverb: drabbly..."]},{"name":"drastic","trans":["adj. intense; violent; n. potent laxative adverb: severe"]},{"name":"dual","trans":["adj. double; double; n. double number; double number word"]},{"name":"dump","trans":["vt. dumping; dumping; vi. take out the trash; n. Dump dump Deoxyuridine Tense: dumped, dumping, dumps Noun: dumper"]},{"name":"dwindle","trans":["vi. 逐渐变少或变小时 态: dwindled, dwindling, dwindles"]},{"name":"eagerly","trans":["Adv. eagerly; eagerly; enthusiastically"]},{"name":"earnest","trans":["adj. serious, enthusiastic; important; n. deposit; serious; sincere adverb: earnestly Noun: earnestness"]},{"name":"eccentricity","trans":["n. Weird behavior; abnormal"]},{"name":"edging","trans":["n. Trims, rims, fringes"]},{"name":"ejection","trans":["n. Ejections; emissions"]},{"name":"elapse","trans":["vi. time passes; fades away; n. The past of time; elapsed tense: elapsed, elapsing, elapses"]},{"name":"elicit","trans":["vt. eliciting, finding tenses: elicited, eliciting, elicits noun: elicitation noun: elicitor"]},{"name":"eligibility","trans":["n. Competent, qualified"]},{"name":"elitist","trans":["n. Outstanding talents, outstanding people; adj. Of outstanding talents, of outstanding people"]},{"name":"eloquently","trans":["Adv. eloquent; expressive"]},{"name":"elucidate","trans":["vt. clarify, explain tense: elucidation, elucidates noun: elucidation adjective: elucidative..."]},{"name":"embarrassment","trans":["n. Embarrassment; embarrassment; anxiety; embarrassing or humiliating things; distress of the rich; too many good things to choose from"]},{"name":"embassy","trans":["n. Embassy; all embassy personnel"]},{"name":"embellish","trans":["vt. 美化；装饰；修饰；润色时 态: embellished，embellishing，embellishes"]},{"name":"embezzlement","trans":["n. Misappropriation"]},{"name":"embryonic","trans":["adj. embryonic; fetal; early"]},{"name":"emergent","trans":["adj. urgent; emerging; emerging; in the early stages of development"]},{"name":"emeritus","trans":["adj. Honorary retirement; retired"]},{"name":"eminent","trans":["adj. outstanding; famous; obvious adverb: eminently"]},{"name":"empirical","trans":["adj. adverb based on observation or experiment: empirically"]},{"name":"encapsulate","trans":["vt. Fill in the capsule; summarize; summarize; include; adj. There are encapsulated tenses: encapsulated, encapsulated, encapsulates Noun: enca..."]},{"name":"endorse","trans":["vt. Sign on the back; endorse; approve, endorse, support; state that you use and approve a product on the advertisement; write a review on the back; make a comment; make a comment; record the violation in the tense: agree, endorse..."]},{"name":"enervation","trans":["n. Inactivity; weakness"]},{"name":"enfranchise","trans":["vt. 给予选举权时 态: enfranchised, enfranchising, enfranchises 名 词: enfranchisement"]},{"name":"enigma","trans":["n. Problems, people, objects, situations, etc. that are difficult to understand; mysteries"]},{"name":"enlighten","trans":["vt. 启发, 开导时 态: enlightened, enlightening, enlightens"]},{"name":"ensue","trans":["vi. Follow and then happen; continue; vt. Pursuing the tense: ensued, ensuing, ensues"]},{"name":"entice","trans":["vt. induce; encourage tense: enticed, entices Noun: enticement"]},{"name":"entrust","trans":["vt. 委托，信托 时 态: entrusted, entrusting, entrusts"]},{"name":"entwine","trans":["see. Tasting time: entwined, entwining, entwines"]},{"name":"epitomise","trans":["vt. The epitome of becoming"]},{"name":"equality","trans":["n. Equality, equality"]},{"name":"equilibrium","trans":["n. Balance, balance of power; calm"]},{"name":"erupt","trans":["vi. eruption; eruption; eruption; eruption tense: erupting, erupting adjective: eruptive"]},{"name":"ethereal","trans":["adj. heavenly; light; like air Noun: ethereality Adverb: ethereally"]},{"name":"ethnicity","trans":["n. Ethnic status; ethnic characteristics; ethnic origin"]},{"name":"evil","trans":["adj. evil; harmful; unfortunate; nasty; n. evil, evil; misfortune Comparative level: eviler, evilest Adverb: evilly Noun: evilness"]},{"name":"expiry","trans":["n. Expiration, overdue; exhalation; termination"]},{"name":"extracurricular","trans":["adj. Other than the school curriculum"]},{"name":"extrapolation","trans":["n. Inference; extrapolation"]},{"name":"extravagance","trans":["n. Luxury; extravagance; luxury goods; indulgent words and actions, etc."]},{"name":"extrusion","trans":["n. Extrude, push out, eject"]},{"name":"exuberant","trans":["adj. cheerful; active; happy; thriving; adv. cheerfully; actively; happily"]},{"name":"facilitator","trans":["service provider"]},{"name":"facsimile","trans":["n. Copy; fax"]},{"name":"familiarise","trans":["vt. make familiar, make it clear"]},{"name":"farewell","trans":["n. Farewell, farewell"]},{"name":"fatal","trans":["adj. fatal; disastrous; major, decisive"]},{"name":"feminism","trans":["n. Feminist movement; feminism; feminism"]},{"name":"fickle","trans":["adj. volatile; impetuous; fickleness; fickleness"]},{"name":"fidelity","trans":["n. Fidelity; loyalty; due diligence; accuracy"]},{"name":"filler","trans":["n. fillers; fillers; fillers"]},{"name":"finitude","trans":["n. Limits; Limits; Restrictions"]},{"name":"fledgling","trans":["n. Young birds; inexperienced people"]},{"name":"flimsy","trans":["adj. fragile; shallow; easily damaged; incomplete; n. tissue paper; copy paper; typing paper Comparative grade: flimsier, flimsiest Adverb: flimsily Noun:..."]},{"name":"flip","trans":["vt. Tap; throw; vi. Use your finger to flick; bounce; adj. rude; reckless; n. muscle fight; play flipAbbr. Floating Indeved Point Arithmetic becomes..."]},{"name":"flock","trans":["n. Group; cotton bundle; vt. Fill it with cotton bundles; vi. gather; walk in groups Flock Flock tense: flocked, flocked, flocks"]},{"name":"fluent","trans":["adj. proficient, fluent; fluent noun: fluency Adverb: fluently"]},{"name":"flustered","trans":["adj. Flustered; agitated v. flustered; confused"]},{"name":"foe","trans":["n. Enemy, enemy"]},{"name":"foil","trans":["n. Foil, sheet metal; backing; vt. defeat; cause frustration tense: foiled, foiling, foils"]},{"name":"footage","trans":["n. Continuous lens; length in feet; length calculated with a ruler"]},{"name":"foregone conclusion","trans":["What is expected to happen; an inevitable outcome"]},{"name":"forfeit","trans":["n. Fines; forfeitures; lost items; adj. Lost as a result of punishment; forfeited; vt. loss of tense: forfeited, forfeiting, forfeits Adjectives:..."]},{"name":"forgive","trans":["VT. & vi. Forgive; forgive; vt. exempt tense: forgave forgiven forgiving, forgives adjective: forgivable name..."]},{"name":"forgo","trans":["VT. & vi. No, give up the tense: forwent forgone forgoing, forgoes"]},{"name":"formality","trans":["n. Formal, strict; compliance with etiquette; formal procedures; formal measures"]},{"name":"formulation","trans":["n. Formalization; planning; conception"]},{"name":"forthcoming","trans":["adj. upcoming; ready to go, readily available"]},{"name":"fourfold","trans":["adj. Quadruple; quadruple; fourth base; adv. quadruple; quadruple"]},{"name":"fraction","trans":["n. Small part; part; slight; score"]},{"name":"fragmentation","trans":["n. Fracture, Fracture"]},{"name":"fraught","trans":["adj. worried, worried; full of..."]},{"name":"freeway","trans":["n. Expressway"]},{"name":"friction","trans":["n. Friction, frictional force Adjective: frictional"]},{"name":"fringe","trans":["n. Edge; spike; bangs; adj. marginal; additional; vt. Kahoyu tense: fringed, fringed adjective: fringy"]},{"name":"frost","trans":["vt. & vi. Ice cream; vt. Frosted; n.;;;; Weather Frost: frosted, frosting, frosts"]},{"name":"froth","trans":["n. Foam, foam; mouth foam; vi. spitting white foam; foaming; vt. Make the bubble tense: frothed, frothing, froths also"]},{"name":"frown","trans":["vi. frowned; disagreed; vt. frowning, frowning; n. frowning, frowns tense: frowned, frowning, frowns"]},{"name":"gauge","trans":["n. Thickness, diameter; measuring instruments; specifications, scales; vt. measure; estimate, judge tense: gauged also gaged gauging gaging gauges gag..."]},{"name":"gaze","trans":["vi. staring, gazing; n. staring, detailed tense: gazed, gazing, gazes Noun: gazer"]},{"name":"generalisation","trans":["n. Generalization, generalization, induction, generalization"]},{"name":"gimmick","trans":["n. Dark agencies; deceptive stuff; vt. Something that deceives people tense: gimmicked, gimmicking, gimmicks adjective: gimmicky"]},{"name":"glacial","trans":["adj. Icy; Ice Age; Icy"]},{"name":"gloomy","trans":["adj. dark; depressed; gloomy comparative level: gloomier, gloomiest adverb: gloomily Noun: gloominess"]},{"name":"gorgeous","trans":["adj. excellent, satisfying; very beautiful, gorgeous adverb: gorgeously"]},{"name":"gossip","trans":["n. Rumors; essays; people who love to talk about long and short stories; vi. Gossiping; spreading gossip Tense: gossiped, gossiping, gossips Noun: gossiper shape..."]},{"name":"grab","trans":["VT. & vi. Preempt, preempt; vt. Seize, grab; have a crush on...; have an effect on...; n. Try to grab, intentionally seize the tense: grabbed, grabbing, grabs..."]},{"name":"grace","trans":["n. Elegance; grace; compassion; charm; vt. Make it beautiful Gracen. Grace tense: graced, gracing, graces"]},{"name":"grapple","trans":["vi. grab; martial arts; grab machine; vt. catch; fight with...; n. catch; fighting tense: grappled, grappling, grapples Noun: grappler"]},{"name":"gratuity","trans":["n. Rewards, tips; giveaways; severance"]},{"name":"grease","trans":["n. Animal fats; ointments, greases; vt. Grease it, grease it with grease Tense: greased, greased, greases adjective: greaseless adjective..."]},{"name":"greet","trans":["vt. welcome, greet, greet tense: greeted, greeting, greets Noun: greeter"]},{"name":"grenade","trans":["n. Fire extinguishers; hand grenades; vt. Throw grenades; attack with tear gas"]},{"name":"grim","trans":["adj. harsh, ruthless; nasty, bad; severe comparative grade: grimmer, grimmest adverb: grimly Noun: grimness"]},{"name":"groan","trans":["vi. moaning; whining; creaking; vt. moaning; whining; n. moaning; sighing; squeaking tense: groaned, groaning, groans Noun: groaner"]},{"name":"guilty","trans":["adj. guilty; comparative grade of guilt: guiltier, guiltiest adverb: guiltily noun: guiltiness"]},{"name":"gush","trans":["vi. squirting, surging; talking endlessly; n. gushing; bursting tense: gushing, gushing, gushing"]},{"name":"gust","trans":["n. A gust of wind; flavor; hobby; vi. Strong Blow Tense: Gusted, Gusted, Gusted"]},{"name":"habitual","trans":["adj. habitual, habitual adverb: habitual"]},{"name":"hardwired","trans":["adj. hardwired"]},{"name":"hardy","trans":["adj. Hardy hardy; strong; brave; reckless; n. strong people; cold-resistant plants; square chisels Hardy Hardy Comparative grade: hardier, hardiest Adverb: hardil..."]},{"name":"harmonise","trans":["VT. & vi. harmony, coordination, proportionality; singing or playing in harmony; n. harmony, coordination, proportionality; n. person who brings harmony and harmony"]},{"name":"harridan","trans":["n. Grumpy old woman, old vixen"]},{"name":"hasten","trans":["vt. Urge; speed up; speed up; vi. hurry; hastened tense: hastened, hastening, hastens"]},{"name":"haunting","trans":["adj. What is hard to forget, haunts the heart; gives people a strong feeling; v. often goes; haunts someone; haunts... in the heart"]},{"name":"havoc","trans":["n. Massive damage; havoc; devastation; vt. Serious damage; vi. Destroy the Havoc (US) night bomber, medium bomber timing: havocked, havocking, havocs"]},{"name":"headline","trans":["n. Large title; news feed tense: headlined, headlining, headlines"]},{"name":"headquarters","trans":["n. Headquarters, main store; headquarters, headquarters"]},{"name":"heady","trans":["adj. Easy to get drunk [dizzy]; intoxicating; adv. intoxicated; excitedly; n. intoxicated; excited Comparative level: headier, headiest adverb: headily Noun:..."]},{"name":"hedge","trans":["vt. Use a fence; avoid positive responses; vi. Use hedges; avoid positive responses; n. hedges; obstacle tense: hedged, hedging, hedges Noun: hed..."]},{"name":"hiccup","trans":["n. 嗝，呃逆; 连续地打嗝; 暂时性的小问题；短暂的停顿 时 态: hiccupped also hiccoughed hiccupping hiccoughing hiccups ..."]},{"name":"hierarchy","trans":["n. Hierarchy; ruling group, leadership"]},{"name":"hiker","trans":["n. Hikers, long-distance travelers"]},{"name":"hindquarters","trans":["n. Hips and legs"]},{"name":"hindrance","trans":["n. Obstructing things or people"]},{"name":"homogenous","trans":["adj. homogenous, pure"]},{"name":"honoraria","trans":["honoraria"]},{"name":"hormonal","trans":["adj. hormonal, hormonal"]},{"name":"hostile","trans":["adj. hostile, unfriendly; enemy, enemy"]},{"name":"hover","trans":["vi. circling; wandering, walking around; hesitating, swaying irregular timing: hovered, hovering, hovers Noun: hoverer"]},{"name":"hunch","trans":["n. Premonition; large block; meat peak vt. Shrug; anticipate; bend over and hump vi. bulging; moving forward tense: hunched, hunched, hunches"]},{"name":"hurdle","trans":["n. Obstacles; jump bars; bars; vt. Overcome; vi. overcome; skip tense: hurdled, hurdling, hurdles Noun: hurdler"]},{"name":"hydropower","trans":["n. Electricity generated by hydropower"]},{"name":"hype","trans":["n. Scattered advertising campaigns; vt. hyped; exaggerated propaganda; artificially stimulated, encouraged; very excited; very worried; hyped tense: hyped, hypes"]},{"name":"hypnotic","trans":["adj. hypnotic, hypnotic; easily hypnotized; n. sleeping pills; person in a hypnotic state adverb: hypnotically"]},{"name":"iconic","trans":["adj. Iconic, figurative"]},{"name":"idiom","trans":["n. Idioms, idioms; vernacular"]},{"name":"idiosyncratic","trans":["adj. Of a special substance, of a special substance, of a different nature"]},{"name":"idyllic","trans":["adj. idyllic, idyllic"]},{"name":"illusion","trans":["n. Illusion, illusion, misconception; fictional adjective: illusionless"]},{"name":"imitation","trans":["n. Imitation, imitation; imitation, counterfeit Adjective: imitational"]},{"name":"immerse","trans":["vt. immerse; immerse in the tense: immersed, immersing, immerses"]},{"name":"immigration","trans":["n. Immigration checkpoints; immigrants"]},{"name":"impartial","trans":["adj. unbiased; fair, just noun: impartiality; adverb: impartial: impartial"]},{"name":"impede","trans":["vt. block; hinder; hinder tense: impeded, impedes"]},{"name":"imperative","trans":["adj. necessary, urgent, extremely important; commanded; prayed for; n. Necessary, something that must be done; praying adverb: impertinent"]},{"name":"impetus","trans":["n. Propulsion; motivation; impulse"]},{"name":"impinge","trans":["vi. impact; violation; vt. impact tense: impinged, impinging, impinges Noun: impingement Noun: impingement..."]},{"name":"implicate","trans":["vt. 牵连, 涉及时 态: implicated, implicating, implicates"]},{"name":"importation","trans":["n. Imports; Imports; Imports; Imports"]},{"name":"impoverished","trans":["adj. poor, powerless, exhausted"]},{"name":"improvise","trans":["VT. & vi. improvised, improvised, improvised Noun: improviser"]},{"name":"inaccessible","trans":["adj. unreachable noun: inaccessible adverb: inaccessible"]},{"name":"inaugurate","trans":["vt. To hold an inauguration ceremony for...; to hold a ceremony for...; to hold an inauguration ceremony for...; pioneering, founding tense: urated, urates Noun:..."]},{"name":"incapacitate","trans":["vt. make incompetent, make unsuitable tense: incapacitated, incapacitates noun: incapacitation"]},{"name":"incineration","trans":["n. Incineration; burning to ash"]},{"name":"inclination","trans":["n. Hobbies, preferences, intentions; tendencies, tendencies, trends; leaning, bending, bowing, nodding; slope, slope"]},{"name":"incompatible","trans":["adj. uncompatible, uncompatible adverb: incompatibly"]},{"name":"incongruous","trans":["adj. incongruent, incongruent, disproportionate adverb: incongruously"]},{"name":"incredible","trans":["adj. unbelievable, unbelievable; 'unjust' an adverb of unbelievable, incredible, amazing: unbelievable"]},{"name":"increment","trans":["n. Growth; incremental adjective: incremental"]},{"name":"inedible","trans":["adj. unedible noun: inedibility"]},{"name":"infirmity","trans":["n.Weakness, weakness; disease, condition"]},{"name":"inflation","trans":["n. Inflation; inflation"]},{"name":"inflict","trans":["vt. to impose, to bear, to suffer tense: inflicted, inflicts adjective: inflictive"]},{"name":"influenza","trans":["n.Influenza"]},{"name":"innate","trans":["adj. innate; inherent; innate adverb: innately Noun: innateness"]},{"name":"innocent","trans":["adj. innocent; innocent; ignorant; naive person; stupid adverb: innocently"]},{"name":"instalment","trans":["n. Part; one episode; amounts paid in each instalment, in installments"]},{"name":"intent","trans":["n. Intent; Purpose; Meaning; adj. attentive; eager; determined adverb: intently Noun: intentness"]},{"name":"interchangeable","trans":["adj. Exchangeable, interchangeable, interchangeable; n. Exchangeability, interchangeability, interchangeability; adv. interchangeably, alternately adverb: interchangeably"]},{"name":"interdependence","trans":["n. Interdependence"]},{"name":"interminable","trans":["adj. It lasted too long; n. Endless; adv. endless, endless adverb: interminably"]},{"name":"intermittently","trans":["Adv. intermittently"]},{"name":"intermix","trans":["vt. Confuse...; mix...; vi. mixed tense: intermixed, intermixed, intermixes"]},{"name":"intermodal","trans":["adj. Intermodal transportation"]},{"name":"internationalist","trans":["n. Internationalists"]},{"name":"interpreter","trans":["n. Interpreters; interpreters; interpreters; interpreters; interpreting procedures"]},{"name":"interruption","trans":["n. Interruptions, interruptions; obstacles, disruptions"]},{"name":"intrusion","trans":["n. Breaking in; disrupting; interfering"]},{"name":"inundation","trans":["n. Submersion, flooding; flooding; surging; overwhelming"]},{"name":"invalid","trans":["adj. unfounded; useless, ineffective; adj. sick; n. patient, disabled tense: invalided, invaliding, invalids Noun: i..."]},{"name":"invaluable","trans":["adj. inestimable, very valuable adverb: invaluably"]},{"name":"inventory","trans":["n. Detailed catalogue, inventory list"]},{"name":"irrelevant","trans":["adj. irrelevant, irrelevant adverb: irrelevant"]},{"name":"irresistible","trans":["adj. irresistibly; irresistibly; irresistibly"]},{"name":"irrevocable","trans":["adj. irrevocably: irrevocably"]},{"name":"irrigate","trans":["vt. Irrigate; rinse; freshen; vi. irrigation; irrigation tense: irrigated, irrigating, irrigates Noun: irrigation Noun:..."]},{"name":"jealously","trans":["Adv. jealously, suspiciously"]},{"name":"jerky","trans":["adj. hasty; reckless; stupid; dumb Comparative grade: jerkier, jerkiest adverb: jerkily Noun: jerkiness"]},{"name":"jolt","trans":["vt. & vi. JOLT; JOLT: JOLT: JOLTED, JOLTING, JOLTS NAME: JOLTER SONG LYRICS: JOLTILY SONG LYRICS:..."]},{"name":"judicious","trans":["adj. wise; clear adverb: judiciously"]},{"name":"judo","trans":["n.Judo; adj. judo; noun of judo art: judoist"]},{"name":"jury","trans":["n. Jury; Judging Committee; adj. emergency"]},{"name":"justification","trans":["n. Reason; defense; deemed reasonable, justified; exoneration"]},{"name":"kidney","trans":["n.Kidney, kidney; lower back"]},{"name":"lantern","trans":["n. Lanterns; lanterns-style skylights"]},{"name":"largish","trans":["adj. Slightly big; quite big"]},{"name":"lash","trans":["vt. Whipping; swinging; bundling; shock; incitement; irony; vi. whipping; punching; rapid flapping; n. whipping; lashes; whipping; scolding; sarcasm LASH carrying a barge tense: lashed, lashing, la..."]},{"name":"laundry","trans":["n. Laundry, laundry room; washed clothes; clothes to be washed"]},{"name":"lawlessness","trans":["n. Disobeying the law; not bound by law; not enforcing the law; undisciplined; illegal, illegal"]},{"name":"lease","trans":["n. Lease; Tenancy; Lease; Tenancy; vt. Rent; rent; vi. Rental tense: leased, leasing, leases Adjective: leasable Noun:..."]},{"name":"legacy","trans":["n. Inheritance, bequests; relics"]},{"name":"legion","trans":["n. Ancient Roman legions; numerous, numerous"]},{"name":"legitimate","trans":["adj. Legitimated, legitimating, legitimates, legitimating, legitimates"]},{"name":"liberal","trans":["adj. generous; unfettered; generous; liberal; n. liberal adverb: liberally"]},{"name":"lightweight","trans":["adj. Lightweight, thin; unserious; unimpressive; n. lightweight boxers; people who weigh less than normal; things that weigh less than normal; people [things] that are not important; people [things] who have no influence [thing]"]},{"name":"liken","trans":["vt. compare... to; compare tenses: likened, likened, likens"]},{"name":"lingual","trans":["adj. linguistic; tongue-like, tone-phonetic; n. tongue sound, tone-phonetic adverb: ling"]},{"name":"literal","trans":["adj. verbatim; without exaggeration; literal noun: literalness"]},{"name":"literary","trans":["adj. literary; literary-proficient; written adverb: literariness"]},{"name":"loath","trans":["adj. reluctantly; reluctantly"]},{"name":"lopsidedness","trans":["n. Unbalanced, favoring one side"]},{"name":"loyal","trans":["adj. loyal, loyal; loyal; n. loyal subject; faithful believer adverb: loyally"]},{"name":"lucrative","trans":["adj. Profitable, profitable"]},{"name":"lunatic","trans":["adj. insane; crazy; stupid; n. crazy; crazy person Noun: lunatic"]},{"name":"luxuriant","trans":["adj. lush, lush; luxurious, flamboyant Noun: luxuriance Adverb: luxuriousness"]},{"name":"magnify","trans":["vt. Magnify; praise; exaggerate; vi. magnification; capable of magnifying tense: magnified, magnified, magnified"]},{"name":"mainline","trans":["n.: Mainlined, mainlining, mainlines Nouns: mainliner"]},{"name":"majestic","trans":["adj. majestic, majestic; magnificent adverb: majestically"]},{"name":"malnourished","trans":["adj. malnourished, malnourished"]},{"name":"mandate","trans":["n. Authorization; formal order; vt. administration will be entrusted to a country; authorized according to the delegated authority tense: ruling, mandating, managing Noun: mandator"]},{"name":"mansion","trans":["n. House, mansion; building"]},{"name":"manufacturable","trans":["adj. manufacturable"]},{"name":"manure","trans":["vt. fertilize; cultivate; n. fertilizer; manure timing: manured, manures"]},{"name":"mechanics","trans":["n. Mechanics; Mechanics; Machine Parts; Processes; Methods"]},{"name":"mess","trans":["vt. dirty; messy; n. messy, messy; dirty thing; untidy person; stool tense: messed, messing, messes"]},{"name":"meticulously","trans":["Adv. timid"]},{"name":"miniature","trans":["adj. very small; miniature; small; n. miniatures; miniature reproductions; miniature paintings; small portraits; small bottles of spirits Noun: miniaturist"]},{"name":"minus","trans":["prep. none, missing, poor; minus; below zero; n. minus, negative; disadvantage, deficiency; adj. negative; unfavorable; slightly below a certain standard"]},{"name":"momentum","trans":["n. Momentum; momentum; momentum complex: momenta"]},{"name":"monotonous","trans":["adj. unchanging, monotonous and boring adverb: monotonously"]},{"name":"moody","trans":["adj. moody; moody; moody; moodiness Comparative grade: moodier, moodiest Adverb: moodily Noun: moodiness"]},{"name":"morale","trans":["n. Morale, fighting spirit"]},{"name":"mutate","trans":["vt. & vi. Mutating, mutating, mutating, mutating, mutating, mutating syntax: mutative"]},{"name":"myriad","trans":["adj. Countless; various; n. Countless, extremely large; innumerable people or things"]},{"name":"mystical","trans":["adj. mystical, mystical adverb: mystically"]},{"name":"mystify","trans":["vt. mystify; confuse, confuse tense: mystified, mystifies, mystifies"]},{"name":"naive","trans":["adj. childish; inexperienced; simple; naive; frivolous adverb: naively"]},{"name":"narration","trans":["n. narrate, tell; story"]},{"name":"nasty","trans":["adj. indecent; dirty; bad tempered; sinister; n. unpleasant; sexual attraction Comparative level: nastier, nastiest Adverb: nastily Noun:..."]},{"name":"natty","trans":["adj. Clean and beautiful; chic, dexterous Comparative grade: nattier, nattiest Adverb: nattily Noun: nattiness"]},{"name":"naturalistic","trans":["adj. natural, naturalistic, natural"]},{"name":"neatness","trans":["n. Tidy; clean"]},{"name":"needy","trans":["adj. poor; poor; difficult living comparative grade: needier, neediest Noun: neediness"]},{"name":"negotiation","trans":["n. Consultation, negotiation; completion; adoption"]},{"name":"niggle","trans":["vi. Clinging to sections; time-consuming with chores; picky; vt. give... petulously; negligent tense: niggled, niggles, nigglers Noun: niggler"]},{"name":"nomadic","trans":["adj. nomadic; wandering; swimming"]},{"name":"nominal","trans":["adj. nominal, unreal; rare; symbolic adverb: nominally"]},{"name":"nonpolitical","trans":["adj. non-political"]},{"name":"nonrefundable","trans":["adj. irrefundable"]},{"name":"nonsense","trans":["n. Misconceptions; nonsense; nonsense; foolish behavior; recklessness; unacceptable behavior; meaningless words; meaningless articles; int. absurd"]},{"name":"noticeably","trans":["adv. Visible Land, Clear View"]},{"name":"notification","trans":["n. Notice, notice, notice"]},{"name":"novelty","trans":["n. Novelty; novelty; novel people; novel, compact and inexpensive items"]},{"name":"nuisance","trans":["n. Hateful things"]},{"name":"numerate","trans":["vt. read; count, list; adj. Numerological, computable tense: numerated, numerating, numerates Noun: numeracy"]},{"name":"obedient","trans":["adj. submissive; adverb of submissive: obediently"]},{"name":"obnoxious","trans":["adj. Extremely unpleasant; obnoxious; abhorrent; adv. extremely unpleasant; objectionable; n. obnoxious; abhorrent"]},{"name":"obsession","trans":["n. Disturbed, inescapable thought Adjective: obsessional adverb: obsessionally"]},{"name":"oddly","trans":["Adv. weirdly; wonderfully; singular"]},{"name":"offence","trans":["n. Attack; breach; crime; fault"]},{"name":"oily","trans":["adj. oily; oily; oil with smooth texture; comparative grade of oil quality: oilier, oiliest adverb: oilily Noun: oiliness"]},{"name":"onset","trans":["n. Begin; attack, attack"]},{"name":"onshore","trans":["adj. coastal; on shore, near shore; towards shore, towards land"]},{"name":"onslaught","trans":["n. Onslaught, attack"]},{"name":"ornamental","trans":["adj. decorative, decorative adverb: ornamented"]},{"name":"outing","trans":["n. Excursions; short trips; sports competitions; adj. Suitable for hiking; v. coming out; exposure"]},{"name":"overbearing","trans":["adj. bossy, arrogant; intolerable"]},{"name":"overcrowded","trans":["; adj. overcrowded"]},{"name":"overdone","trans":["v. Cooking... too long; overworking; overcooking...; adj. Too long cooked; overcooked"]},{"name":"overlying","trans":["present participle of overlie"]},{"name":"overnight","trans":["Adv. At night, in the middle of the night; suddenly and very quickly; adj. all night, night; sudden; fast tense: overnightly, overnighter, overnight"]},{"name":"overshadow","trans":["vt. to darken; to darken; to make unpleasant or less pleasant; to underestimate or overshadow tense: overshadowing, overshadowing, overshadows"]},{"name":"overstaffed","trans":["adj. Overwritten, people are stuck in their own way"]},{"name":"overstate","trans":["vt. 夸大时 态: overstated, overstating, overstates 名 词: overstatement"]},{"name":"oxygenated","trans":["Oxygenated"]},{"name":"painstaking","trans":["adj. extremely careful; hardworking, hardworking adverb: painstakingly"]},{"name":"pamper","trans":["vt. pampering; pampering; pampering; pampering; pampers Noun: pamperer"]},{"name":"pamphlet","trans":["n. Booklets"]},{"name":"panting","trans":["adj. gasping; v. pulsation, fluctuation, shaking, vibration"]},{"name":"parade","trans":["n. Parade; military parade; march; show off; military parade ground; vt. Show off; parade; line up; vi. parade; line up; show off tense: paraded, parading, parades Noun:..."]},{"name":"paradoxical","trans":["adj. unintended; unexpected; bizarre; contradictory"]},{"name":"paralysed","trans":["paralyzed; astonished"]},{"name":"paramount","trans":["adj. highest, supreme; first, main noun: paramountbankrupt"]},{"name":"paternal","trans":["adj. father's; obtained from father; fatherly adverb: paternally"]},{"name":"patriotic","trans":["adj. Patriotic, patriotic"]},{"name":"patronage","trans":["n. Support, funding; sponsorship; patronage; patronage; mutual benefit"]},{"name":"pavilion","trans":["n. Large tents; pavilions; pavilions; exhibition halls; vt. Set up a tent; place... in a pavilion; cover time: pavilioned, pavilioning, pavilions"]},{"name":"paycheck","trans":["n. Payroll checks, payroll"]},{"name":"peninsula","trans":["n.: peninsular"]},{"name":"peril","trans":["n.；; vt. Periled also perilled periling perils perils"]},{"name":"periodic","trans":["adj. periodic adverb: periodic"]},{"name":"peripherally","trans":["Adv. Peripheral ground, external ground"]},{"name":"perish","trans":["vt. numb; destroy; vi. death; destruction; decay; withering tense: perished, perishing, perishes"]},{"name":"perquisite","trans":["n. Financial allowances, additional income, allowances, bonuses, tips; benefits, benefits, amenities, privileges, benefits"]},{"name":"persevere","trans":["vi. 坚忍, 坚持时 态: persevered, persevering, perseveres 副 词: perseveringly"]},{"name":"persistently","trans":["Adv. persevere; continuously; frequently"]},{"name":"peruse","trans":["vt. Detailed examination; intensive reading tense: perused, perusing, peruses Noun: perusal Noun: peruser"]},{"name":"pervasive","trans":["adj. ubiquitous; ubiquitous; everywhere; adv. everywhere; everywhere; n. everywhere; everywhere"]},{"name":"perversely","trans":["Adv. stubbornly"]},{"name":"physiology","trans":["n. Physiological noun: physiologist"]},{"name":"pickings","trans":["n. Wrongful wealth; wealth easily obtained"]},{"name":"pictorial","trans":["adj. pictorial; an adverb with a picture: pictorious"]},{"name":"picturesque","trans":["adj. beautiful, interesting, picturesque; vivid; lively adverb: picturesquely Noun: picturesqueness"]},{"name":"piercing","trans":["adj. sharp; harsh; piercing; penetrating"]},{"name":"pinprick","trans":["n.: pinpricked, pinpricking, pinpricks"]},{"name":"plagiarise","trans":["vt. plagiarism, plagiarism"]},{"name":"playmate","trans":["n. Travel partner; playmate"]},{"name":"plight","trans":["n. Difficulties; Circumstances; Pledges; vt. Guarantee; agreed timing: pleases, plights, plights"]},{"name":"plunge","trans":["n. Put in; jump in; vi. Put in; jump in; fall in; vt. get involved; make into; make into the tense: plunged, plunging, plunges"]},{"name":"plush","trans":["adj. luxurious; made of plush; comfortable; n. Plush Comparative grade: plusher, plushest"]},{"name":"poised","trans":["adj. in an unstable state; ready to act; suspended; carefully balanced; calm; calm"]},{"name":"pole","trans":["n. Pillar; pole; stick; cane; pole; ground pole; magnetic pole; electrode; one of the two opposite poles; extreme; v. bracing a boat; polen. Polish tense: poled, poling, poles"]},{"name":"poll","trans":["n. Public opinion polls; votes; number of votes; polling stations; vt. Cut short; conduct a poll on...; get votes; vote; vi. vote; adj. Trimmed; pruned; hornless tense: polled, polli..."]},{"name":"pollinate","trans":["vt. 给…传授花粉时 态: pollinated also pollenated pollinating pollenating pollinates pollenates 名 ..."]},{"name":"populace","trans":["n. People, civilians"]},{"name":"porous","trans":["adj. penetrable; porous; porous water seeping Noun: porosity"]},{"name":"portrayal","trans":["n. Portrayal, description; description, performance; tracing, performance"]},{"name":"pragmatic","trans":["adj. pragmatical; realistic; pragmatical; pragmatical; pragmatical"]},{"name":"precarious","trans":["adj. opportunistic; uncertain; insecure; unstable adverb: precariously"]},{"name":"precedent","trans":["n. Precedents; precedents adj. ahead; ahead"]},{"name":"predicate","trans":["vt. assertion; assertion; n. predicate tense: predicated, predicating, predicates noun: predication adjective: pre..."]},{"name":"predominate","trans":["vi. dominant; vt. predominant tense in...: predominating, predominating noun: predomination"]},{"name":"preferably","trans":["Adv. more desirable; better; preferred"]},{"name":"premature","trans":["adj. premature, premature, unexpired; an adverb of premature birth: prematurely"]},{"name":"premium","trans":["n. Bonuses, allowances; markups; surcharges; insurance premiums; additional costs; adj. Premium; high quality, top quality"]},{"name":"preoccupation","trans":["n. Full attention and immersion; top priorities; things that give people full attention"]},{"name":"prepay","trans":["vt. prepayment; prepayment tense: prepaid, prepaid Noun: prepayment"]},{"name":"presently","trans":["Adv. Soon, for a while; now, for now"]},{"name":"pretender","trans":["n. Those who covet high positions"]},{"name":"preventative","trans":["adj. preventive"]},{"name":"primal","trans":["adj. initial; primitive; primary; n. release of repressed childhood emotions; vt. Release noun: primality"]},{"name":"pristine","trans":["adj. in pristine condition; undamaged; fresh and pure, fresh; pristine; ancient"]},{"name":"probe","trans":["n. Probes; Investigations; vi. investigation; detection; vt. Probe; use a probe to detect the temporal state: probed, probing, probes Noun: prober"]},{"name":"processor","trans":["n. Person processing or handling things (equipment, industry); central processing unit; data processor"]},{"name":"procrastination","trans":["n. Delays, delays"]},{"name":"prodigious","trans":["adj. unusual, amazing, bizarre; huge; adv. unusually, astonishingly; hugely"]},{"name":"profitably","trans":["Adv. beneficially; beneficially"]},{"name":"progressively","trans":["Adv. forwardly; increasingly"]},{"name":"prohibitive","trans":["adj. Prohibited to use or buy, prohibited; too expensive to buy; prohibited; adv. prohibited; n. Prohibited adverbs: prohibitively"]},{"name":"projector","trans":["n. Movie projector, slide projector"]},{"name":"proliferate","trans":["vi. ；；"]},{"name":"prominence","trans":["n. Reputation, Outstanding; Outstanding; Important; Important"]},{"name":"pronunciation","trans":["n. Pronunciation; how to read; pronunciation, pronunciation"]},{"name":"prop","trans":["n. Pillar, pillar; vt. support, support, maintain tense: propped, propping, props"]},{"name":"propellant","trans":["adj. propelled; n. propellant"]},{"name":"prospectus","trans":["n. Statutes, brochures, briefs"]},{"name":"proximity","trans":["n. Approaching, near"]},{"name":"proxy","trans":["n. Representation; proxy; agent, representing a proxy server, that is, a proxy server, to complete errand services on the Internet. When you set up a proxy server in your browser, any requests made by your browser will be sent..."]},{"name":"puff","trans":["vt. Eject, expand; exaggerate; expand; make proud and complacent; vi. Open up; promote; exaggerate; expand; n. A burst of smoke; powder puff; puff; fluff; lump; bragging, advertising tense: puffy, puffing,..."]},{"name":"puncture","trans":["n. Small hole; tire perforation; vt. Piercing; piercing; weakening; discharging someone's breath; vi. pierced tense: punctured, punctured, punctures Adjective: pun..."]},{"name":"puppetry","trans":["n. Puppets; puppets; puppet shows"]},{"name":"purist","trans":["n. Purification theorist, person who strives for purification Adjective: puristic"]},{"name":"pyrotechnics","trans":["n. Pyrotechnics, use of pyrotechnic terms: pyrotechnist"]},{"name":"quest","trans":["n. Pursue; seek; vi. seek; pursue; vt. Exploring tenses: quested, questing, quests Noun: quester"]},{"name":"quiz","trans":["n. Quiz contest; “Yumi” quiz tense: quizzed, quizzing, quizzes Noun: quizzer"]},{"name":"quote","trans":["vt. Quotation; Evidence; Quotation; vi. quote; quote; quote; n. Quoting tense: quoting, quoting, quotes Noun: quoter"]},{"name":"rash","trans":["n. Rash, rash; adj. too hasty; reckless; reckless Comparative grade: rasher, rashest Adverb: rashly Noun: rashness"]},{"name":"rationale","trans":["n. Reason; logical basis"]},{"name":"reactive","trans":["adj. reactive; reactive; chemically reactive, active adverb: reacting"]},{"name":"realm","trans":["n. Domain; Scope; Kingdom, Country"]},{"name":"reassure","trans":["vt. 消除恐惧或疑虑；恢复信心时 态: reassured，reassuring，reassures 名 词: reassurance 副 词: reassuring..."]},{"name":"rebound","trans":["vi. bouncing back; rebound; counteracting; not working; in a state of sadness and confusion, discouraged tense: rebounded, rebounds Noun: rebound..."]},{"name":"recede","trans":["vi. 后退；减弱; vt. 归还 时 态: receded, receding, recedes"]},{"name":"reciprocity","trans":["n. Mutuality; interaction; reciprocity, reciprocity"]},{"name":"reclaim","trans":["vt. demand recovery; development; reclamation; recycling from waste; correction; indoctrination, transformation; tense: reclaimed, reclaimed adjective: reclaimable"]},{"name":"recourse","trans":["n. Right of recourse; reliance; survival line; recourse, help"]},{"name":"rectify","trans":["vt. rectification; rectification; distillation tense: rectifying, rectifies adjective: rectifier Noun: rectificat..."]},{"name":"recur","trans":["vi. repeat; recur; recur; adopt; cycle; recursive tense: recurred, recurring, recurs Noun: recurrence"]},{"name":"referendum","trans":["n. Right of referendum; diplomatic petition"]},{"name":"refrain","trans":["vi. stop; avoid; abstain, restraint; n. Repetitive sentences, chorus; repetitive tense: refrained, refraining"]},{"name":"regime","trans":["n. Regime, form of government; social system; management system"]},{"name":"rekindle","trans":["vt. 使再燃时 态: rekindled, rekindling, rekindles"]},{"name":"relish","trans":["n. Taste; flavor; appetite; hors d'oeuvres; meaning; vt. Favorite; taste; seasoning for...; vi. Has a specific meaning; tastes delicious tense: relished, relishes"]},{"name":"repatriate","trans":["vt. deportation, repatriation tense: depreciated, condemned Noun: repatriation"]},{"name":"repository","trans":["n. Warehouses, storerooms; think tanks, knowledgeable people, a treasure trove of knowledge"]},{"name":"reputable","trans":["adj. Respectable; reputable; adv. Reputation is a good adverb: reputably"]},{"name":"resilience","trans":["n. Bounce; Resilience; Resilience; Resilience"]},{"name":"reticence","trans":["n. Remaining silent"]},{"name":"revolve","trans":["VT. & vi. rotation; detailed tense: revolved, revolving, revolves adjective: revolvable"]},{"name":"rift","trans":["n. Fracture, fissure; division, discord tense: rifted, rifting, rifts"]},{"name":"rig","trans":["n. Ship mast devices; complete instruments; vt. assembly of sails and rigging; rapid erection with temporary replacement materials; maneuvering, monopoly tenses: rigged, rigging, rigs"]},{"name":"rigid","trans":["adj. strict; stiff, rigid; stiff; precise adverb: rigidly Noun: rigidness"]},{"name":"rumour","trans":["n. Rumors; vt. rumours"]},{"name":"sabbatical","trans":["adj. on vacation; on public leave; n. Academic leave"]},{"name":"sack","trans":["n. Sack, bag; quantity in a bag; expulsion, dismissal; looting; vt. bagged; fired; looted, robbed tense: sacked, sacked"]},{"name":"salient","trans":["adj. significant, significant, primary; prominent; n. convex; prominent part of an offensive or defensive position"]},{"name":"salon","trans":["n. 'Law' shop, hall, hospital; salon"]},{"name":"sampling","trans":["n. Sampling; Sampling; v. Sampling; Sampling"]},{"name":"sanitary","trans":["adj. sanitary, clean; n. public toilet adverb: sanitalizing"]},{"name":"satisfactory","trans":["adj. satisfying, qualifying adverb: satisfactorily"]},{"name":"scamper","trans":["vi. 蹦蹦跳跳地跑；惊惶奔跑时 态: scampered，scampering，scampers"]},{"name":"scavenge","trans":["VT. & vi. thought it was food; in search of tense: scavenged, scavenging, scavenges"]},{"name":"scenic","trans":["adj. stage; scenic; theatrical; n. landscape photography; scenic spot"]},{"name":"sceptic","trans":["n. Skeptics; people with deep doubts"]},{"name":"scoop","trans":["n. Small spatula; small spoon; amount of one spoon; scoop; vt. Dig with a shovel, etc.; get it first; get it first, better than tense: scooped, scooping, scoops Noun: scooper..."]},{"name":"scrub","trans":["n. Dwarf trees; scrubbers; scrubbers; short people; vt. Scrub vigorously; purify; vi. Scrub; disinfect arms; adj. short; temporary; suboptimal tense: scrubbed, scrubbin..."]},{"name":"scrupulous","trans":["adj. Strict, serious, and meticulous; acting in accordance with the principles of conscience and morality; absolutely honest; sceptical, concerned; adv. meticulously; n. meticulous Noun: scrupulosity Adverb:..."]},{"name":"scuffle","trans":["n. Brawl, melee; vi. twisting, melee tense: scuffled, scuffling, scuffles Noun: scuffler"]},{"name":"seasonality","trans":["seasonally"]},{"name":"secretarial","trans":["adj. Secretary's, Secretary's"]},{"name":"selfless","trans":["adj. selfless, selfless adverb: selflessness"]},{"name":"sensor","trans":["n. Sensors"]},{"name":"servant","trans":["n. Servants, domestic workers; civil servants; employees"]},{"name":"sew","trans":["see. ,；; vi. Sewing, sewing time: sewed, sewn, sewed sewing, sews"]},{"name":"sewage","trans":["n. Sewage; dirt; sewers"]},{"name":"sex","trans":["n. Gender; sex; male; female; sexual relationships; sexual activity, tense of sexual behavior: sexed, sexing, sexes"]},{"name":"shady","trans":["adj. shady, shady; unreliable, questionable Comparative level: shadier, shadiest Adverb: shadily Noun: shadiness"]},{"name":"shove","trans":["VT. & vi. push, push, shove tense: shoved, shoving, shoves Noun: shover"]},{"name":"shovel","trans":["n. Shovel; amount of shovel; forklift; vt. Dig with a shovel; eradicate; tuck in... randomly; vi. Shovel tense: shoveled also shoveled shoveling shovelling..."]},{"name":"shrewd","trans":["adj. clever, shrewdest adverb: shrewder, shrewdest adverb: shrewdly"]},{"name":"shudder","trans":["n. 震动；发抖；战栗; vi. 发抖；战栗 时 态: shuddered, shuddering, shudders"]},{"name":"signature","trans":["n. Signature, signature"]},{"name":"signification","trans":["n. Meaning"]},{"name":"signpost","trans":["n. Road signs; signs"]},{"name":"simulate","trans":["vt. imitation; pretend; impersonation; adj. imitating; pretending tense: simulated, simulated, simulated adjective: simulated"]},{"name":"skillfully","trans":["Adv. subtly; exquisitely"]},{"name":"slam","trans":["vt. & vi. Overseas; vt. ; n.. Strategic Low Altitude Missile Low Air Missile Short Range: s..."]},{"name":"slang","trans":["n. Slang; jargon; adj. Of slang; vi. Use foul language; vt. Use slang for tense: slanged, slanging, slangs Adverb: slangily..."]},{"name":"slit","trans":["vt. Tearing; causing a slit; n. Crack; coin slot; vi. longitudinal fissure tense: slit, slits noun: slitter adjective: slitty"]},{"name":"slither","trans":["vi. Track and run ground skating; vt. make it slide; n. Glide with running tense: slithered, slithering, slithers Adjective: slithery"]},{"name":"slop","trans":["vi. overflow; spill; walk in mud; vt. Spill or spill; wobble; spill; spill; go back and forth; rest; relax; laze; defecate; shake; spill; n. Loose cover; jacket; work clothes; sewage; feces..."]},{"name":"slumber","trans":["n. Sleep; state of numbness; state of rest; vi. sleep; hibernation; numbness; vt. sleeping; sleeping tense: slumbered, slumbering, slumbers"]},{"name":"smother","trans":["vt. Choke; muffle; hold back; suppress; vi. suffocation; suppressed; suffocation; n. state of asphyxiation; suffocating heavy smoke Tense: smothered, smothering, smothers"]},{"name":"socialism","trans":["n. Socialism"]},{"name":"solemnly","trans":["Adv. solemnly; seriously"]},{"name":"specialisation","trans":["n. Specialization, specialization, specialization"]},{"name":"spinal","trans":["adj. spinal; spinal; spiny; acupuncture; n. spinal anesthetic adverb: spinally"]},{"name":"spiral","trans":["n. Spiral; vortex; spiral object; adj. circling; spiral; vt. Make a spiral; make it spiral up; vi. circling; spiraling; spiraling ascending tense: spiraled also spi..."]},{"name":"splendour","trans":["n. Brilliance, brilliance; magnificence, spectacular; splendid; splendid; splendid; eminence; excellence; glory"]},{"name":"sponge","trans":["n. seashore; vt. ，; vt. & vi. Sponge; Sponge; Sponge; Sponge; Sponge"]},{"name":"sporadically","trans":["Adv. sporadically, sporadically"]},{"name":"sprint","trans":["vi. ，; n.；; vt. All Quick Start SprintABBR. Solid Propellant Rocket Intercept Missile launch vehicle..."]},{"name":"staggering","trans":["adj. Unbelievable; shocking; adv. unbelievably; shocking adverb: staggeringly"]},{"name":"stagnant","trans":["adj. stagnant; dirty; sluggish; sluggish Noun: stagnancy Adverb: stagnancy"]},{"name":"stainless","trans":["adj. stainless; made of stainless steel; spotless, flawless"]},{"name":"stake","trans":["n. Stakes, sticks; burning; bets; bonuses; vt. Funding, support; linking... to the stake; betting on...; vi. Betting timing: staked, staked, stakes"]},{"name":"staple","trans":["n. Main products; staples; themes; staple foods; vt. Use staples; grade...; adj. mainly, mass-produced; commonly used; timing of textile fibers: stapled, stapled, staples"]},{"name":"stare","trans":["vt. & vi. Vision；Video time: stared，staring，stares Names: starer"]},{"name":"starkly","trans":["Adv. harshly; obviously; undisguised"]},{"name":"sticky","trans":["adj. sticky; sticky; humid; hot and humid; difficult to handle; tricky Comparative grade: stickier, stickiest Noun: stickiness"]},{"name":"stitch","trans":["n. Pin, thread; one pin; vt. Sew, sew; vi. stitch, stitch tense: stitched, stitched noun: stitcher"]},{"name":"stout","trans":["adj. Sturdy; chunky; brave; intense; n. Chunky; strong beer Comparative grade: stouter, stoutest Adjective: stoutish Adverb: stout..."]},{"name":"straightaway","trans":["Adv. immediately; immediately"]},{"name":"streamline","trans":["vt. Make... streamlined; simplify to make more efficient tense: streamlining, streamlines"]},{"name":"stricken","trans":["adj. Those affected by a disaster, those who have suffered damage; those who have endured or suffered excruciating..."]},{"name":"stringent","trans":["adj. strict; strict; austere; scarce noun: stringency Adverb: stringently"]},{"name":"stripe","trans":["n. Condition，；; vt. Canadian Style: striped, striping, stripes"]},{"name":"submarine","trans":["n. Submarine; submarine sandwich, long roll sandwich; adj. Under the sea, under the sea"]},{"name":"submerge","trans":["VT. & vi. Dive into the water, submerge; vt. complete masking, masking tense: submerged, submerging, submerges Noun: submergence"]},{"name":"subordinate","trans":["n. Subordinate, subordinate, subordinate; subordinate, secondary vt. Make... subordinate; make... obey adj. subordinate, subordinate; secondary tense: subordinated, subordinated, subord..."]},{"name":"successive","trans":["adj. continuous, sequential adverb: successive"]},{"name":"suckle","trans":["vt. Give... breastfeed; suck; nurture; vi. Breastfeeding timing: suckled, suckling, suckles"]},{"name":"suffice","trans":["vt. Satisfy; Adequate... Use; Qualify; vi. sufficient; capable tense: sufficed, sufficed, suffices"]},{"name":"surrender","trans":["VT. & vi. Surrender; vt. abandon; n. surrender, abandon tense: surrendered, surrendering, surrenders"]},{"name":"survivor","trans":["n. Survivors; Survivors; Survivors"]},{"name":"sustenance","trans":["n. Food; Nutrition; Nutrients"]},{"name":"swap","trans":["n. Exchange; vt. & vi. swapped tense: swapped also swapped swapping swapping swaps swops noun: swapper"]},{"name":"swivel","trans":["n. Swivels, swivels; swivels; rotary joints; vt. & vi. spin; turn on the pivot; turn to the other side; turn, rotate tense: swiveled, swiveled swiveling, swiv..."]},{"name":"tactics","trans":["n. Tactics; the plural of tactics, means"]},{"name":"taunt","trans":["n. 嘲弄；讥讽; vt. 逗弄；奚落; adj. 很高的 时 态: taunted, taunting, taunts 副 词: tauntingly"]},{"name":"technician","trans":["n. Technicians, experts; people with good skills"]},{"name":"tectonic","trans":["adj. tectonic; geologically structured; very important; having significant influence"]},{"name":"temper","trans":["n. Temper; temperament; temperament; tendencies; vt. Reconcile; Exercise; Relieve; Rejuvenate; vi. tempering; harmonizing tense: tempering, tempering, tempers Noun: t..."]},{"name":"tenable","trans":["adj. Standing; maintainable"]},{"name":"tenet","trans":["n. Principles, creeds, teachings, dogmas"]},{"name":"tenuous","trans":["adj. Thin; fine; thin; poor; bland; empty; irrelevant, subtle; fragile, powerless; fine; subtle; vague; ambiguous; adv. Thin, fine; empty, unimportant, fine..."]},{"name":"terminate","trans":["v. stop, end, terminate; (bus or train) when it arrives at the terminal: terminated, terminates"]},{"name":"testament","trans":["n. Will; actual proof adjective: testamentary"]},{"name":"thatch","trans":["n. Thatched roof; unruly hair, dirty and messy hair; vt. thatched roof, thatched covered tense: thatched, thatches Noun: th..."]},{"name":"thaw","trans":["vi. Melt, dissolve; defrost; soften, warm up; ease, and friendlier; vt. melt, ease; n. Melt, thaw; warm weather tense: thawed, thawing, t..."]},{"name":"threshold","trans":["n. Threshold; the beginning of an “metaphor”"]},{"name":"thrifty","trans":["adj. frugal; thrifty; successful Comparative level: triftier, triftiest adverb: thriftily Noun: thriftiness"]},{"name":"tickle","trans":["vt. To itch; to make happy; to satisfy; vi. Feeling itchy; makes people itchy; n. Arms; Itchy; Things that make people itchy and happy Tense: tickled, tickling, tickles"]},{"name":"topple","trans":["vi. Dumping; collapsing; shaky; vt. subvert; overthrow; collapse tense: toppled, toppled, topples"]},{"name":"torch","trans":["n. Torches, torches; flashlights; inspirational objects; vi. Burning like a torch; vt. Use a torch to light tense: torched, torching, torches"]},{"name":"tout","trans":["vt. Soliciting; peddling; spying on horse racing intelligence; vi. peddling; soliciting customers; soliciting votes; n. scout; peddler Tout Tout tense: touted, touting, touts Noun:..."]},{"name":"tranquilliser","trans":["n.Sedatives; tranquilizers"]},{"name":"transferable","trans":["adj. negotiable; negotiable; deliverable; transferable; transferable"]},{"name":"triumphant","trans":["adj. triumphant, successful; joyful, exhilarating adverb: triumphantly"]},{"name":"tropospheric","trans":["adj. Tropospheric"]},{"name":"troublesome","trans":["adj. troublesome, obnoxious, annoying adverb: troublesomely"]},{"name":"tuck","trans":["vt. Roll up; squeeze in; wrap comfortably with something; make folds; close; eat big; hide; n. Protruding stern; food; creases; knee-diving; vitality; drumming; vi. Seams; shrinks; wraps comfortably inside; when swallowing; Situation:..."]},{"name":"turbid","trans":["adj. chaotic; cloudy; foggy adverb: turbidly"]},{"name":"tweak","trans":["n. Screw; twist; anxious; vt. twisting; pulling with force; full horsepower tense: tweaked, tweaking, tweaks"]},{"name":"ubiquitous","trans":["adj. ubiquitous; ubiquitously adverb"]},{"name":"uncanny","trans":["adj. horrible; bizarre; mysterious Comparative level: uncannier, uncanniest Adverb: uncannily Noun: uncanniness"]},{"name":"uncompromising","trans":["adj. uncompromising; firm adverb: uncompromising"]},{"name":"unconquerable","trans":["adj. Unconquered, Insurmountable, Unstoppable"]},{"name":"undue","trans":["adj. excessive; excessive; inappropriate; improper; undue"]},{"name":"unfit","trans":["adj. Unfit; unfit; unhealthy; vt. make unfit; make unfit; make unfit tense: unfitted, unfit; unfit Noun: unfitne..."]},{"name":"unimpeded","trans":["adj. barrier-free; unobstructed"]},{"name":"unleash","trans":["vt. release, release tense: unleashed, unleashed, unleashed"]},{"name":"unprejudiced","trans":["adj. unbiased, unbiased, impartial"]},{"name":"unrivalled","trans":["adj. invincible, unrivaled, unrivaled"]},{"name":"unscathed","trans":["adj. undamaged, unharmed"]},{"name":"unsolicited","trans":["adj. unsolicited, voluntarily provided"]},{"name":"unswerving","trans":["adj. Persistent, unwavering; unwavering; unbiased; adv. relentlessly, unswervingly"]},{"name":"unveil","trans":["vt. Remove the mask of..., remove the cover of...; make public; reveal; vi. remove the veil; unveil; reveal the tense: unveiled, unveiled"]},{"name":"upright","trans":["adj. upright, honest; vertical, upright; straight; proper; n. erect; vertical adverb: uprightly Noun: uprightness"]},{"name":"urgency","trans":["n. Urgent; Urgent; Urgent; Urgent; Urgent; Persistent"]},{"name":"vaccine","trans":["n. Vaccines; Pox vaccine; adj. Those with acne; those with vaccines"]},{"name":"van","trans":["n. Power supply；electric motor；power supply; vt. Used Van Timings: vanned, vanning, vans"]},{"name":"vandalism","trans":["n. Wantonly destruction of public goods and other virtues; Vandalism style Vandalism Vandalism Vandalism"]},{"name":"variability","trans":["n. Variability; variability; tendency to change"]},{"name":"vend","trans":["vt. sale; sale, sale; publication; statement tense: vended, vending, vends"]},{"name":"vent","trans":["n. Outlet; vent; vt. Let out your feelings; let go...; open a hole for...; vi. relieves stress; release tense: vented, venting Noun: venter"]},{"name":"veracity","trans":["n.Honest; true"]},{"name":"veranda","trans":["n. Balconies; hallways, verandas"]},{"name":"versatile","trans":["adj. having multiple disciplines, skills, or occupations; versatile; versatile, multipurpose adverb: versatilely Noun: competent"]},{"name":"vested","trans":["adj. established; clothed; v. clothed; granted"]},{"name":"veteran","trans":["n. Experienced people; veterans; veterans"]},{"name":"vicissitude","trans":["n. Change, rise and fall"]},{"name":"victimise","trans":["vt. blaming or punishing someone improperly; improperly harming or suffering someone; bullying someone"]},{"name":"villa","trans":["n. Villas; suburban homes"]},{"name":"virgin","trans":["adj. virgin; pure; unused, in pristine condition; n. virgin"]},{"name":"vitality","trans":["n. Vitality, vitality; vitality, vividness"]},{"name":"vow","trans":["n. Pledge; solemn declaration; make a wish; vt. & vi. swear, swear; solemnly declare tense: vowing, vows Noun: vower"]},{"name":"wade","trans":["vt. & vi. Wading, wading, wades: waded, wading, wades"]},{"name":"waist","trans":["n.Waist, waist"]},{"name":"wardrobe","trans":["n. Wardrobe; all costumes; rows"]},{"name":"wary","trans":["adj. alert; cautious; fearful; thoughtful comparative level: warier, wariest adverb: warily Noun: wariness"]},{"name":"watertight","trans":["adj. Leakproof, watertight"]},{"name":"wean","trans":["vt. wean; give up; give up; n. Toddler tense: weaned, weaning, weans"]},{"name":"wedge","trans":["vt. Wedge; squeeze in; wedge; vi. wedge; squeeze in; n. wedge; wedge; something that causes splitting tense: wedged, wedging, wedges"]},{"name":"weld","trans":["vt. Welding; combining; forming a whole; vi. Solder firmly; n. Weld; welding point timing: welding, welds"]},{"name":"whim","trans":["n. Momentary interest, sudden thoughts, sudden fantasies, whimsy"]},{"name":"wilderness","trans":["n. Wilderness; desert; wild; no longer in power"]},{"name":"worship","trans":["vt. 崇拜；尊崇; vi. 做礼拜 时 态: worshiped ，worshipped worshiping ，worshipping worships ，worships"]},{"name":"wring","trans":["vt. twisting, twisting; clenching; twisting; twisting tense: wrung wringing, wrings"]},{"name":"writhe","trans":["vi. peristalsis; tumbling; vt. twisting; n. twisting; distress; tumbling tense: writhed, writhing, writhes"]},{"name":"zipper","trans":["n. Zippers; vi. Zip it up; vt. Fasten it with a zipper"]}]