[{"name":"abrupt","trans":["adj. sudden; abrupt; steep; blunt adverb: abruptly Noun: abruptness"]},{"name":"abuse","trans":["n. Abuse; abuse; abuse; disadvantages; vices, bad habits; vt. abuse; abuse tense: abused, abusing, abuses Noun: abuser"]},{"name":"acute","trans":["adj. severe, acute; intense; sharp; loud adverb: acuteness"]},{"name":"adept","trans":["adj. skilled; good at...; n. insider; skilled adverb: adeptly Noun: adeptness"]},{"name":"admire","trans":["vt. Admire; praise; vi. admiration; praise tense: admired, admiring, admires Noun: admirer Adverb: admiringly"]},{"name":"admit","trans":["VT. & vi. permission to enter; recognition, confession tense: consent, admits"]},{"name":"aerial","trans":["adj. airborne, airborne; present or suspended in the air, aerial; n. antenna"]},{"name":"aesthetic","trans":["adj. An adverb relating to beauty, aesthetic; pleasing, elegant: aesthetically"]},{"name":"agenda","trans":["n. Issues; agenda; objectives"]},{"name":"aggression","trans":["n. Aggression, violation, provocation; act of aggression, violation"]},{"name":"allocation","trans":["n. Allocations, allocations; allocations"]},{"name":"ambulance","trans":["n. Ambulances"]},{"name":"ample","trans":["adj. rich; sufficient; spacious Comparative level: ampler, amplest Noun: ampleness Adverb: amply"]},{"name":"apt","trans":["adj. Easy to..., prone to...; apt, suitable; clever, dexterous AptaBr. Advanced Passenger Train Advanced Passenger Train Adverb: aptly name..."]},{"name":"ascertain","trans":["vt. Clarify, determine, pinpoint the tense: ascer, ascertains adjective: ascertainable Noun: asc..."]},{"name":"assert","trans":["vt. asserting; asserting; asserting; maintaining, adhering to the tense: asserted, asserting, asserts"]},{"name":"asset","trans":["n. Assets; useful things; favorable conditions; advantages"]},{"name":"assure","trans":["vt. guarantee; guarantee; make sure; figure out the tense: assured, assuring, assures Adjective: assurable Noun: assurer"]},{"name":"astonishing","trans":["adj. Surprising, amazing; adv. amazingly, amazingly"]},{"name":"autism","trans":["n.Autism; egocentric adjective: autistic"]},{"name":"aviation","trans":["n. Aviation; flight techniques; aircraft manufacturing"]},{"name":"bacterial","trans":["adj. noun of bacteria: bacteria"]},{"name":"ballet","trans":["n. Ballet; ballet; ballet company adjective: balletic"]},{"name":"bibliography","trans":["n. Bibliography; Bibliography, Philological Adjective: bibliography"]},{"name":"bicentennial","trans":["n. 200th year, 200th anniversary"]},{"name":"blowhole","trans":["n. Ventilation holes; water spray holes; rock holes; bubbles"]},{"name":"blurred","trans":["vague"]},{"name":"bonus","trans":["n. Bonuses; bonuses; additional allowances BonusABBR. Boling Nuclear Superheat Reactor Boiling Superheated Nuclear Reactor"]},{"name":"boom","trans":["vt. Make a loud noise; prosper; vi. booming sound; rapid development; n. prosperity; rumbling sound; boom tense: boomed, booming, booms"]},{"name":"bounce","trans":["n. Elasticity; vitality; jump; vt. Bounce; make it bounce; vi. bounce, bounce; bounce; bounce back tense: bouncing, bounces"]},{"name":"brake","trans":["vi. brake; n. brake, brake; obstruction; vt. Braking timing: braked, braked, brakes"]},{"name":"breakthrough","trans":["n. Breakthrough points, breakthrough progress, important new discoveries"]},{"name":"bronze","trans":["n. Bronze; Bronze, Auburn; Bronze Artwork, Bronze Medal Tense: bronzed, bronzed Noun: bronzer Adjective: bronzy"]},{"name":"bud","trans":["n. Buds, sprouts; buds; vi. Sprout, sprout; vt. Germinate tense: budded, budding, buds"]},{"name":"bug","trans":["n. Bugs; germs; faults; eavesdropping; vt. Installing an eavesdropping device; eavesdropping; disturbing a bug program defect, bug, or any kind of problem or defect in a computer system or program that impairs the ability to function properly can be called “b..."]},{"name":"bulb","trans":["n. Electric bulbs; spheres; bulbs; vi. Raw bulb; expands into a ball"]},{"name":"burrow","trans":["VT. & vi. excavation; excavation; vi. scavenging; n. Burrowed, burrowing, burrows"]},{"name":"bypass","trans":["vt. bypass, avoid; disregard; n. Bypass tense: bypass, bypass"]},{"name":"calculation","trans":["n. Computation, calculation; inference; prediction, estimation; calculation, careful planning; selfish intention; arithmetic adjective: calculative"]},{"name":"cap","trans":["n. Hat; cap; vi. Hats off; vt. Cover; overcome; give... wear a hat; stamped with Cap Capricorn capabBr. Common Agricultural Policy Common Agricultural Policy..."]},{"name":"carbohydrate","trans":["n.Carbohydrates; Sugars; starchy or sugary foods"]},{"name":"census","trans":["vt. carrying out statistical surveys; n. population censuses, population surveys"]},{"name":"ceramic","trans":["adj. Pottery; ceramic; pottery art; n. ceramic products; ceramic adjective: ceramic"]},{"name":"chaos","trans":["n.Chaos, chaos Adjective: chaotic"]},{"name":"chop","trans":["n. Chop; ribs; trademark; cut balls; vt. chop; chop; ugly tense: chopping, chops"]},{"name":"clown","trans":["n. Clowns; country people; rude and clumsy people; vi. clowning; foolish tense: clowned, clowning, clowns adjective: clownish"]},{"name":"coarse","trans":["adj. rough; inferior; vulgar comparative grade: coarser, coarsest adverb: coarse noun: coarse"]},{"name":"coincide","trans":["vi. Consistent, congruent; simultaneous occurrence tense: coincided, coincided, coincides"]},{"name":"collaborate","trans":["vi. Cooperation; collusion against the country; n. Collaborator, collaborator; collaborator tense: collaborated, collaborating, collaborators Noun: collabor..."]},{"name":"combat","trans":["vt. Fight against; against; vi. fight; fight; n. fight; argument; adj. Fighting; the tense of fighting for...: combated, combatted attacks, com..."]},{"name":"companion","trans":["n. Companions, partners; one of the paired items; tense: companioned, companions"]},{"name":"concur","trans":["vi. Consent; Consent; Mutual Assistance tense: concurred, concurring, concurs"]},{"name":"conjunction","trans":["n. Conjunctions; Combinations; Joint Adjectives: conjunctional"]},{"name":"conquer","trans":["vt. Conquer, conquer; destroy, overcome; vi. triumphant tense: conquered, conquering, conquers adjective: conquerable"]},{"name":"contend","trans":["vi. competition; struggle; struggle; argument; vt. claim; fight for... tense: contended, contending, contends Noun: contender"]},{"name":"contrary","trans":["adj. opposite, contrary; n. opposite, opposite adverb: contrarian noun: contrariness"]},{"name":"counsel","trans":["n. Advice; discussion; consultation; decision making; legal counsel; vt. Advise; suggest; vi. Give advice; discuss the tense: counseled, counseled, couns..."]},{"name":"crane","trans":["n. Cranes; cranes, cranes; vi. Stretch your neck and look; hesitate; vt. Lift with a crane; extend neck Tense: craned, craning, cranes"]},{"name":"creep","trans":["vi. crawling; moving slowly; getting goosebumps; spreading; n. crawling; feeling creepy; flatterer tense: crept creeping, creeps"]},{"name":"critic","trans":["n. Critics, critics; love picky people"]},{"name":"crown","trans":["n. Crown; royal power; flower crown; apex; vt. crowning; standing at the top; commendation; bringing to a successful completion tense: crowned, crowning, crowns"]},{"name":"culminate","trans":["VT. & vi. extreme tense: culminated, culminated, culminates Noun: culminated"]},{"name":"curtain","trans":["n. Curtains; curtains; vt. Shielding; when installing curtains: currying, currying, curtains"]},{"name":"cyclist","trans":["n.Bikers"]},{"name":"dash","trans":["n. Dash; collision; vt. Destroy...; crash; splash; vi. Strong charge; impact dashABBR. Drone Antisubmarine Helicopter Radio Controlled Anti-Submarine Helicopter..."]},{"name":"dazzling","trans":["adj. dazzling; dazzling; v. dazzles..."]},{"name":"decent","trans":["adj. decent; decent; quite good adverb: decently"]},{"name":"denote","trans":["vt. denotes, indicates tense: denoted, denotes adjective: denotable"]},{"name":"dense","trans":["adj. thick; dense; blunt comparative grade: denser, densest adverb: densely Noun: denseness"]},{"name":"deplete","trans":["vt. “Positive” greatly reduces; makes the tense empty: depleted, depleted, depletes"]},{"name":"depressed","trans":["adj. demoralized, sad, depressed; depressed; depressed; depressed"]},{"name":"derelict","trans":["adj. Neglected; abandoned; ownerless; n. abandonment; derelict person; abandoned person"]},{"name":"detective","trans":["n. Detective"]},{"name":"devastate","trans":["vt. destroy; make barren; emotionally crush tense: devastated, destroyed Adverb: devastatingly Noun: d..."]},{"name":"diameter","trans":["n. Diameter; magnification adjective: diametral"]},{"name":"divorce","trans":["vt. divorce, separation; divorce from; n. divorce; separation; vi. Divorce Tense: Divorces, Divorces"]},{"name":"domain","trans":["n. field; industry; real estate; domain name"]},{"name":"dominance","trans":["n. Advantage; Dominance; Control"]},{"name":"dose","trans":["n. Dosage; one dose, one dose; vi. Taking medication; vt. give... medication; timing of administration: dosed, dosing, administering Noun: doser"]},{"name":"drill","trans":["n. Drill; drilling machine; planter; training; vi. drilling; training; vt. training; drilling; strip casting tense: drilled, drilling, drills Noun: driller"]},{"name":"echolocation","trans":["n. Echo localization ability, echolocation verb: echolocate"]},{"name":"elusive","trans":["adj. elusive; difficult to find; difficult to remember adverb: elusively"]},{"name":"enquire","trans":["vi. Inquire; Investigate; Greet; vt. inquire; inquire"]},{"name":"entrepreneur","trans":["n. (Law) entrepreneur; sponsor describe: entrepreneurial Noun: entrepreneurialism Noun: entrepreneurship"]},{"name":"eradicate","trans":["vt. destroy, completely eradicate; n. destroy, eradicate; n. exterminator; color fading tense: eradicated, eradicated, eradicates adjective: eradicabl..."]},{"name":"escalate","trans":["VT. & vi. Gradual escalation; gradual expansion; higher, greater tense: escalated, escalating, escalates Noun: escalation Adjective:..."]},{"name":"evaporate","trans":["VT. & vi. evaporate; vi. vanished, ceased to exist Tense: altered, affected Abbreviations: evap Noun: e..."]},{"name":"evenly","trans":["Adv. flat; evenly; equally; in balance"]},{"name":"exacerbate","trans":["vt. worsen; worsen tense: aggravate, aggravate Noun: deteriorate"]},{"name":"expertise","trans":["n. Expertise or skills"]},{"name":"fade","trans":["VT. & vi. Fade, weaken, wither; vi. Disappearing tense: faded, fading, fades"]},{"name":"faint","trans":["vi. fainted, passed out; adj. Weak, vague, dim; weak, weak; easy to lose consciousness or faint; weak, not having much effect; n. Comparative level of fainter: fainter, faintest..."]},{"name":"fasten","trans":["vt. Fasten, fasten; vt. & vi. fastened, fastened, fastens Noun: fastener"]},{"name":"feasible","trans":["adj. Feasible; Possible; Implementable"]},{"name":"filter","trans":["n. Filter, filter; vt. & vi. Through, filter; vi. Leakage tense: filtered, filtered, filters"]},{"name":"flaming","trans":["adj. ignited; burning; bright"]},{"name":"flap","trans":["VT. & vi. Move up, down, left, and right; tap; vi. anxiety, anxiety; n. flaky hanging object; slapping, slapping; excited, panicked state Tense: flapped, flapping, flaps"]},{"name":"flash","trans":["vt. Make a flash; reflect; n. Flash, flash; an instant; vi. flash, flash; reflection; adj. Sparkling, fast FlashFlash is an interactive vector illustration launched by Macromedia and We..."]},{"name":"fleet","trans":["adj. Fast, agile; n. fleet; creek; harbor; vi. gallop; fly by; pass by; vt. Comparative level of elimination: fleeter, fleetest Adverb: fleetly..."]},{"name":"folklore","trans":["n. Folk traditions; folk tales; folk adjective: folkloric adjective: folklorish Noun: folklorist"]},{"name":"forge","trans":["vt. forging; forging, imitation; vi. Suddenly moving forward; n. forging workshop; blacksmith shop; iron furnace tense: forged, forging, forges Noun: forgeability..."]},{"name":"foyer","trans":["n. Foyer, lounge; hall"]},{"name":"fraud","trans":["n. Fraud, deceptive conduct; scammer"]},{"name":"frontier","trans":["n. Borders, borders; margins of developed areas, remote areas; undeveloped areas, cutting edge"]},{"name":"fruitful","trans":["adj. successful, productive; prolific, fruity adverb: fruitfully Noun: fruitfulness"]},{"name":"fumes","trans":["n. Smoke; excitement; fantasy; v. evaporation; smoke; anger"]},{"name":"furnish","trans":["vt. furnish, furnish; provide tense: furnished, furnishes Noun: furnisher"]},{"name":"garage","trans":["n. Garage; car repair station; gas station tense: garaged, garaging, garages"]},{"name":"gentle","trans":["adj. Gentle; elegant; vt. make gentle, make tame; n. Maggot, bait Comparative grade: gentler, gentlest Noun: gentleness Adverb: gen..."]},{"name":"glance","trans":["n. Glance; Glance; Flash; vi. Glance, take a quick look; glare, glimpse; reflection; vt. Glance; Glance; Glance"]},{"name":"glide","trans":["n. Glide; glide; slide; glide; vt. Glide; glide; walk quietly; disappear; vi. glide; glide tense: glided, gliding, glides"]},{"name":"glory","trans":["n. Honor, Honor; Praise; vi. pride, pride; ecstasy"]},{"name":"harbour","trans":["n. Harbor; harbour; harbour; v. shelter, harbouring, hiding; harboured; carrying tense: harbours, harbouring, harboured Noun: harbourer"]},{"name":"harness","trans":["n. Saddlery, harnesses; vt. put on harnesses; govern, use tense: harnessed, harnessed"]},{"name":"haul","trans":["n. Hard pulling; results obtained by effort; towing, pulling; catch; amount of fish caught in one net; hauling distance; vt. hauling; hauling; vi. drag, pull; change of mind; change direction tense: hauled, hauling, h..."]},{"name":"heal","trans":["vt. cure, heal; reconcile; vi. healing tense: healed, healed, healed adjective: healable"]},{"name":"hook","trans":["VT. & vi. Hook, hang, hang; vt. bent into a hook shape; n. hook; hook; hook punch; tense at the turn: hooked, hooking, hooks"]},{"name":"ignite","trans":["vt. Ignite; burn; excite; vi. ignition; burning time: ignited, ignited, ignites"]},{"name":"imaginative","trans":["adj. imaginative; an adverb that uses imagination: imaginatively"]},{"name":"impurity","trans":["n. Impurity; impure; impure"]},{"name":"incubator","trans":["n.Incubators; thermostats"]},{"name":"incur","trans":["vt. inflict, incur; incur tense: incur, incurs"]},{"name":"index","trans":["n. Indices; Indices; Indicators; Pointers; vi. Make an index; vt. point out; indexed noun: indexer plural: indices"]},{"name":"indifference","trans":["n. I don't care, I don't care"]},{"name":"ingenuity","trans":["n. Resourceful, ingenious"]},{"name":"inhabit","trans":["vt. inhabited, inhabited tense: inhabited, inhabited, inhabits noun: habitability adjective: habitabl..."]},{"name":"inherit","trans":["vt. Inherited; inherited; vi. become an heir tense: inherited, inherit, inherits noun: inheritor"]},{"name":"injection","trans":["n.Injection, injection"]},{"name":"insert","trans":["vt. insert; embed; n. insert tense: inserted, inserted noun: inserted"]},{"name":"instruct","trans":["vt. command; professor; guide; notification tense: instructed, instructing, instructs"]},{"name":"integral","trans":["adj. noun necessary to form a whole: integrity Adverb: integrally"]},{"name":"interviewee","trans":["n. Interviewees; Interviewees"]},{"name":"intimate","trans":["adj. intimate; private; proficient; sexual; n. affectionate; confidant; vt. hint; notice; announce tense: intimated, intimating, intimates sub..."]},{"name":"intrinsic","trans":["adj. intrinsic, intrinsic adverb: intrinsically"]},{"name":"invisible","trans":["adj. unseen; hidden adverb: invisibly"]},{"name":"invoke","trans":["vt. invoke; plead; invoke; cause tense: invoke, invoke Noun: invoker"]},{"name":"irregular","trans":["adj. asymmetric, irregular; irregular; irregular; irregularly changing adverb: irregularly"]},{"name":"jam","trans":["n. Jam; overcrowding, blockage; difficult situation; dilemma; vt. & vi. plugged, jammed; malfunctioning; pinched, stuck; vt. blockage; disturbing tense: jammed, jamming, jams..."]},{"name":"jurisdiction","trans":["n. Judicial power; adjudication adjective: subjective"]},{"name":"landfill","trans":["n. Garbage heap; landfill; v. bury... in landfill tense: landfilled, landfilling, landfills"]},{"name":"legislation","trans":["n. laws; regulations; legislation, law-making"]},{"name":"liable","trans":["adj. legally responsible, obligated; vulnerable to..., vulnerable to...; inclined to do something"]},{"name":"lump","trans":["n. Lumps, lumps; tumors; many; stupid people; vt. Make it into blocks; mix it up; be patient; move it bulky; vi. agglomeration; adj. Grouped; total; adv. Very; extraordinary tense: lumped, l..."]},{"name":"magnetic","trans":["adj. magnetic, attractive; adverb of magnetic: magnetically"]},{"name":"manoeuvre","trans":["n. Mobility; exercises; careful and skilful movements; vt. & vi. Move, exercise; vt. Skillfully and skilfully guided; vi. manoeuvres"]},{"name":"margin","trans":["n. Page margins; margins; margins; margins vt. Add margin to; add side note to tense: margined, margining, margins"]},{"name":"maternal","trans":["adj. maternal; maternal; matrilineal; maternal inheritance Noun: maternalism Adverb: maternally"]},{"name":"maximise","trans":["vt. Maximize...; maximize"]},{"name":"merge","trans":["vt. Merge; engulf; merge; vi. merging; fusion tense: merged, merging; merges Noun: mergence"]},{"name":"metaphor","trans":["n. Metaphoric adjective: metaphoric adverb: metaphorically"]},{"name":"microwave","trans":["n.Microwave timing: microwaved, microwaved, microwaves"]},{"name":"mobility","trans":["n. Mobility; Mobility; Mobility"]},{"name":"moderate","trans":["adj. Moderate, moderate, not very large; moderate; moderate, steady, not extreme; vt. & vi. mitigate; moderate tense: moderated, moderated, modera..."]},{"name":"mountainous","trans":["adj. mountainous; huge"]},{"name":"multicultural","trans":["adj. Multicultural; reflecting multiple cultures; suitable for multiple cultures"]},{"name":"multiply","trans":["VT. & vi. multiply, multiply; increase; breeding tense: multiplied, multiplied, multiplies"]},{"name":"newsreel","trans":["n. News clips"]},{"name":"objectively","trans":["Adv. objectively"]},{"name":"obstruct","trans":["vt. obstruct; block; block, hinder tense: obstructed, obstructs adjective: obstructed"]},{"name":"optimum","trans":["adj. most suitable; n. best effect; most suitable condition plural: optima"]},{"name":"outer","trans":["adj. on the outside; on the outside; far from the inside"]},{"name":"outstrip","trans":["vt. Doing better than...; more than tense: outstripped, outstripping, outstrips"]},{"name":"pale","trans":["adj. pale; dim; weak; n. outpost; fence; range; vt. Make pale; lose color; use a fence; vi. becomes pale; becomes dull; discolored tense: paled, paling, pale..."]},{"name":"partial","trans":["adj. partial; unfair; preferred noun: partialness"]},{"name":"passionate","trans":["adj. passionate; passionate, passionate; ardent; strong adverb: passionately"]},{"name":"pathway","trans":["n. Road, diameter"]},{"name":"penetrate","trans":["VT. & vi. Pass through, infiltrate; understand; vt. see through the tense: penetrated, penetrated, penetrates Noun: penetrat..."]},{"name":"pension","trans":["n. Allowances; pensions, pensions; accommodation; vt. pension or pension payment tense: pensioned, pensioned, compensated Adjective: pensionable"]},{"name":"perimeter","trans":["n. Surrounding; Surrounding; Marginal Adjectives: perimetric"]},{"name":"permanently","trans":["Adv. permanently; permanently"]},{"name":"phenomenal","trans":["adj. The adverb of extraordinary: phenomenally"]},{"name":"photoelectric","trans":["adj. photoelectric"]},{"name":"physiological","trans":["adj. Physiological; Physiological"]},{"name":"placement","trans":["n. Placement, employment arrangements"]},{"name":"plague","trans":["n. Plague; vt. Plagued Tense: Plagued, Plagued, Plagues"]},{"name":"platform","trans":["n. Platforms, platforms; podiums; platforms; altars"]},{"name":"pointless","trans":["adj. meaningless; impossible to have results; useless; useless; adv. meaninglessly; useless; unhelpful; n. meaningless, empty"]},{"name":"positively","trans":["Adv. extremely; absolutely; very definitely; resolutely"]},{"name":"postpone","trans":["vt. Postpone...; put... in a secondary position; put... behind; vi. delay, delay; delay seizure tense: delay, delay Noun: p..."]},{"name":"potent","trans":["adj. effective; strong, powerful; persuasive"]},{"name":"precipitation","trans":["n. Hurry, haste, recklessness; precipitation, precipitation; landing; amount of rainfall in a certain region"]},{"name":"pregnant","trans":["adj. pregnant, conceiving; implicit, meaningful; conceiving..., predicting... prospects..."]},{"name":"preliminary","trans":["adj. preliminary, preliminary, preliminary; n. preparations, initial actions"]},{"name":"primitive","trans":["adj. primitive, early; simple; rough; n. pre-Renaissance painter or sculptor; early artist; primitive person, primitive thing adverb: primitive"]},{"name":"prototype","trans":["n. Prototypes, prototypes, blueprints"]},{"name":"provisional","trans":["adj. temporary; an adverb of temporary: provisionally"]},{"name":"publicise","trans":["vt. publicizing"]},{"name":"query","trans":["n. Questions, questions; vt. Questioning, questioning..."]},{"name":"queue","trans":["n. Queue; long line; braids; vi. Queue; wait in line; vt. Braid... into a braid; make... queue tense: queued, queuing, queues"]},{"name":"radiation","trans":["n. Radiation; Radiation; Radiation"]},{"name":"reckless","trans":["adj. reckless; reckless; dangerous adverb: reckless noun: recklessness"]},{"name":"rehabilitate","trans":["vt. transform; restore normal life; restore to the original state; repair; restore... the honor tense: rehabilitating, rehabilitates Noun: r..."]},{"name":"repel","trans":["vt. repel; resist; disgust; make unpleasant tense: repelled, repelling, repels Noun: repeller"]},{"name":"reservoir","trans":["n. Reservoirs; storage, pooling"]},{"name":"resort","trans":["n. By means; frequently visited places; resorts; vi. Seek help, resort to; take a means or method; frequent tenses: resorted, resorting, resorts"]},{"name":"respondent","trans":["n. Defendant; person answering questions; subject of investigation adj. Answered; Responded; Defendant's; Compliant with “Ancient”"]},{"name":"rudimentary","trans":["adj. basic, preliminary"]},{"name":"sake","trans":["n. Reason, reason; Japanese rice wine, Japanese sake"]},{"name":"salvage","trans":["n. Salvage; rescue at sea; rescue goods; rescue bonuses; vt. rescue; rescue at sea tense: salvaged, salvaging, salvages adjective: salvageabl..."]},{"name":"sandwich","trans":["vt. clip in; squeeze in; make... into a sandwich; n. Sandwich; sandwich bread sandwich three-dimensional curing tense: sandwiched, sandwiching, sandwiches"]},{"name":"scour","trans":["vt. Go around searching; brush; wipe; polish; rinse into...; n. Brush, wipe Tense: scoured, scours Noun: scourer Noun: scourer Noun: scou..."]},{"name":"scrap","trans":["n. Small pieces; a tiny bit; leftovers v. discard; abolish; cancel; discard; scrap tense: scrapped, scrapped, scraps Noun: scrapper"]},{"name":"scratch","trans":["n. Scratches; abrasions; scratchy sounds; graffiti; adj. Used for drafting; coincidental; vt. Grab; scrape; dig out; paint; vi. Catch; kick; make a scratchy sound; barely make ends meet; when you leave the game: scratched,..."]},{"name":"seedling","trans":["n. Seedlings that have just emerged"]},{"name":"selective","trans":["adj. carefully chosen; selected; uncommon adverb: selectively"]},{"name":"shipment","trans":["n. Shipping, water transportation; batch of goods"]},{"name":"shortage","trans":["n. Deficiency; Deficiency; Insufficient quantity; Insufficient"]},{"name":"sightseeing","trans":["n. Sightseeing, Excursions"]},{"name":"silly","trans":["adj. stupid, stupid; confused, ridiculous; “unjust” unconscious, unconscious; disoriented comparative level: sillier, silliest adverb: sillily Noun: s..."]},{"name":"slender","trans":["adj. slim; slender; slender Comparative grade: slenderer, slenderest Adverb: slenderly Noun: slenderness"]},{"name":"slight","trans":["adj. Slight, sparse; fragile; slender; unimportant; vt. laziness; disregard, ignoring; n. laziness; contempt Comparative level: slighter, slightest Noun: sligh..."]},{"name":"slippery","trans":["adj. slippery; cunning; unstable Comparative grade: slipperier, slipperiest Noun: slipperiness"]},{"name":"slogan","trans":["n. Slogans; cries"]},{"name":"slot","trans":["n. Slits, slits; 'improper' positions, positions, vacancies; vt. Put... into a narrow opening; include... to make positional tenses: slotted, slotting, slots"]},{"name":"snap","trans":["vt. Bite; suddenly broken, pulled; shut down with a snap; vi. Bite; speak loudly; click to close; n. Bite; crackle; suddenly break; adj. Sudden SnapAbbr. Satellite Naviga..."]},{"name":"sniff","trans":["vi. scoffing; sniffling; vt. inhale forcefully; detect; smell; sniff; n. inhale with the nose; smell; inhale; sniff; scoffing tense: sniffy, sniffing, sniffs adjective:..."]},{"name":"solar","trans":["adj. solar; daylight; using sunlight; associated with the sun; n. solarium"]},{"name":"sole","trans":["n. Sole; sole; foundation; mackerel; adj. unique; separate; sole; vt. Upper sole; soles when touching the bottom: soled, soles"]},{"name":"soup","trans":["n. Soup, soup; horsepower; vt. Accelerate; increase horsepower"]},{"name":"spark","trans":["n. Spark, Mars; electric spark; slight; fuse, trigger; v. trigger, trigger; generate spark; ignite; add fun Tense: sparked, sparking, sparks Noun:..."]},{"name":"spectrum","trans":["n. Spectrum; spectrum; range, complex series: spectra"]},{"name":"speculate","trans":["VT. & vi. Thinking; guessing, speculating; vi. Speculative tenses: speculated, speculated, speculated"]},{"name":"spill","trans":["vt. Make it overflow, cause it to flow out; cause it to fall; vi. Overflow, outflow; fall; surge; n. Overflow, spill; amount of overflow; fall; small plug state: spilled, spilt spilling, spil..."]},{"name":"spin","trans":["vi. spinning; spinning; spinning; spinning; vt. spinning; spinning; weaving; netting; n. spinning; galloping tense: spun spinning, spins"]},{"name":"splash","trans":["n. Sound of splashing; specks on splashes; specks; amount of spills; vt. Make it splash; vi. splashed tense: splashed, splashing, splashes Noun: splash..."]},{"name":"spoil","trans":["vi. Metamorphosis; vt. damage; destruction; doting, spoiling tense: spoiled, spoilt spoiling, spoils"]},{"name":"sprawl","trans":["vi. Sitting [lying] with outstretched limbs; spreading; spreading in a messy and disorderly manner; sitting; n. Areas expanding in a messy and disorderly manner; expanding randomly; spreading; sprawls timing: sprawled, sprawls..."]},{"name":"static","trans":["adj. static; static; electrostatic; n. static electricity; electrostatic interference adjective: statical adverb: statical"]},{"name":"stream","trans":["n. Stream; Flow; Light; Tide; vi. flow; influx; drift; vt. outflow; gush; flutter tense: streamed, streaming, streams Adjective: str..."]},{"name":"stuff","trans":["n. Materials; Stuff; Fillers; Material Data; vt. Fill; fill up; let's eat; vi. overeating tense: eating, stuffing, stuffing Noun: stuffer"]},{"name":"stunned","trans":["adj. frightened; v. shocked; overwhelmed"]},{"name":"subsistence","trans":["n. The way to survive, survive, and survive Adjective: subsistent"]},{"name":"superb","trans":["adj. excellent, outstanding, excellent adverb: superbly"]},{"name":"surveyor","trans":["n. Surveyors, surveyors, explorers; appraisers"]},{"name":"sway","trans":["vt. Shake; dominate; influence; vi. swing; influence; n. swing; rule; influence tense: swayed, swaying, sways Noun: swayer"]},{"name":"sympathetic","trans":["adj. sympathetically; an adverb of sympathy, support: sympathetically"]},{"name":"synthesis","trans":["n. Synthesis, synthesis method; synthetic noun: synthesist"]},{"name":"tease","trans":["VT. & vi. Teasing, teasing; vt. sort out; n. People who love to mock others tense: teased, teasing, teases Adverb: teased"]},{"name":"telecommunication","trans":["n. Telecommunication"]},{"name":"tempt","trans":["vt. induce or encourage doing something inappropriate; make one want tense: tempted, tempting, tempts adjective: temptable Noun: tempter"]},{"name":"tenant","trans":["n. Tenants, tenants; (law) occupants, occupants tense: tenanted, tenants"]},{"name":"tilt","trans":["vi. Tilt; tilt; slam with words or words; vt. tilt; tilt; tilt; n. Tilt tense: tilted, tilting, tilts Noun: tilter"]},{"name":"tough","trans":["adj. tough; tough; rough; old, hard; strict, tough; difficult comparative grade: tougher, toughest adverb: tough noun:..."]},{"name":"transaction","trans":["n. Processing, processing, execution; transaction; transaction adjective: transactional"]},{"name":"transient","trans":["adj. fleeting; fleeting; fleeting"]},{"name":"transition","trans":["n. Transition; transformation; transformation v. transformation (from a certain state or activity), excessive adjective: transitive"]},{"name":"trivial","trans":["adj. unimportant, trivial; trivially adverb"]},{"name":"tropics","trans":["n. Tropics"]},{"name":"underneath","trans":["prep. under...; under...; adv. below; n. bottom, bottom"]},{"name":"unify","trans":["vt. unify; make the same, make consistent tense: unify, unify adjective: unifify noun: unify name..."]},{"name":"vacancy","trans":["n. Empty room; emptiness; emptiness; vacancy; vacancy; vacancy; emptiness; loss of consciousness, distraction"]},{"name":"verdict","trans":["n. Rulings, rulings; decisions, opinions"]},{"name":"waggle","trans":["vi. Swinging; constantly rocking back and forth; vt. rocking back and forth; swinging; n. swinging; swinging tense: waggled, waggle, waggles adjective: waggly"]},{"name":"well-being","trans":["n. Recreation, wellbeing; welfare"]},{"name":"withdraw","trans":["VT. & vi. take back; retreat tense: withdrew withdrawing, withdrew adjective: supposable name..."]},{"name":"withstand","trans":["vt. endure, endure the tense: withstanding, withstanding"]}]