[{"name":"activate","trans":["vt. activate, activate, trigger tense: activated, activated Noun: activation Noun: activator"]},{"name":"adapt","trans":["vt. Adapt; adapt; vi. Adapting to the tense: adapting, adapting"]},{"name":"adequate","trans":["adj. adequate, adequate; proper, competent noun: adequate adverb: adequate"]},{"name":"adjust","trans":["vt. Calibrate; adjust to fit...; vi. adjust, calibrate; adapt to tense: adjusted, adjusted Adjective: adjustable"]},{"name":"administration","trans":["n. Implement, execute; manage, operate, control; government, cabinet Adjective: administrative"]},{"name":"adopt","trans":["vt. adopt; adopt, adopt, adopt; formally accept, adopt tense: adopt, adopt tense: adopt, adopt Adjective: adoptable Noun: ado..."]},{"name":"advent","trans":["n. Appear, arrive"]},{"name":"adventure","trans":["n. Adventure activities; adventure experience; adventure; adventure, thrill; vt. & vi. Adventurous tense: adventurous, adventurous"]},{"name":"advocate","trans":["vt. Advocate, advocate; n. Advocate; supporter; lawyer Tense: advocated, advocates Noun: advocated, advocates describe..."]},{"name":"affect","trans":["vt. influence; pretend; emotion; infection; vi. tendencies; likes; n. emotions; factors causing feelings tense: affected, affected, affected"]},{"name":"agent","trans":["n. Agents, agents; agents; agents; vt. Intermediated by; Acted by...; adj. Proxy's"]},{"name":"alter","trans":["vt. Change, change; vi. change; modify tense: altered, altering, alters"]},{"name":"altitude","trans":["n. Altitude, altitude; elevation, altitude Adjective: altitudinal"]},{"name":"analyse","trans":["vt. Analyze, disassemble, explain"]},{"name":"anthropology","trans":["n. anthropology; n. anthropologist adjective: anthropological adverb: anthropological noun: anthropologist"]},{"name":"anticipate","trans":["vt. act before...; premonition, expectation tense: anticipate, anticipate noun: predator adjective:..."]},{"name":"apparent","trans":["adj. obvious; ostensible adverb: apparent"]},{"name":"appeal","trans":["vi. Appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal; appeal, request; recourse to judgment; vt. Will... appeal, appeal against... tense: appealed,..."]},{"name":"applicant","trans":["n. Applicants, job seekers"]},{"name":"appraisal","trans":["n. Estimation, estimation, evaluation"]},{"name":"appreciation","trans":["n. Appreciation, Appreciation, Appreciation; Assessment; Judgment; Appreciation; Value Added; Appreciation; Comments"]},{"name":"apprenticeship","trans":["n. Apprenticeship status, apprenticeship qualifications; apprenticeship period; internship"]},{"name":"approach","trans":["VT. & vi. Approaching, Approaching, Approaching; vt. Approach; Negotiate; Begin Handling; n. Approaching, Approaching, Approaching; Path, Entry, Path; Method; Mode, Method, Tense: Approaching, Approaching..."]},{"name":"appropriate","trans":["adj. Appropriate, proper; vt. misappropriate; usurp; misappropriate; divulge tense: appro..."]},{"name":"approximate","trans":["adj. Approximate, approximate; vt. & vi. approximate, close tense: approximated, approximates adverb: ap..."]},{"name":"archaeology","trans":["n. Archeological adjective: archaeological noun: archaeologist"]},{"name":"architect","trans":["n.Architects, designers"]},{"name":"Arctic","trans":["adj. Arctic; extremely cold; n. Arctic Circle; waterproof overshoes for cold weather Arcticadj. Arctic, arctic; extremely cold; frigid; cold; frosty; n. arctic; arctic zone adjective: Ar..."]},{"name":"arise","trans":["v. Occurrence; generation; appearance; rise, rise; wake up tense: rose arisen"]},{"name":"arousal","trans":["n.Motivation; awakening"]},{"name":"arrange","trans":["vt. Arrange; arrange; organize; vi. arrange; arrange; negotiate tense: arrange, arrange Noun: arranger"]},{"name":"artificial","trans":["adj. artificial, artificial, false; false, insincere, manipulative; artificial noun: artificiality Adverb: artificiality"]},{"name":"ash","trans":["n. Ash; ashes, ruins; ashes"]},{"name":"assess","trans":["vt. assess; evaluate; tax... tense: assessed, assessed adjective: assessable"]},{"name":"assign","trans":["vt. assign; hand over; assign, select; specify, establish tense: assigned, assigned, assigns Noun: assignability adjective: ass..."]},{"name":"assist","trans":["v. help; assist; facilitate; n. assist; assist; assist in killing tense: assist, assist"]},{"name":"associate","trans":["v. associate; associate; associate with; interact with...; play with...; show support; agree; adj. informal; associate; associate; joint; associated; n. colleague; partner; associate; associate; associate degree Status: asso..."]},{"name":"assumption","trans":["n. Assumptions, assumptions"]},{"name":"attribute","trans":["v. attribute... to; think... because; think from...; will add to...; think... is... all; n. Characteristics; traits; attributes tense: attributes, attributes..."]},{"name":"auditorium","trans":["n. Audience seats, audience seats; auditoriums, auditoriums"]},{"name":"authority","trans":["n. Prestige, Power; Jurisdiction; Authorities, Officials; Authorities, Experts, Combatants"]},{"name":"available","trans":["adj. available or obtainable; an adverb to meet, to talk to: availably"]},{"name":"award","trans":["vt. award; award; n. prize; judgment tense: award, award noun: awarder"]},{"name":"back","trans":["n. Back; back; backrest; defender of soccer, etc.; end of books, newspapers, etc.; vt. Support; Retreat; Place a Bet; Endorsement; vi. backward; backward; backrest; adv. backward; backward; backward; back-and-forth; adj. The latter; the one in arrears; the past..."]},{"name":"batch","trans":["n. One furnace; one batch, one set, one group of tenses: batched, batching, batches"]},{"name":"battery","trans":["n. Batteries, accumulators"]},{"name":"beam","trans":["n. Beams, beams; bundles, columns; vi. Glowing light and heat; happy face; vt. Broadcast tense: beamed, beaming, beams"]},{"name":"bear","trans":["vi. The results are real; accepted; vt. endure; have; support; n. bear tense: bore borne, born bearing, bears"]},{"name":"behave","trans":["vi. Performance; Work; vt. & vi. Rule-abiding tense: behaved, behaving, behaves"]},{"name":"bend","trans":["vt. To bend; to yield; to force; to orient; vi. bending, turning; yielding; concentrating; inclination; n. Bending tense: bent bending, bends"]},{"name":"bilingual","trans":["adj. bilingual; able to speak two languages; n. Person who can speak two languages Noun: bilingualism"]},{"name":"booklet","trans":["n. Booklets"]},{"name":"boost","trans":["vt. Promote; Increase; Support; vi. promote; steal; n. help; promote; promote tense: boosted, boosting"]},{"name":"boredom","trans":["n. Boring; bothersome things"]},{"name":"branch","trans":["vt. Branching; disagreement; vi. branching; diverging; n. branch, branch; branch; tributary tense: branched, branching, branch Adjective: bran..."]},{"name":"branding","trans":["Branding"]},{"name":"breed","trans":["vi. breeding; raising; production; vt. breeding; raising; nurturing, education; cause; n. variety; type, type tense: breeding, breeding"]},{"name":"brilliant","trans":["adj. shining, bright; brilliant, brilliant adverb: brilliantly"]},{"name":"brochure","trans":["n. Brochures, pamphlets"]},{"name":"bubble","trans":["n. Bubbles, bubbles, bubbles; transparent round cover, round top; vi. Boiling, bubbling; making a bubbling sound; vt. make bubbles; talk endlessly about the tense: bubbled, bubbling, bubbles"]},{"name":"budget","trans":["n. Budget; government budget; budget amount, funding; vt. & vi. budgeting, scheduling expenses, etc. tense: budgeting, budgeting adjective: budgeting"]},{"name":"bully","trans":["vt. intimidate, intimidate"]},{"name":"burial","trans":["n. Burial; funeral; abandonment; adj. adjective: burial"]},{"name":"burst","trans":["VT. & vi. explosion, burst; crowded, full; sudden opening; sudden attack, sudden occurrence; n. explosion, burst; burst, burst; burst, burst tense: burst, bursting"]},{"name":"calendar","trans":["n. Calendar; calendar; schedule; vt. Put... in the table; place... in the calendar tense: calendared, calendaring, calendars"]},{"name":"campaign","trans":["vi. combat; participate in activities; participate in election campaigns; n. Campaign; campaign; active tense: campaigned, promoted Noun: campaigner"]},{"name":"canal","trans":["n. Canals; waterways; irrigation canals; pipelines; vt. Canal excavated in... Tense: canalled, canaled canals, canaling canals, canals"]},{"name":"capable","trans":["adj. capable, competent; an adverb of talented: capably"]},{"name":"capacity","trans":["n. Competence; capacity; productivity; qualifications, status"]},{"name":"capture","trans":["vt. capture; seize; n. spoils of war, captivity; capture tense: capture, capture"]},{"name":"cargo","trans":["n. Cargo, shipping"]},{"name":"carve","trans":["vt. Carve; cut; pioneer; vi. Cut; do carving work tense: cutting, carving, carves Noun: carver"]},{"name":"cast","trans":["VT. & vi. throw, throw; cast; vt. Cast, add... to; assign characters; n. Cast, throw, throw; cast; plastic parts; plaster; cast, all actors; n. Clothes/casting v that the original owner no longer wants..."]},{"name":"casual","trans":["adj. careless; careless; indifferent; irregular; temporary; incidental, casual; incidental; casual; casual; casual; adverb: casually Noun: casual..."]},{"name":"categorise","trans":["vt. categorize...; list..."]},{"name":"cater","trans":["vt. meet needs; fit; provide food and service; provide food and service; tense: catered, catering, caters Noun: caterer"]},{"name":"celebration","trans":["n. Celebrate; Celebrate"]},{"name":"cereal","trans":["n. Cereals, cereals; cereal foods, oatmeal"]},{"name":"character","trans":["n. Quality, characteristic, characteristic; characteristic, good quality; character, character; symbol, word tense: charactered, charactering, characters adjective:..."]},{"name":"charity","trans":["n. Alms; charity; charitable organizations; alms; tolerance"]},{"name":"chase","trans":["vt. Chase; hunt; try to win; carve; vi. chase; chase; run; n. chase; chase; chase Chase tense: chased, chase"]},{"name":"chronic","trans":["adj. chronic; long-term; habitual adverb: chronically Noun: chronicity"]},{"name":"circuit","trans":["n. Circuit, circuit; loop; loop; circuit; vi. Circulation; vt. Orbiting... Circulating Tense: circuited, circuiting, circuits"]},{"name":"circumstance","trans":["n. Condition; environment; situation; situation; situation; economic situation; fate; objective environment; v. Put the tense under a specific situation: circumstance, circumstancing, circ..."]},{"name":"circus","trans":["n.Circus; circus"]},{"name":"cite","trans":["vt. Cite; Summon; Recall; Recognize CiteAbbr. Computer Integrated Test Equipment; Current information..."]},{"name":"civil","trans":["adj. civil, civilian; non-military, non-religious; national, civilian; civil, civil law; civilized, cultured adverb: civilly"]},{"name":"click","trans":["vt. Click; make a clicking sound vi. click n. Click; tick tense: clicked, clicked, clicked Noun: clicker"]},{"name":"clue","trans":["n. Clue; plot; vt. provide clues to...; provide situations tense for...: clued, cluing, cluing clues"]},{"name":"coconut","trans":["n.Coconut; coconut meat"]},{"name":"code","trans":["n. Code, statute, statute; password, electronic code; code, code; vt. Translate... into code tense: coded, coding, codes"]},{"name":"collapse","trans":["vi. collapse; collapse; collapse; vt. collapse, collapse; collapse; n. collapse; failure; exhaustion tense: collapsed, collapsing; collapses Noun:..."]},{"name":"colleague","trans":["n.Colleagues, colleagues"]},{"name":"column","trans":["n. Cylinder, cylindrical object; column, column; column adjective: columned"]},{"name":"commission","trans":["n. Authorization, Entrustment; Commission; Commission; Rebates; vt. Appointment, Delegate Tense: Committed, Commissioned, Commissioned"]},{"name":"commodity","trans":["n. Commodities, goods; useful things"]},{"name":"communal","trans":["adj. public; communal noun: communality Adverb: communally"]},{"name":"community","trans":["n. Community, society, group; mass, public; sharing, sharing"]},{"name":"compensate","trans":["VT. & vi. compensation, compensation tense: compensated, compensating adjective: compensating Noun: c..."]},{"name":"complex","trans":["adj. complex; synthetic; n. complex; complex"]},{"name":"complicated","trans":["adj. The structure is complex"]},{"name":"component","trans":["n. Component, Component, Component Adjective: componential"]},{"name":"composition","trans":["n. Creation, Writing, Composition; Composition; Composition; Composition; Composition; Composition; Composition; Mixtures, Composites"]},{"name":"compound","trans":["n. Complexes; mixtures; compounds; compound words; fenced site; adj. compound; v. aggravates; deteriorates; consists of; mixing; blending; mixing state: compounded, compoun..."]},{"name":"comprise","trans":["vt. contains; composed of... tense:,, adjective: able"]},{"name":"compulsory","trans":["adj. must be done, the adverb of compulsory: compulsorily"]},{"name":"concentrate","trans":["VT. & vi. Focus; pay attention; focus; gather; vt. concentrated tense: concentrate, concentrate adjective: conce..."]},{"name":"conflict","trans":["n. Fight, struggle; conflict, resistance, controversy; vi. conflict tense: conflicted, conflicting, conflicts adjective: conflic..."]},{"name":"confusion","trans":["n. Confusion, confusion; confusion; confusion, riots"]},{"name":"congestion","trans":["n. Congestion; Traffic jam; Congestion; Obstruction"]},{"name":"conserve","trans":["vt. preserve; make... compote; preserve; n. jam; preserves tense: conserve, conserve"]},{"name":"consistent","trans":["adj. consistent, consistent; consistent, conforming adverb: consistent"]},{"name":"constant","trans":["adj. consistent, immutable; constant, continuous occurrence; faithful, loyal adverb: loyal"]},{"name":"consult","trans":["vt. Discuss; review; ask... for advice; vi. ask for advice; consult; be a consultant tense: consulting, consults Noun: consultant"]},{"name":"contaminated","trans":["v. Pollution"]},{"name":"contemporary","trans":["adj. contemporary; contemporaneous, belonging to the same period; n. same generation, same age"]},{"name":"content","trans":["n. Content, table of contents; capacity; satisfaction; adj. Satisfied; vt. make satisfying tense: contented, contenting, contents"]},{"name":"continuous","trans":["adj. continuous, uninterrupted adverb: uninterrupted"]},{"name":"contract","trans":["vi. infection; contracting; contraction; vt. infection; contract; shorten; n. contract; marriage contract tense: contracted, contracting, contracts Adjective: c..."]},{"name":"contrast","trans":["n. Contrast, contrast; difference, difference; contrast, obvious contrast; vt. & vi. contrast, contrast tense: contrasted, contrasted, contrasts"]},{"name":"contribution","trans":["n. Donations, contributions; contributions"]},{"name":"convey","trans":["vt. transport; transport; expression, transmission tense: conveyed, conveyed adjective: conveyable"]},{"name":"convince","trans":["vt. convince; persuade; persuade tense: persuade, confess adjective: convincible"]},{"name":"core","trans":["n. Core; core; main point; magnetic center; vt. Dig the core of... CoreAbbr. Congress of Racial Equality Conference for Racial Equality Tense: cored, cor..."]},{"name":"corporate","trans":["adj. corporate adverb: corporately"]},{"name":"corporation","trans":["n. Company"]},{"name":"corpus","trans":["n. Collection of essays; principal; corpus plural: corpora"]},{"name":"corridor","trans":["n. Corridors"]},{"name":"council","trans":["n. Councils; meetings; committees; advisory teams; local councils"]},{"name":"counter","trans":["n. Counters, long counters; counters; vt. & vi. Confrontation, refutation; adv. countered, countering, counter tense: countered, countered"]},{"name":"counterpart","trans":["n. A person with the same status as the other party, something with a role equivalent to that of the other party"]},{"name":"couple","trans":["n. One couple, one pair; some, a few; couples, couples; vt. Connect, Connect, Connect Tense: Connecting, Coupling, Couples"]},{"name":"crack","trans":["VT. & vi. Cracking, cracking; physical or mental collapse; opening, smashing; making a bursting sound; n. cracks, crevices; crackling, bursting sounds; an unexpected blow; trying; playful words; when potent cocaine..."]},{"name":"creature","trans":["n. Animals, creatures; people; creations Adjective: creatured Noun: creatureliness Adjective: creatured"]},{"name":"crew","trans":["n. All personnel, all crew members; teams, groups; vi. Working together; vt. Make a crew tense: crewed, crewing, crews"]},{"name":"cruise","trans":["vi. cruising, cruising; roaming; vt. cruising, cruising; roaming; n. cruising, cruising; boat tour; time of day: cruised, cruising"]},{"name":"cultivate","trans":["vt. cultivate, cultivate; cultivate ideas; cultivate tense: cultivate, cultivate, cultivate adjective: cultivatable"]},{"name":"cure","trans":["vt. cure; treat; process; vulcanize; vi. treated; cured; cured; cured; treated; treated; treated; treated; treated; treated; tense: cured, cured; cures Noun:..."]},{"name":"curriculum","trans":["n. Total Curriculum Adjective: curricular Plural: a"]},{"name":"curve","trans":["n. Curves; curves; curve balls; curve charts; vt. make a bend; bend; vi. curved shape; adj. curved; curved tense: curved, curving, curves Adjective:..."]},{"name":"damp","trans":["vt. Humidify; depress; inhibit; dampen; vi. attenuation, damping; becoming humid; n. humidity, moisture; adj. Humid dAMP deoxyadenylate Comparative grade: damper, dampest-shaped..."]},{"name":"debate","trans":["vt. Debate, argue, discuss; vi. debate, argument, discussion; n. Debate; debate tense: debated, debates Noun: debating..."]},{"name":"decorate","trans":["vt. Decorate; arrange; award; vi. decoration; arrangement tense: decorated, decorated"]},{"name":"deduce","trans":["vt. deduce, deduce; deduct tense: deducted, deducted adjective: deductible"]},{"name":"degradation","trans":["n. Decline, decline; demotion; depravity; disgrace; extermination of the priesthood"]},{"name":"delivery","trans":["n. Delivery, delivery; mail delivered, goods sent; delivery; manner of speech, style of speech"]},{"name":"depart","trans":["vi. departure; departure, departure; violation; death; adj. Moment of death: departed, departed, departs"]},{"name":"depict","trans":["vt. depict; depict; describe tense: depicting, depiction Noun: depiction"]},{"name":"deposit","trans":["n. Deposits; Deposits; Deposits; vt. Store; deposit; vi. precipitation tense: depositing, depositing Noun: depositor"]},{"name":"deprive","trans":["vt. take away, take away tense: deprive, deprive adjective: deprivable"]},{"name":"depth","trans":["n. Deep, deep, deep; deep, deep; deep, deep; deep, abyss"]},{"name":"derive","trans":["VT. & vi. obtain; derived from tense: derived, deriving, derives Adjective: derivable"]},{"name":"descend","trans":["vi. decline; descent; genetics; condescending; descending; vt. descended; descended; descended... downward tense: descended, descended"]},{"name":"desirable","trans":["adj. desirable, worthy of having, consensual adverb: desirable"]},{"name":"despite","trans":["prep. Although, even; involuntarily, unstoppably"]},{"name":"destination","trans":["n. Destination, end"]},{"name":"detrimental","trans":["adj. harmful, unfavorable adverb: harmful"]},{"name":"digital","trans":["adj. numeric; fingered; n. number; key adverb: digitally"]},{"name":"dimension","trans":["n. Size, measure; aspect, part; scale, degree tense: dimensioned, dimensioning, dimensions adjective: dimensional..."]},{"name":"diminish","trans":["vt. Make it smaller; make it smaller; vi. become smaller; diminish; reduce state: diminished, diminished adjective: diminishable"]},{"name":"diploma","trans":["n. Graduation diploma, degree certificate, license"]},{"name":"disabled","trans":["adj. disabled; defective"]},{"name":"disappointing","trans":["adj. disappointing"]},{"name":"disaster","trans":["n. Misfortune; disaster, disaster"]},{"name":"discard","trans":["vt. Discard; Discard; Abandon; vi. abandonment; n. abandonment; discarded thing or person tense: discarded, discarded, discards Adjective: discar..."]},{"name":"discipline","trans":["vt. train, discipline; punish, punish; n. train, exercise, discipline; discipline; punishment, discipline; subject tense: disciplined, disciplined, discipline..."]},{"name":"dissertation","trans":["n. Special papers, dissertations"]},{"name":"distinct","trans":["adj. distinct, completely separate; clear, unequivocal adverb: distinctly noun: distinctly"]},{"name":"distinguish","trans":["VT. & vi. Discern, differentiate; vt. Showcase yourself, make yourself famous tense: treating, praising adjectives:..."]},{"name":"distract","trans":["vt. diverted; distracted tense: distracted, distracted adverb: distractingly adjective: distractingly..."]},{"name":"distribute","trans":["vt. distribution; distribution; distribution; distribution tense: distributed, distributed"]},{"name":"diverse","trans":["adj. different, varied adverbs: diversely"]},{"name":"division","trans":["n. Division; Division; Distribution; Division; Division; Division Adjectives: divisional"]},{"name":"documentary","trans":["n. Documentaries; adj. Documentary, paperwork"]},{"name":"donate","trans":["vt. Donate; donate; vi. donate; donate; n. donate; donate tense: donate, donate Noun: donor"]},{"name":"draft","trans":["n. Money order; draft; selection; airflow vt. Drafting; Formulation; Recruiting vi. Draft; drawing; sketching adj. Preliminary drawing or; currently being drafted, drafted; in draft form; the tense of the sketch: drafted,..."]},{"name":"dramatic","trans":["adj. dramatic, scripted; dramatic, exciting; attention-grabbing, impressive adverb: surprising"]},{"name":"drawback","trans":["n. Disadvantages, disadvantages; tax refunds"]},{"name":"drought","trans":["n. Drought; lack of adjective: droughty"]},{"name":"due","trans":["adj. due; due; payable; anticipated; n. payable; due; adv. Positive"]},{"name":"dynamic","trans":["adj. dynamic; dynamic; dynamic; energetic; n. dynamic; dynamic adverb: dynamic"]},{"name":"ease","trans":["vt. Lighten, relieve; reassure; n. comfort, relaxation; ease, comfort; vi. Relieve, ease; relax; move flexibly EaseABBR. Electronic Airborne Systems Ev..."]},{"name":"echo","trans":["vt. Repetition; reflection; vi. Attaches to the voice; makes an echo; n. Echo; mimics the words used in Echo Communications to represent the letter e"]},{"name":"ecology","trans":["n. Ecology; social ecology Adjective: ecological Noun: ecologist"]},{"name":"economic","trans":["adj. economic, economic; cost-effective, economically beneficial"]},{"name":"ecosystem","trans":["n. Ecosystems"]},{"name":"efficient","trans":["adj. competent, efficient adverb: competent"]},{"name":"electronic","trans":["adj. electronic; adverb of electronic device: electrically"]},{"name":"element","trans":["n. Elements; components, elements, originals; groups of people; foundations, outlines, principles"]},{"name":"eliminate","trans":["vt. eliminate, eliminate; ignore; eliminate; 'kill' the tense: eliminate, eliminate; eliminate; noun: eliminate name..."]},{"name":"embark","trans":["vi. Get on a boat or plane; get started; vt. get on board; let go to work in the tense: embarked, embarked"]},{"name":"emotion","trans":["n.Emotions; emotions"]},{"name":"emphasise","trans":["vt. Emphasize; reinforce tone; reread"]},{"name":"empire","trans":["n. Empire; imperial rule, monarchy"]},{"name":"encode","trans":["vt. encode, decode tense: encoded, encoding, encodes Noun: encoder"]},{"name":"encounter","trans":["vt. encounter, encounter; chance encounter, encounter; n. Sudden encounter tense: encounter, encounter"]},{"name":"endanger","trans":["vt. endangered, endangered, endangered"]},{"name":"engage","trans":["vt. Hiring; Attracting, Occupying; Making an Engagement; Making an Appointment; vi. Promise, promise; engage; engagement; meshing tenses: engage, engage"]},{"name":"enhance","trans":["v. improve, enhance, increase tense: enhanced, enhanced, enhanced noun: enhanced noun: enhancer adjective:..."]},{"name":"enterprise","trans":["n. Career, plan; professionalism, enterprising spirit; enterprise unit, company name: enterpriser"]},{"name":"entertainment","trans":["n. Hospitality, hospitality; entertainment, entertainment, performances"]},{"name":"entitle","trans":["vt. call...; name...; give... title; give... rights tense:, entitles: entitles"]},{"name":"equip","trans":["vt. Equipment, equipped timing: equipped, equipping, equips"]},{"name":"equivalence","trans":["n. Equal; Equal; Equal; Equal; Equal"]},{"name":"equivalent","trans":["adj. equal, equivalent; n. equal person, corresponding person"]},{"name":"erode","trans":["VT. & vi. erosion, corrosion tense: eroded, eroding, erodes noun: erodibility adjective: erodible"]},{"name":"essence","trans":["n. Essence, essence; essence; essence"]},{"name":"establishment","trans":["n. Establishment, establishment; enterprise, institution; authority, authority"]},{"name":"estate","trans":["n. Large private land, estates, plantations; residential areas, industrial areas; property, heritage; tourist cars; passenger and cargo cars"]},{"name":"evaluate","trans":["vt. evaluate, estimate, evaluate tense: evaluate, evaluate Noun: evaluate Adjective: evaluative..."]},{"name":"eventually","trans":["Adv. finally, finally"]},{"name":"excavate","trans":["vt. excavate, excavate; excavate, excavate tense: excavated, excavates"]},{"name":"exceed","trans":["vt. surpass; surpass; vi. Prominence, leading tense:,,"]},{"name":"exception","trans":["n. Exception"]},{"name":"exclude","trans":["vt. exclude; exclude; reject; evict tense: excluded, excluded, excluded Noun: excluder"]},{"name":"executive","trans":["n. Supervisors, senior executives, executives; administrative departments; adj. Executive; administrative; capable of administration"]},{"name":"exhaust","trans":["vt. Empty it, take it out; use it up, run out; make it very tired; vi. exhaust; n. Exhaust device, exhaust pipe; exhaust gas from the machine when: exhausting, exhausting, exhaust..."]},{"name":"exhibit","trans":["vt. display; exhibition; presentation; n. exhibit; evidence; exhibition; vi. exhibition; exhibition tense: exhibiting, exhibiting Adjective: ex..."]},{"name":"exotic","trans":["adj. A foreign-imported, non-local; bizarre, eye-catching, and appealing Exoticadj. Foreigner, foreigner"]},{"name":"expand","trans":["vt. expand; expand; detail; vi. expand, expand; development tense: expanded, expanded Adjective: expandable Noun:..."]},{"name":"expedition","trans":["n. Expeditions; Expeditions; Expeditions; Fast and agile"]},{"name":"exploitation","trans":["n. Development; Exploitation; Exploitation; Exploitation; Advertising"]},{"name":"explore","trans":["vt. Exploration; exploration; adventure; vi. Exploring; Exploring; Exploring Tense: Exploring, Exploring"]},{"name":"expose","trans":["vt. expose; reveal, reveal; display tense: exposed, exposed Noun: exposure"]},{"name":"extend","trans":["VT. & vi. extend; continue; vt. extend; extend; reach; extend as far as possible; give, provide, emit tenses: extended, extends"]},{"name":"external","trans":["adj. external; superficial; external; external; foreign; n. external; external; external; external adverb: externally"]},{"name":"extinct","trans":["adj. extinct, extinct; extinct; vt. Extinguish"]},{"name":"extract","trans":["vt. extract; extract; extract; extract; n. extract; extract; extract; juice; selected tense: extract, extract; extract noun: extractor"]},{"name":"extraordinary","trans":["adj. very strange; extraordinary, special; excessively arranged, temporary adverb: extraordinary ordinarily"]},{"name":"fabric","trans":["n. Fabric, cloth; structure, organization"]},{"name":"fabulous","trans":["adj. incredible; legendary, allegorical; excellent adverb: fabulously"]},{"name":"faculty","trans":["n. Abilities, talents; skills; faculties, departments, departments; all faculty and staff, all employees"]},{"name":"fancy","trans":["n. Imagination; hobby; fantasy; adj. Imaginary; Extraordinary; Selected; Expensive; vt. Envision; love; imagine; conceit; vi. imagine; fantasy adverb: fancily Noun: fanci..."]},{"name":"fiction","trans":["n. Fiction; a fictional or imagined thing, something that is not entirely true Adjective: fictional adverb: fictional"]},{"name":"flaw","trans":["n. Flaw, flaw; gust of wind; brief storm; crack, crack v. cause cracks, cause cracks; make ineffective; cause defects vi. cracks; become flawed tense: described as flawed, flawed, flawed..."]},{"name":"flexible","trans":["adj. An adverb of flexible; flexible; easily bendable"]},{"name":"flop","trans":["vi. Move or fall; complete failure, unsuccess; n. Failure flopAbbr. Floating Octal Point floating point octal tense: flopped, flopping, fl..."]},{"name":"flourish","trans":["v. Prosperity; Prosperity; Prosperity; Thriving; Growth; Health and Happiness; Waving; n. Exaggerated Actions; Impressive Actions; Unforgettable Manners; Ornate Words and Decorations; Decorative Curves; Floral Characters; Trumpet Tense Tense: flouri..."]},{"name":"forage","trans":["n. Feed; Fodder; Search; vi. search for food; search tense: foraged, foraging, forages Noun: forager"]},{"name":"foster","trans":["v. promote; promote; nurture; encourage; adoption, surrogacy, parenting; adj. adopted, adopted Foster Foster tense: forested, fosters"]},{"name":"foundation","trans":["n. Establish, establish; foundation, rationale, basis; foundation; fund adjective: foundational"]},{"name":"fragile","trans":["adj. fragile, brittle; weak, vulnerable; unbearable noun: fragility"]},{"name":"frame","trans":["n. Frame; structure; screen; vt. Design; frame; build; make... fit; vi. Hoping for success; adj. framed; framed tense: framed, framed"]},{"name":"freeze","trans":["VT. & vi. freezing; n. severe cold period; freezing, solidification; freezing timing: freeze frozen, freeze"]},{"name":"freight","trans":["n. Freight; goods; vt. Transportation, loading in tense: freighting, freights"]},{"name":"fulfil","trans":["vt. Fulfill; Practice; Satisfy; Complete"]},{"name":"fundamental","trans":["adj. basic; important, necessary; n. basic principle, basic law Adverb: fundamental"]},{"name":"gear","trans":["n. Utensils, equipment, clothing; gears; transmission devices; stops; vi. shift; vt. Get excited; get ready; vt. & vi. Pairing; suitable timing: geared, gearing, gears"]},{"name":"gender","trans":["n. Sex; sex; sexual intercourse; vt. Ecology: gendered, gendered, genders"]},{"name":"gene","trans":["n. “raw” gene"]},{"name":"generate","trans":["vt. make; reproduce; tense of occurrence: generated, generated, generated"]},{"name":"genius","trans":["n.Genius, talent; spirit"]},{"name":"germinate","trans":["VT. & vi. germinating tense: germinated, germinates noun: germinated adjective: germinati..."]},{"name":"giant","trans":["n. Giants, Hercules; great people, outstanding people; adj. oversized, huge"]},{"name":"gradual","trans":["adj. gradual; gradual; n. mass ascending hymn book adverb: gradual noun: gradualness"]},{"name":"grant","trans":["v. Grant, Permit; Recognition, Consent; n. Grant, Grant; Bursary, Allowance; Lawful Transfer, Officially Grant Grant Terms: Grants, Grants Terms:..."]},{"name":"graze","trans":["vt. Abrasion; grazing; vi. grazing; scratching; n. grazing; lightly rubbing tense: grazed, grazing, grazes Noun: grazer"]},{"name":"grinding","trans":["adj. harsh; abrasive; unbearable"]},{"name":"gross","trans":["adj. Total; crude; bad; obvious; vt. Total income; n. total amount, comparison level: grosser, grossest Noun: grosser Adverb:..."]},{"name":"guarantee","trans":["vt. guarantee; guarantee; make possible; n. guarantee, guarantee; warranty; warranty period; guarantee, guarantor; guarantee, collateral; collateral, condition of collateral: guaranteed, secured, secured"]},{"name":"guideline","trans":["n. Guidelines, guidelines"]},{"name":"habitat","trans":["n. Habitat, shelter"]},{"name":"halt","trans":["vi. stop; hesitate, hesitate; establish; n. stop; establish; rest; vt. stop; set the timing: halted, halting, halts"]},{"name":"harsh","trans":["adj. rough; harsh; harsh; harsh; harsh; harsh comparative grade: harsher, harshest Adverb: harshly Noun: harshness"]},{"name":"hatch","trans":["n. Hatches; incubation; vt. planning;; vi. incubation tense: hatched, hatching, hatches Noun: hatcher"]},{"name":"herb","trans":["n.Vanilla, herbal adjective: herby"]},{"name":"heritage","trans":["n. Heritage, inheritance; tradition"]},{"name":"highlight","trans":["vt. Highlight, highlight, highlight; n. The most wonderful part, the most important thing tense: highlight, highlight"]},{"name":"hollow","trans":["adj. empty; concave; hypocritical; hollow, empty; n. hole; valley; hole; vt. Make it hollow; vi. Form a cavity; adv. Useless; thorough comparison of levels: hollower, hollo..."]},{"name":"horizontal","trans":["adj. horizontal, parallel to the horizon adverb: uneven"]},{"name":"hut","trans":["n. Hut; temporary camp; vt. Make a living in a cottage; stay; vi. Live in a hut; stationed tense: hutted, hutting, huts"]},{"name":"identical","trans":["adj. The same adverb: identically"]},{"name":"ignore","trans":["vt. dismiss the lawsuit, ignore, ignore the tense: ignore, ignore"]},{"name":"illegal","trans":["adj. illegal; illegal; against the rules; n. illegal immigration; spying adverb: illegitimate"]},{"name":"illiterate","trans":["adj. illiterate, illiterate; n. illiterate, illiterate; n. illiterate, no known words: illiterate"]},{"name":"illustration","trans":["n. Illustration, diagram, pattern; illustration, example; description, illustration, pictorial adjective: illustrational"]},{"name":"imbalance","trans":["n. Imbalance, imbalance, imbalance"]},{"name":"implicit","trans":["adj. implicit; implicit adverb: implicit"]},{"name":"impose","trans":["vi. Deceiving; Using; Influencing; vt. imposing; deceiving; taxation tense: imposing, imposing; imposing Noun: imposer"]},{"name":"incentive","trans":["n. Something that motivates someone to do something; a stimulus; a trigger, a motivation"]},{"name":"incidence","trans":["n. Incidence, extent of impact"]},{"name":"incorporate","trans":["vt. include, add to, absorb; combine..., incorporate; form a company Tense: incorporated, incorporated, incorporated Adjective: inc..."]},{"name":"indication","trans":["n. Indication; symbol, sign"]},{"name":"indigenous","trans":["adj. native; innate, inherent adverb: indigenously noun: indigenously"]},{"name":"induce","trans":["vt. induce; induce; induce; induce tense: induce, induces adjective: inducible"]},{"name":"industrialise","trans":["VT. & vi. industrializing"]},{"name":"infection","trans":["n. (Medical) transmission, infection; infectious disease"]},{"name":"infrastructure","trans":["n. Infrastructure; infrastructure"]},{"name":"ingredient","trans":["n. Components; Ingredients"]},{"name":"initiate","trans":["vt. beginning, initiation; initiation; initial understanding; n. beginning; new entrants, those receiving initial knowledge; adj. Newly added; tenses for accepting preliminary knowledge: initiating, init..."]},{"name":"innovative","trans":["adj. Newly invented, newly introduced; innovative; reformist; willing to introduce new ideas"]},{"name":"insight","trans":["n. Insight, insight, deep insight; understanding, epiphany"]},{"name":"insist","trans":["vt. Persevere, emphasize; vi. insist, emphasize tense: insisted, insists"]},{"name":"install","trans":["vt. install; install; install; make... officially in service tense: installed, installed, installs also instals Noun: installer"]},{"name":"instantly","trans":["Adv. immediately, immediately; immediately"]},{"name":"institute","trans":["vt. establish, develop; begin, begin; n. Association, Society; College, Research Institute; Tense: instituted, instituting, institutes"]},{"name":"insufficient","trans":["adj. insufficient, an adverb of insufficient: insufficiently"]},{"name":"insurance","trans":["n. Insurance; insurance; insurance premiums; insurance measures, security guarantees"]},{"name":"integrate","trans":["vt. Make the union a whole; vt. & vi. integrated tense: integrated, integrated adjective: integrative"]},{"name":"intelligent","trans":["adj. intelligent; understanding adjective: intelligent Adverb: intelligently"]},{"name":"intense","trans":["adj. intense; intense; passionate; very comparative level: intenser, intensest Adverb: intensely"]},{"name":"interact","trans":["vi. interaction, interaction tense: interacted, interacts"]},{"name":"interior","trans":["n. Internal; Mainland; adj. internal; mainland, domestic noun: interiority Adverb: interively"]},{"name":"internal","trans":["adj. domestic; internal; intrinsic noun: internality; adverb: internal"]},{"name":"interval","trans":["n. Interval; intermission; interval"]},{"name":"joint","trans":["n. Joints; joints, joints; joints; large pieces of meat; adj. joint, joint; joint; connected; vt. Connect, fit; join; make a joint; vi. Fit; bio-temporal tense: joined, joy..."]},{"name":"judgement","trans":["n. Trial, judgment; adjudication; judgment, judgment; opinion, opinion, evaluation"]},{"name":"junction","trans":["n. Connections, joints; intersections; junctions"]},{"name":"juvenile","trans":["adj. Teenage; Childish; n.Teenage books"]},{"name":"keen","trans":["adj. sharp; enthusiastic, enthusiastic, eager; intense, intense; good; sharp, agile Comparative level: keener, keenest adverb: keenly noun: kee..."]},{"name":"label","trans":["vt. label; label on; n. Label; trademark; signature tense: labeled, labelled, labelling labels, labels"]},{"name":"landmark","trans":["n. Landmarks, landmarks; milestones; landmarks; epoch-making events"]},{"name":"landscape","trans":["n. landscape, landscape; landscape painting, landscape tense: landscaped, landscaping, landscapes Noun: landscaper"]},{"name":"launch","trans":["vt. launch; initiate, launch; launch...; vi. launch; commencement; take-off; n. launch; launch; motorboat; release, market release status: released, released"]},{"name":"layer","trans":["n. Layers, strata; strata; vt. Cultivate using the crimping method; pile up... into layers; vi. Rooting and breeding tenses using the crimping method: LAYERS, LAYERS"]},{"name":"layout","trans":["n. Layout; Design; Arrangement; Display"]},{"name":"leaflet","trans":["n. Flyers, leaflets, prints, tense: leafleted also leafletted leafleting leaflets leaflets leaflets"]},{"name":"liquid","trans":["n.Liquid; adj. liquid, liquid; clear, bright; smooth; easily converted to cash, flowing adverb: liquidly Noun: liquidness"]},{"name":"load","trans":["n. Load, load; loading capacity; workload; vi. loading; loading; loading; vt. load; load timing: loaded, loading, load"]},{"name":"maintain","trans":["vt. maintain; continue; maintain, maintain; insist; provide; support tense: maintain, maintain; maintain; maintain Noun: maintainabili..."]},{"name":"marine","trans":["adj. marine, marine, marine; naval; maritime, marine; n. sailors; marines"]},{"name":"master","trans":["vt. control; proficiency; conquest; n. master; master; master; teacher; adj. primary; master; skilled tense: mastered, mastering, masters Noun:..."]},{"name":"memorise","trans":["vt. memory; storage"]},{"name":"migrate","trans":["vi. Move; migrate with the seasons; move; vt. migrate; make a transplant tense: migrating, migrating; migrates Noun: migrator"]},{"name":"millennium","trans":["n. One thousand years, one thousand years; the millennium, the future happy era for all mankind, the Pacific heyday millennium white honey, big white round grain adjective: millennial Noun: millennialist"]},{"name":"mineral","trans":["n.Minerals; ores; minerals"]},{"name":"minimize","trans":["vt. Minimize; underestimate, despise; vi. minimized tense: minimized, minimized Noun: minimized..."]},{"name":"modify","trans":["vt. Modification, modification; vi. modified tense: modified, modified, modified Noun: modifiability Adjective: m..."]},{"name":"module","trans":["n. Unit, unit; module"]},{"name":"monopoly","trans":["n. Monopoly; monopolist; monopoly right Noun: monopolism Noun: monopolist Adjective: monopolistic"]},{"name":"monument","trans":["n. Monuments; Historic Sites; Monuments; Monuments; vt. A monument for..."]},{"name":"moral","trans":["adj. moral; spiritual; well-behaved; n. moral; allegorical adverb: morally"]},{"name":"mortality","trans":["n. Desperation; mass deaths; mortality"]},{"name":"motivation","trans":["n. Motivation; Motivation; Incentives; adj. motivational, motivational adjective: motivational"]},{"name":"mould","trans":["n. Mold, mold; personality, type; mold, mold; cultivated soil, humic soil v. casting, molding; influencing...; molding...; fitting...; making mold grow"]},{"name":"mystery","trans":["n. Mysteries, secrets; mysterious things, things difficult to understand; people of unknown origin"]},{"name":"myth","trans":["n. Myths; fictional people, fictional things"]},{"name":"neuron","trans":["n. Neuron, neural unit Adjective: neuronal"]},{"name":"notion","trans":["n. Concepts; Opinions; Intent"]},{"name":"nurture","trans":["vt. nurture; nurture, nurture; n. cultivate, nurture tense: nurtured, nurturing, nurtures Noun: nurturer"]},{"name":"nutrient","trans":["n. Nutrients, nutritional products; adj. Nutritional, Nutritional"]},{"name":"observer","trans":["n. Observers, Observers; Adherents"]},{"name":"obstacle","trans":["n. Obstacles, hindrances"]},{"name":"optimism","trans":["n. Optimism, optimism"]},{"name":"orchestra","trans":["n. Orchestral adjective: orchestral"]},{"name":"organic","trans":["adj. organic; organic, organic adverb: organically"]},{"name":"orthodox","trans":["adj. orthodox; conventional; traditional; n. orthodox people; orthodox things"]},{"name":"ozone","trans":["n. Ozone; fresh air Adjective: ozonic"]},{"name":"package","trans":["vt. Pack... into a package; package; n. package, package, thing wrapped together; a complete set of things, a package transaction tense: packaged, packaging, packages Noun:..."]},{"name":"panel","trans":["n. Dashboard; panel; panel; panel, full jury; vt. Paneled panel tense: paneled, panelled paneling, panelling panels, panels"]},{"name":"pedestrian","trans":["n. Pedestrian Noun: pedestrianism"]},{"name":"pendulum","trans":["n. Pendulum; rocking hammer; fluctuating state of affairs"]},{"name":"perceive","trans":["vt. Sensing, feeling; understanding; cognition; vi. feeling, sensing; recognizing tense: appreciating, appreciating adjective: conceivable..."]},{"name":"permission","trans":["n. Permit, Permit, Permit"]},{"name":"personnel","trans":["n. personnel; employees; personnel department"]},{"name":"perspective","trans":["n. Vision; Future; Hope; Perspective; Perspective; Perspective; Opinion, Idea Adverb: perspeculative"]},{"name":"pest","trans":["n. Pests; harmful objects; pesky people PEST macro-environmental analysis methods"]},{"name":"pharmaceutical","trans":["adj. Pharmaceutical; Pharmaceutical-dispensing"]},{"name":"phase","trans":["n. Phase, period; phase; vt. phased planning tense: phased, phasing, phases adjective: phasic"]},{"name":"photosynthesis","trans":["n. Photosynthesis; photosynthetic adjective: photosynthetic"]},{"name":"phrase","trans":["n. 'Slang' phrases, phrases; idioms; sayings, succinct statements, epithets; vt. narrative; tense: phrased, phrased, described adjective: phrasal"]},{"name":"physically","trans":["Adv. physiologically, physically; completely"]},{"name":"pillar","trans":["n. Pillars, columnar objects; beams; piers; vt. Support tenses with columns: pillared, pillaring, pillars"]},{"name":"pilot","trans":["n. Pilots; pilots; adj. pilot; v. driving; piloting; trial tense: piloting, piloting, pilots"]},{"name":"pleasurable","trans":["adj. Happy, pleasant, comfortable; n. Happy; adv. pleasantly, comfortably adverb: pleasurably"]},{"name":"plough","trans":["vt. plow; vi. plow to cultivate fields; open roads; n. plow; arable land"]},{"name":"polish","trans":["n. Polish, polish; polish, polish; elegant, fine; vi. Polish and smooth; vt. Polish to make it shiny; adj. Polishadj of Poland Polish, relating to Poland; Polish, Polish;..."]},{"name":"potentially","trans":["Adv. potentially; possibly; powerfully; authoritatively"]},{"name":"premier","trans":["adj. first; original; n. prime minister, prime minister's noun: premiership"]},{"name":"premise","trans":["vt. Introduce, put forward in advance; as a precondition for...; n. Precondition; each of the above; house with foundation; vi. Make a predetermined tense: prepared, prepared"]},{"name":"prescribe","trans":["VT. & vi. prescription; instruction; provision, designation of compliance with the tense: treating, suppressing; pronouns; pronouns: prescriber"]},{"name":"presume","trans":["vt. Assume; speculate; unauthorized; mean; vi. believe; act without permission tense: presumed, presuming, presumes adverb: presuming name..."]},{"name":"prey","trans":["vi. predation; plunder; torture; n. victim; preyed on animal; prey Prey tense: preyed, preying; preys Noun: preyer"]},{"name":"printer","trans":["n. Printers; Printers; Printers"]},{"name":"priority","trans":["n. Priorities; Priorities; Priorities; Priorities"]},{"name":"productive","trans":["adj. prolific; productive; beneficial adverb: productively Noun: productively"]},{"name":"prone","trans":["adj. easy to...; likely...; prone Noun: proneness"]},{"name":"property","trans":["n. Property; nature, performance; ownership adjectives: propertyless"]},{"name":"proportion","trans":["n. Equilibrium; proportionality, coordination; relationship between one thing and another in terms of quantity, size, etc.; proportion; portion tense: quantification, segmentation, proportion adjective:..."]},{"name":"proposal","trans":["n. Proposals, suggestions; marriage proposals"]},{"name":"prospect","trans":["n. Scenery; Prospects; Prospects; Prospects; Prospective Customers; Promising Candidates; vi. exploration; survey timing: prospected, prospected, investigated"]},{"name":"psychological","trans":["adj. psychological; spiritual; psychological; adverb relating to psychology: psychologically"]},{"name":"pump","trans":["vt. Use a pump to pump...; inflate; n. pump, pump; vi. Pumping tense: pumped, pumping, pump Noun: pumper"]},{"name":"purchase","trans":["n. Purchase; grip; lifting device; vt. Buy; win; vi. purchasing something tense: purchasing, purchasing Noun: purchasing..."]},{"name":"pursue","trans":["vt. Engage; catch up; continue; entangle; vi. to catch up; to carry on tense: to pursue, to purify Adjective: to pursue Noun:..."]},{"name":"qualify","trans":["VT. & vi. Eligible, qualified; vt. qualifying, qualifying tense: qualified, qualifying, qualifying"]},{"name":"quantity","trans":["n. Volume, quantity; total quantity; large quantity"]},{"name":"questionnaire","trans":["n. Questionnaires, questionnaires"]},{"name":"radical","trans":["adj. radical, fundamental; thorough, complete; radical, radical adverb: radically Noun: radicalness"]},{"name":"random","trans":["adj. arbitrary; random; random; n. random; adv. indiscriminately Adverb: random Noun: randomness"]},{"name":"reckon","trans":["vt. conjecture; estimate; 'incorrect' thinking; imagine; consider; think; 'positive' computational tense: reckoned, reckoning, reckons"]},{"name":"recommend","trans":["vt. recommend, introduce, praise someone; advise, suggest; make... seem desirable tense: recommend, recommend, recommend adjective: recomm..."]},{"name":"recreational","trans":["adj. Recreational, Recreational"]},{"name":"register","trans":["vt. Records; registration; registration; registration...; registered mail; formal submission; vi. registration; registration; registration; n. registration; register; register; register; register time: registered, registerin..."]},{"name":"regulate","trans":["vt. regulation, regulation; systematic management; control; calibration timing: adjust, regulate"]},{"name":"reinforce","trans":["v. Strengthen; enrich; strengthen; strengthen; make stronger; to increase strength; increase troops; reinforce; give... more support; provide more evidence for... tense: strengthen, reinforce, rei..."]},{"name":"remedy","trans":["n. Drugs, treatments; remedies, remedies"]},{"name":"remote","trans":["adj. distant; far; far away, far away; remote; aloof; callous, alienated, indifferent; tiny; slightly comparative level: remoter, remotest adverb: distant..."]},{"name":"removal","trans":["n. Move; dismissal; exclusion; relocation"]},{"name":"renaissance","trans":["n. Renaissance, Renaissance"]},{"name":"renowned","trans":["adj. famous; reputable"]},{"name":"rental","trans":["n. leasing; rental income, rent; adj. leased; collecting rent"]},{"name":"repeat","trans":["VT. & vi. Say it again, redo it; vt. Repeat, recite; supply again; vi. There is still a aftertaste after eating; n. Repeat; repeat; memorize; repeat, replay tense: repeat, repeat..."]},{"name":"replace","trans":["vt. replace, replace; replace, replace; return, repay; put... back in place tense: replace, replace Abbreviation: repl Adjective: replac..."]},{"name":"replicate","trans":["vt. replicate; repetitive tense: replicated, replicates adjective: replicative"]},{"name":"represent","trans":["vt. manifest, depict; represent, symbolize, represent; as a representative tense of... tense: express, express noun: represen..."]},{"name":"resemble","trans":["vt. like..., similar to tense: resembled, resembled, resembled"]},{"name":"reserve","trans":["vt. reserve something; have or keep; reserve or reserve; order; n. store; reserve; reserve; reserve; reserve; reserve; reserve; quiet tense: reserved, reserve"]},{"name":"residence","trans":["n. Residence; Residence; Residence; Period of Stay"]},{"name":"resolve","trans":["vt. Decide; break up...; resolve to do...; dissolve; vi. resolve; resolve; decompose; n. Resolve; decide what to do tense: resolved, resolve adjective..."]},{"name":"restore","trans":["vt. repair; restoration; restitution; vi. restore; restore tense: restored, restored Noun: restorer"]},{"name":"restrict","trans":["vt. limit; limit; constraint tense: restricted, restricting"]},{"name":"reveal","trans":["vt. reveal; reveal; reveal tense: reveal, reveal adjective: revealable Noun: revealer name..."]},{"name":"reverse","trans":["VT. & vi. reverse; reverse; reverse; overthrow; cancel; reverse; reverse; adj. opposite, reverse, reverse; n. opposite; opposite of a coin; failure, defeat; tense: reversed, reversed..."]},{"name":"revised","trans":["improved"]},{"name":"rival","trans":["n. Competitors; vt. compete with..., rivaled with... tense: rivaled, rivalled rivaling, rivalling rivals, rivals"]},{"name":"rotate","trans":["vi. rotation; cycle; vt. make rotation; make rotation; take turns; adj. radial tense: rotated, rotating, rotates Adjective: rotatable"]},{"name":"route","trans":["n. Road, route, route, journey time: routed, routing, routes"]},{"name":"royal","trans":["adj. king's, queen's; massive; extremely large adverb: royally"]},{"name":"salary","trans":["n. Salary Adjective: salaried"]},{"name":"schedule","trans":["vt. scheduling, scheduling; n. schedule, schedule; list, schedule tense: scheduled, scheduling, schedules adjective: scheduler..."]},{"name":"scheme","trans":["VT. & vi. planning; plot; n. conspiracy, trick; plan, plan tense: schemed, scheming, planning Noun: schemer"]},{"name":"scout","trans":["n. Scout; Scout; Scout; Talent Finder, Star Scout; Boy Scout; Boy Scout; v. Scout; Search; Find; Scout Scout Rocket Tense: scouted, scouting, s..."]},{"name":"screen","trans":["n. Screens, fluorescent screens; screens; movies, televisions; partitions, screens, curtains, curtains, tents; coverings, covers, barriers, shelters; screens, screens; fences; v. hiding, masking, protection; shelter, cover up, protection; screening, inspection;..."]},{"name":"sculpture","trans":["n. Carvings, sculptures; engravings; vt. & vi. carving, sculpting tense: sculptured, sculpting, sculpting adjective: sculptur..."]},{"name":"seal","trans":["n. Seals; seals, seals, stamps; seals, wax seals; vt. Stamped in; sealed; decided to SealABBr. Sea, Air, and Land Sea, Air, Land SealaBr. Sea,..."]},{"name":"seasonal","trans":["adj. seasonal, seasonal, season-changing noun"]},{"name":"sector","trans":["n. Department; section; defensive area; defense area; sector shape, sector; quadrant; function ruler; vt. Divide... into fan tenses: sectored, sectoring, sectors Adjective: sec..."]},{"name":"secure","trans":["adj. Secure; secure; reliable; secure; stable; secure; secure; secure; closely guarded; firm; sturdy; v. obtained, obtained, achieved; secured; secured; secured; secured; secured; secured; secured; secured; secured; secured; secured; secured; secured; secured; secured; secured; secured..."]},{"name":"sediment","trans":["n. Sediments; sediments"]},{"name":"seminar","trans":["n. Seminars, seminars"]},{"name":"senior","trans":["adj. older; senior; high-ranking; (US) most senior; n. older; senior; (US) graduate; senior student; senior student; senior student; senior student in “US” graduate class senior"]},{"name":"sensation","trans":["n. Feeling, Feeling; Perception; Excitation, Sensation"]},{"name":"sensitive","trans":["adj. vulnerable, easily damaged; susceptible; sensitive; easily offended; easily impulsive; neurotic; 'affectionate'; sympathetic and understanding; sensitive; sensitive; requiring careful handling, sensitive, delicate adverb: sen..."]},{"name":"sequence","trans":["n. A set of related things, a sequence; sequence, sequence, continuous tense: sequenced, sequenced"]},{"name":"session","trans":["n. Conference; session; session; semester; workshop Adjective: sessional"]},{"name":"settler","trans":["n. Migrants; colonists"]},{"name":"shallow","trans":["adj. shallow; superficial; n. shoals; vt. Make it lighter; vi. lighter comparative level: shallower, shallowest adverb: shallowly"]},{"name":"shell","trans":["n. Shell, shell; shape; shell; vi. peeling; setting the position of the command line interpreter; vt. peeling; shelling tense: shelled, shelling, shells Adjective: shel..."]},{"name":"shelter","trans":["n. Shelters; Coverings; Shelters; vt. conceal; protect; vi. evasion, refuge tense: sheltered, sheltering, shelters Adjective: shelte..."]},{"name":"shrink","trans":["VT. & vi. contraction; contraction tense: shrank, shrunk shrunk, shrunken shrinking, shrinks adjective: shrinkable..."]},{"name":"shuttle","trans":["n. Shuttles; shuttles; shuttle flights, buses, etc.; space shuttles; vt. Move back and forth like a shuttle; transport like a short shuttle; vi. Shuttle round trip time: shuttling, shuttling, shuttle..."]},{"name":"silent","trans":["adj. silent; silent; silent; unpronounced adverb: silently"]},{"name":"similarity","trans":["n. Similar, similar"]},{"name":"situated","trans":["adj. located in...; in... circumstances; v. makes located; makes"]},{"name":"skeleton","trans":["n. Skeleton, skeleton; outline; skinny people; adj. skeletal; general; skinny"]},{"name":"sketch","trans":["n. Sketch; sketch; summary; vt. Picture sketch or sketch; vi. Picture sketch or sketch tense: sketched, sketching, sketches Noun: sketcher"]},{"name":"slide","trans":["VT. & vi. Slide; glide; vi. slipping, falling; n. Glide, slide; slide tense: slide sliding, slides"]},{"name":"sophisticated","trans":["adj. Sophisticated; old; sophisticated, cutting-edge; elegant, cultured"]},{"name":"span","trans":["n. Span, span; distance between two boundaries; a period of time; vt. Build a span bridge or arch; cross; cross, cross, and run through SpanaBBR. Statistical Processing and Anal..."]},{"name":"spare","trans":["vt. Save, save, be unwilling, be stingy; extract, give, distribute, free up; save, exempt; forgive, forgive, do no harm; adj. Excess; spare; weak, thin; n. spare parts; spare tire Condition:..."]},{"name":"species","trans":["n. Species; Species; adj. On the species"]},{"name":"specimen","trans":["n. Specimens; samples, samples"]},{"name":"spectacular","trans":["adj. spectacular, majestic, captivating noun: spectacularity"]},{"name":"sponsor","trans":["vt. Sponsor, initiate n. sponsor; sponsor; sponsor tense: sponsored, sponsoring, sponsors Adjective: sponsored Noun:..."]},{"name":"spray","trans":["n. Water foam; spray; sprayer; vt. Spraying; vi. spray tense: spray, spray noun: sprayer"]},{"name":"statistics","trans":["n. A statistic; statistics, statistics; statistics"]},{"name":"steady","trans":["adj. Stable; unchanging; calm; vi. stable; vt. stabilize; stabilize; make firm; adv. Stable; stable; n. couples in a fixed relationship; fixed bracket comparison level: steadier, ste..."]},{"name":"stem","trans":["n. Stem, stem; stem; vt. Curb the Tense: stemmed, stemming, stems"]},{"name":"stimulate","trans":["vt. stimulating; motivating tense: stimulated, stimulated Noun: stimulated"]},{"name":"storage","trans":["n. Storage; warehouses; storerooms"]},{"name":"strategy","trans":["n. Strategy, Art of War; Strategy, Strategy; Strategy, Ingenuity"]},{"name":"stretch","trans":["vt. stretch, open; vi. stretch; adj. stretchable; n. stretch, extend tense: stretches, stretches Noun: str..."]},{"name":"string","trans":["n. Line, string; string; string, line; string, series; vt. Loaded in, stringed; string tenses: strung stringing, strings"]},{"name":"strip","trans":["vt. stripping; stripping; stripping; stripping; stripping; stripping; vi. Tense of undressing: stripped, stripping, strips"]},{"name":"submit","trans":["vi. surrender, surrender; vt. submit; 'positive' suggestion, claim, argument tense: submit, submit Noun: submit"]},{"name":"subsequent","trans":["adj. Subsequent, adverb after...:"]},{"name":"subsidy","trans":["n. Allowances; grants; allowances"]},{"name":"substance","trans":["n. Substance; subject, essence; substance, substance Substancen. Matter, thing"]},{"name":"suburb","trans":["n. Suburbs, suburbs"]},{"name":"sum","trans":["n. Total; Amount; vi. Summary; vt. Summary; total sumAbbr. SurUnderwater Missile Ship-to-Underwater Missile Tense: summed, su..."]},{"name":"supplement","trans":["n. Supplement; supplement; supplement; appendix; additional service fee; supplement v. supplement, supplementary tense: supplementing, supplementing; noun: su..."]},{"name":"suspect","trans":["n. Suspect; adj. Untrustworthy; questionable; vt. doubt; conjecture; vi. doubt; conjecture tense: suspected, suspecting, suspecting"]},{"name":"switch","trans":["vt. Transformation; beating with whips, etc.; vi. conversion; punch; change of defense; n. switch; transition; whip tense: switched, switching, switches Adjective: swit..."]},{"name":"tablet","trans":["n. Pill; simple; monument, plaque; tense: tableted, tableting, tablet"]},{"name":"talent","trans":["n.Talented, talented; talented Adjective: talented Adjective: talentless"]},{"name":"tap","trans":["vt. Tap; tap lightly; put on your mouth; vi. Tap; tap; tap; n. Tap tap; tap TapaBr. Technical area planning Technical area planning tense: tappe..."]},{"name":"temperate","trans":["adj. eating in moderation, restrained; gentle adverb: temperate Noun: temperateness"]},{"name":"temporal","trans":["adj. Temporal; temporary, ephemeral, non-eternal; secular; present; temporal; indicative of time, tense; temple; n. temporary, earthly; vt. secularize; n. laypeople"]},{"name":"temporary","trans":["adj. temporary, temporary, short adverb: temporary noun: temporariness"]},{"name":"territory","trans":["n. Territory, layout; jurisdiction, area of business; site, field, scope"]},{"name":"therapy","trans":["n. Treatment, therapy"]},{"name":"thrive","trans":["vi. prosper; prosper; grow strong tense: thrived, throve thrived, thrived, thrived"]},{"name":"trail","trans":["VT. & vi. Being dragged behind; vt. Track, track; vi. loss, failure; n. footprints; stink; path; one strand, one tense: trailing, trailing, trails"]},{"name":"trait","trans":["n. Human personality, remarkable characteristics, characteristics"]},{"name":"transform","trans":["VT. & vi. changing tense: transformable, transforms Adjective: transformable"]},{"name":"trek","trans":["n. Trekking hard; vt. Pulling; handling; vi. trekking tense: trekked, trekking, treks Noun: trekker"]},{"name":"tremendous","trans":["adj. huge, huge; wonderful, wonderful adverb: exceedingly"]},{"name":"trial","trans":["n. Testing; refinement; interrogation; effort; adj. interrogation; testing"]},{"name":"trunk","trans":["n.Tree trunk; clothes box; elephant nose"]},{"name":"uncertainty","trans":["n. Uncertain; uncertain; uncertain; uncertain, uncertain"]},{"name":"underlie","trans":["vt. located or exists below; forms the basis of...; causes tense: underlay underlain, underlies"]},{"name":"underlying","trans":["adj. fundamental, fundamental; implicit, potential"]},{"name":"undertake","trans":["vt. undertaking; undertaking; undertaking; undertaking; beginning tense: undertaken, undertakes"]},{"name":"upgrade","trans":["vt. upgrade; upgrade; improve variety; n. upgrade; uphill; rise; adv. Up above; adj. The upward tense:,,"]},{"name":"valid","trans":["adj. proper; valid, well-founded adverb: validly"]},{"name":"vanished","trans":["n. Disappeared without a trace"]},{"name":"vegetation","trans":["n.Plants; plants"]},{"name":"venture","trans":["vt. Dare; vi. risk; speculation; n. risk; enterprise tense: ventured, venturing, ventures Noun: venturer"]},{"name":"venue","trans":["n. Place of gathering; venue; venue of sporting event; place of crime; place of trial; position in dispute"]},{"name":"vertical","trans":["adj. vertical, upright; overhead, apex; n. vertical line, vertical surface Noun: verticality Adverb: vertical"]},{"name":"vessel","trans":["n. Containers, vessels; boats, ships; vessels, blood vessels"]},{"name":"via","trans":["prep. through; through"]},{"name":"visible","trans":["adj. obvious; visible; obtainable; existing; n. visible object; adverb for a tangible item in import and export trade: visibly"]},{"name":"voluntary","trans":["adj. voluntary; obligatory, unpaid adverb: voluntarily Noun: voluntariness"]},{"name":"voyage","trans":["n. Sailing; voyages; travel notes; vi. Sailing; sailing; vt. fly by; through tense: voyaged, voyaging, voyages Noun: voyager"]},{"name":"vulnerability","trans":["n. Weaknesses, attacks"]},{"name":"weigh","trans":["VT. & vi. Weight of...; link v. heavy weight; vt. trade-off; consider tense: weighed, weighed Noun: weigher"]},{"name":"wipe","trans":["vt. Wipe; Apply; Erase; vi. wipe; hit; n. Wipe; hit hard Status: wiped, wipes"]},{"name":"witness","trans":["n. Eyewitnesses; Witnesses; Testimony; Evidence; vt. see, witness; testify; indicate, explain the tense: witness, witness"]},{"name":"worthwhile","trans":["adj. Worthy, valuable, valuable"]},{"name":"yield","trans":["vt. Give birth; surrender; give up; vi. surrender; n. yield; yield tense: yielded, yielded Noun: yielder"]},{"name":"absence","trans":["n. Absence, departure, absence; number or length of absence; absence, absence"]},{"name":"abstract","trans":["n. Abstraction; abstract; abstract concept; adj. abstract; esoteric; vt. Extract; Summarize; Abstract...; vi. Write a summary; write a summary of the tense: abstracted, abstracting,..."]},{"name":"academic","trans":["adj. college; academic; theoretical; n. college student, university teacher; academic adverb: academically"]},{"name":"accelerate","trans":["VT. & vi. accelerate, accelerate tense: accelerate, accelerate adjective: accelerate"]},{"name":"accessible","trans":["adj. Easy to obtain, easy to obtain, easy to reach; accessible, accessible; accessible, easy to enter; easy to see, easy to get along with, easy to deal with; understandable, easy to understand; susceptible to infection, easy to seduce..."]},{"name":"accompany","trans":["vt. Accompany, accompany; accompany... occur simultaneously; accompaniment tense: accompany, accompany, accompanies"]},{"name":"accomplish","trans":["vt. complete, achieve, succeed tense: accomplishing, accomplishing adjective: accomplishable Noun:..."]},{"name":"account","trans":["n. Accounts; Accounts; Accounts, Accounts; Accounts; Settlement of Accounts; Accounts; Settlement of Accounts; Accounts; Accounts; Accounts; Accounts; Accounts; Accounts; Accounts; Accounts; Claims; Notes, Descriptions, Reports; Explanations, Explanations, Explanations; v. Sees Yes; Seems to be the tense: agree, ac..."]},{"name":"accurate","trans":["adj. accurate, accurate, and unmistakable adverb: accurate Noun: accuracy"]},{"name":"acknowledge","trans":["vt. acknowledge; acknowledge; acknowledge; acknowledge; thank you; acknowledge; acknowledge tense: acknowledge, acknowledge Abbreviation: ack"]},{"name":"acoustic","trans":["adj. vocal, auditory adverb: acoustically"]},{"name":"acquisition","trans":["n. Acquisitions, acquisitions; acquisitions"]}]