[{"name":"file","trans":["n. Files, briefcases, files, [computer] files vt. Line up, file, apply"]},{"name":"command","trans":["n. Order, command; headquarters, command; [computer] command; control power vt. command, control, command; order; due, worth vi. give an order; order, command adj. command, made in accordance with an order (or requirement)"]},{"name":"use","trans":["n. Use, Usage, Right to Use, Application vt. Use, use, treat vi. drug addiction"]},{"name":"program","trans":["n. Program (single), program, plan vt. planning, preparation of plans, production of programs"]},{"name":"line","trans":["n. Line, line, route, field boundary, wrinkles, family vt. &vi. Use it as a lining, line up in a row, arrange it in order... vi. Line up, line up... line up, line by"]},{"name":"if","trans":["conj. If and if no, even if n. conditions, imagine"]},{"name":"display","trans":["n. Display, display, show off vt. Show, show, brag"]},{"name":"set","trans":["vt. Place, place; put in a certain condition; set up; place tableware vi. fall into the mountain; set out; set; set; set; television adj. fixed; located...; stubborn; arranged"]},{"name":"key","trans":["adj. The main, key n. Key, Answer, Key, Key, Tone vt. Lock, adjust, provide answers, type vi. Use the key"]},{"name":"list","trans":["n. List, table of contents; oblique; cloth edge, cloth head; narrow strip vt. List, include; arrange... into a table; record in the list vi. list on the table"]},{"name":"by","trans":["prep. By, via, before, according to adv. Get close, pass by, put aside adj. Next to it, incidental n. Secondary events"]},{"name":"press","trans":["vt. pressure, pressing; persecution; holding vi. oppression; persecution; heavy pressure n. forced conscription; news reports, publications; pressing; printing press (factory)"]},{"name":"with","trans":["prep. Together with, use, and with, include"]},{"name":"format","trans":["n. Design, layout n. [computer] format, DOS command: format (disk), use an empty disk or use a disk to create a new empty disk to store data v. vt. Format, design, and arrange"]},{"name":"change","trans":["n. Change, change v. Change"]},{"name":"cursor","trans":["cursor"]},{"name":"directory","trans":["n. Catalogs, Business Directories, Guide [Computer] Catalogs adj. The one that gave guidance"]},{"name":"from","trans":["prep. From, from..."]},{"name":"menu","trans":["n. Menu"]},{"name":"option","trans":["n. Choice (freedom); options; right to choose; ability to choose v. getting or approved to make choices; mobilizing players"]},{"name":"character","trans":["n. Personality, quality; character; character; reputation; status"]},{"name":"current","trans":["n. (water, gas, electricity) flow, trend adj. Circulating, current, recent"]},{"name":"type","trans":["n. Type; lead; text (printed or printed); type in... vt.& vi. typing vt. [Medical] determination (blood type); classification of... by type; becoming typical of...; [printing] casting (lead letters, etc.)"]},{"name":"screen","trans":["n. Screen; screen; screen vt. screen (coal, ore, etc.); filming; screening (film); shelter"]},{"name":"specify","trans":["vt. specify, describe, specify, detail"]},{"name":"move","trans":["vt.& vi. move, move vi. move; act; progress; (machine, etc.) start vt. propose; move; shake; change n. change; migrate"]},{"name":"disk","trans":["n. Disc, record, flower plate, disc-shaped object, CD vt. Use a disc to rake the ground [computer] disk"]},{"name":"text","trans":["n. Text, document, text, text vt. &vi. send text messages"]},{"name":"drive","trans":["v. driving, driving force n. Driving, fast lane, propulsion, drive, road, street"]},{"name":"see","trans":["vt. Seeing, experiencing, understanding, ensuring, treating, visiting, and accompanying vi. Notice, imagine, understand, investigate n. Dioceses, protagonist powers"]},{"name":"name","trans":["n. First name, name, name vt. Name, title, appoint adj. famous, famous"]},{"name":"record","trans":["n. Records, records, discography vt. Records, (sound, etc.) are recorded to indicate adj. regarding"]},{"name":"box","trans":["n. Box, box, special seat, pavilion, dilemma vt. Pack... in a box, restrain, adjust, change shape, use boxing... vi. participate in boxing"]},{"name":"database","trans":["n. Databases"]},{"name":"help","trans":["n. Help, aid vt. &vi. help, improve"]},{"name":"memory","trans":["n.Memory, memory, memories"]},{"name":"all","trans":["adj. All, all adv. All, very, not at all, all pron. all, all n. all"]},{"name":"on","trans":["prep. On top of..., supported by..., use, according to [computer] turn on adv. wear, forward (move), (indicate persistence) adj. It indicates that it is connected, working or in use, indicates that it has occurred, and is on duty abbr. =Ontario"]},{"name":"copy","trans":["n. Reproduction; copy; manuscript (newspaper, etc.); written material prepared for printing vt.& vi. copying; copying; imitation of vt. permissive; imitation of... style or pattern; copying; copying"]},{"name":"shell","trans":["n. Shell, shell, shape vt. &vi. Removing shells, shelling, picking up shells n. [computer] DOS command: install an alternate COMMAND.COM file, and change the environment size"]},{"name":"delete","trans":["vt. removing"]},{"name":"enter","trans":["vi. Enter, join, start, take the stage, enter the character vt. Enter, sign up, start, join, quote, submit [computer] submit"]},{"name":"margin","trans":["n. Margins, margins, margins, margins vt. Surround it, add an edge"]},{"name":"mark","trans":["n. Smudge, mark, score, imprint, record vt. Mark it, keep an eye out, score it, leave a stain, make... obvious vi. Mark, score, leave a mark"]},{"name":"also","trans":["Adv. Also, similarly, and"]},{"name":"do","trans":["Aux. Auxiliary verb (no meaning) v. do, do"]},{"name":"information","trans":["n. Information, intelligence, news, data, inquiries"]},{"name":"choose","trans":["vt. &vi. selects"]},{"name":"select","trans":["adj. Selected n. Selected person or thing v. Choice vi. Pick, pick, pick vt. choose, pick"]},{"name":"group","trans":["n. Group, Group, Regiment vt. &vi. aggregation, cluster [computer] group"]},{"name":"first","trans":["Adv. First of all, first, priority adj. First, oldest, first-class n. (ordinal term) first, first person or thing, best class (college degree), lowest gear (car, bicycle, etc.)"]},{"name":"field","trans":["n. Field; Pasture; Wilderness; Battlefield; Stadium vi. As a field player adj. Scanning field; field game; wild vt. Expose yourself on the field; get on; answer (usually successfully) and deal with (questions)"]},{"name":"procedure","trans":["n. Procedure, procedure; conventional practice"]},{"name":"print","trans":["n. Editions, prints, imprints vt. &vi. Print, publish, print adj. printed"]},{"name":"return","trans":["n. Return, return, repay, report vt. &vi. return, return, come back adj. The one that returned"]},{"name":"number","trans":["n. Number, digit v. number, plus number, total vi. Total vt. numbering"]},{"name":"selected","trans":["adj. The past tense and past participle of the chosen verb select"]},{"name":"want","trans":["n. Lack, Poverty, Desire, Need, Insufficiency vi. I want, hope, must vt. lacking, wanting, liking, should"]},{"name":"window","trans":["n. Windows"]},{"name":"message","trans":["n. News, Information, Highlights vt. &vi. transmission of information, communication"]},{"name":"dialog","trans":["n. Dialogue, dialogue (American) = dialogue"]},{"name":"example","trans":["n. Role models, examples vt. Take... as an example"]},{"name":"create","trans":["vt. create, cause"]},{"name":"insert","trans":["n. Inserts vt. &vi. plugged"]},{"name":"related","trans":["adj. It's related, it's related v. Talk about it, it's related vbl. Speak, it's related"]},{"name":"item","trans":["n. Project, terms, item (or item) adv. also"]},{"name":"edit","trans":["vt. Edit, edit, revise n. Editorial work"]},{"name":"marked","trans":["adj. A marked, prominent, and prominent v. marks, scores, and indicates VBL. Mark, score, indicate"]},{"name":"area","trans":["n. Area, area, area"]},{"name":"parameter","trans":["n. Parameters, parameters, determinants"]},{"name":"then","trans":["Adv. Well then, then then adj. At the time"]},{"name":"variable","trans":["adj. Mutable, volatile n. Variables, volatile things"]},{"name":"tab","trans":["n. (tabulate) watchmaking, labels, pendants, rings, bills vt. Install with a label or pendant"]},{"name":"up","trans":["Adv. Up, increase, use up, completely, store, close to adj. An upward, upright, finished, happy, ongoing prep. upward, facing n. superiors, uphill, prosperity, above vt. Rise up, increase vi. upturn"]},{"name":"string","trans":["n. Line, string, string vt. String, string, tighten, hang; tie; tie; tie vi. Set the strings for... adj. Of the line"]},{"name":"each","trans":["adj. Every, every, every adv. Every int. each, individually, individually"]},{"name":"active","trans":["adj. active; active; active; effective; active n. Active voice; activist"]},{"name":"topic","trans":["n. Subject, topic, subject"]},{"name":"start","trans":["n. Start; Start; Start; Start; Start from vt.& vi. Start; Start (question); Start; Start; Start; Start; Make Start vi. start; suddenly appear; suddenly jump; suddenly spill"]},{"name":"mode","trans":["n. Method, style, pattern, style, trendy [music] style"]},{"name":"selection","trans":["n. Choice, selection, selected person or thing"]},{"name":"function","trans":["n. Functions, functions, major gatherings vi. run, work"]},{"name":"word","trans":["n. Words, words, messages, promises vt. Use words to express"]},{"name":"make","trans":["vt. make, manufacture; produce, formulate; make; make; produce vi. start; experiment; move; increase n. manufacture; production volume; character; shape, style"]},{"name":"right","trans":["adj. Right, upright, proper, vertical, right, normal, positive n. rights, right, justice, factual adv. Right, properly, straight, right, immediately, very, to the right vt. Correction, straightening, fair treatment, and settlement of grievances vi. Revision"]},{"name":"value","trans":["n. Value, importance, price, (pl) values vt. evaluation, valuation, emphasis"]},{"name":"button","trans":["n. Buttons, badges, button-like things, unripe mushrooms, buttons vt. Decorate with buttons, pin buttons, shut up vi. Buckle up"]},{"name":"index","trans":["n. Index <数>; Index; Instructions; Mark v. Index...; Index...; Index...; [Economics] Adjust by Living Index (Wages, Prices, etc.) vi. [Mechanics] Transposition"]},{"name":"without","trans":["adv. outside; outdoors; missing; not showing or not showing something prep. no, lack; outside conj. unless, if not"]},{"name":"appear","trans":["vi. appear, appear, publish, arrive"]},{"name":"left","trans":["adj. on the left; on the left; on the left; on the left; on the left; on the left; on the left, activists, adv. to the left; on the left v. to leave (past tense and past participle of leave)"]},{"name":"save","trans":["vt. Save; Save; Save; Rescue vi. Save; Save; Save prep. &conj. Other than... n. Rescue, rescue"]},{"name":"next","trans":["adj. immediately after; next to; close; next to adv.; then; next; next; next; n. next; next; next prep; next after...; next to..."]},{"name":"off","trans":["adj. A distant, vacationed, idle, backward and laid-back adv. Leave, leave, break up, split, don't keep running, step down prep. Leave, drop out, leave work vi. Go away, go away"]},{"name":"following","trans":["n. The following items, subordinates, Dang Yu, adj. The following, followed by prep. after (something)"]},{"name":"control","trans":["n. Restraint, control, control, operation of devices vt. control, control, control"]},{"name":"only","trans":["adj. The best, only, outstanding adv. Just, only, exclusively, only, just now. Unless, but, however, after all"]},{"name":"user","trans":["n. Users, users"]},{"name":"end","trans":["n. End, end, goal, end vt.& vi. end, end adj. eventual"]},{"name":"system","trans":["n. Systems, systems, institutions"]},{"name":"contain","trans":["vt. including, accommodating, restraining, suppressing vi. homemade"]},{"name":"time","trans":["n. Time; moment; era; time; schedule time for...; measure time; adjust (mechanical) speed; speed adjustment (mechanical); speed setting (clock, watch) vi. match; harmony; beat adj. timing; regular; [American English] installment (payment)"]},{"name":"letter","trans":["n. Letter; certificate, license; letter, text; literal meaning v. use a letter; write the letter in; add a title vi. write the letter in printed form"]},{"name":"data","trans":["n. (plural of datum) data, data"]},{"name":"setting","trans":["n. Mosaic; environment; installation; background (of something, drama, novel, etc.) v. placement (present participle of set); placement; establishment; arrangement"]},{"name":"desire","trans":["n. Wishes, desires, desires v. yearnings, demands, requests vt. yearns"]},{"name":"position","trans":["n. Position, position; status, position vt. Place, decide the location of..."]},{"name":"down","trans":["adj. Downward, depressed, depressed, stop running adv. Downwards, falling, in the south n. Fluff, sweat, despising prep. Along... down"]},{"name":"task","trans":["n. Jobs, tasks vt. Give it to someone (task)"]},{"name":"view","trans":["n. Vision, landscape, insight, method, inspection vt. Think of... as, look at, consider"]},{"name":"switch","trans":["n. Switches, electric doors, gates, converters, vt. &vi. Whipping, shifting, exchanging, abrupt switching, swinging, switching on or cutting off... electric current"]},{"name":"include","trans":["v. Including, including, including... [computer] including"]},{"name":"get","trans":["vt. make; obtain; receive; become vi. become; become; arrive"]},{"name":"default","trans":["n. Assumed value, default (value), default of responsibility, absence v. default, default of obligation, absence, arrears [computer] default"]},{"name":"structure","trans":["n. Structures, Structures, Buildings v. Composition, Establishment, Construction"]},{"name":"into","trans":["prep. To..."]},{"name":"path","trans":["n. Path, path; route, path; (metaphor) path (of life); path (of thought, action, life)"]},{"name":"blank","trans":["adj. Blank, blurry, total, expressionless, unfinished n. Blank (place), gap, emptiness, empty bomb (with ammunition but no warhead) vi. Vanished, run away vt. Blur, delete, and block (consecutive points during the game) give your opponent zero points"]},{"name":"open","trans":["n. Open, outdoor, empty adj. Open, open, open vt. Open, publish, open, start vi. Open, pass, scream"]},{"name":"add","trans":["vt. &vi. incremented"]},{"name":"enable","trans":["vt. enable..., enable [computer]"]},{"name":"operation","trans":["n. Surgery, action, activity, operation"]},{"name":"erase","trans":["v. Erase, wipe [computer] erase"]},{"name":"filename","trans":["filenames"]},{"name":"search","trans":["n. Search, Research v. Search, Investigate"]},{"name":"another","trans":["adj. Another one, one more pron. &prep. another"]},{"name":"last","trans":["adj. The last one, the last one, the most recent one, is late adv. Finally, latest n. Last person (or thing that happened) vi. &vt. lasts"]},{"name":"column","trans":["n. Columns, columns; columns; columns"]},{"name":"after","trans":["adj. Future advs. Later, later conj. After... prep. After..."]},{"name":"prompt","trans":["adj. Quick, agile, immediate vt. Inspire, promote, push; hint vi. Reminder n. Reminder; Content of Reminder n. [Business] Payment Term"]},{"name":"two","trans":["num. Two, two"]},{"name":"execute","trans":["vt. execute, execute, execute, complete [computer] execution"]},{"name":"about","trans":["adj. Get ready for adv. Approximately prep. regarding"]},{"name":"escape","trans":["n. Escapist, evacuation equipment vt. &vi. escape, avoid adj. evasive"]},{"name":"error","trans":["n. Mistake, negligence"]},{"name":"currently","trans":["Adv. Now, now, now"]},{"name":"extension","trans":["n. Extension, extension, range, extension number"]},{"name":"same","trans":["adj. The same advs. Similarly pron. the same person or thing"]},{"name":"status","trans":["n. Status, identity, circumstances, circumstances"]},{"name":"run","trans":["n. Running, distance, trend vt. Run, graze, operate, smuggle, operate, cast, and suffer vi. run, race, drive, run, encounter, continue, melt, fade, flow, spread, spread, spread, spread adj. molten, cast, migratory"]},{"name":"argument","trans":["n. Arguments, arguments (arguments), reasons"]},{"name":"statement","trans":["n. Statements, statements"]},{"name":"shift","trans":["n. Exchange, change, move, successor vt. Change, transfer, change voice vi. change, accountability, change clothes"]},{"name":"store","trans":["n. Store, storage, warehouse vt. store, store, supply, preserve adj. Reserve storage (in a computer); memory"]},{"name":"scroll","trans":["n. Scrolls, table of contents vt.& vi. scroll"]},{"name":"replace","trans":["vt. replace, replace"]},{"name":"macro","trans":["adj. A huge, wide-ranging, total n. [computer] macro"]},{"name":"page","trans":["n. Page v. (Give...) When you have poor hearing vt. Call (via megaphone, pager, etc.)"]},{"name":"quit","trans":["v. Leave, resign, stop"]},{"name":"define","trans":["vt. definition, explanation"]},{"name":"reference","trans":["n. Reference, Source, Reference n. Referrer, Letter of Recommendation vt. Providing references"]},{"name":"other","trans":["adj. Other, other pron. another person (or thing) n. Other person (or thing)"]},{"name":"while","trans":["conj. When..., however n. &adj. For a while vt. Extinguish"]},{"name":"pressing","trans":["adj. Urgent, urgent, practical vbl. oppression"]},{"name":"restore","trans":["vt. restore, return, refurbish"]},{"name":"top","trans":["n. Top, pole, cover, (women's) top, supreme position, gyroscope adj. The highest, top notch vt. Soar high, put a roof over it, and rise to the top vi. Draw conclusions, reach the peak"]},{"name":"how","trans":["Adv. How, how, how, how much conj. How, how, in... way n. Way"]},{"name":"color","trans":["n. Color, smell, style vt. Color and whitewash... vi. blushing"]},{"name":"allow","trans":["vi. (for) Consider, make it possible vt. give, acknowledge, allow, determine"]},{"name":"block","trans":["n. Blocks; Blocks; Buildings, <英> Buildings; Obstructions, Obstructions; Blocking; Restrictions"]},{"name":"decimal","trans":["adj. Decimal, decimal n. Decimal"]},{"name":"main","trans":["adj. Main n. Main part, main line, supply system (water, gas, electricity, etc.), physical strength"]},{"name":"definition","trans":["n. Definition, Explanation, Clarity"]},{"name":"between","trans":["Adv. In the middle prep. Between..."]},{"name":"optional","trans":["adj. optional, not mandatory"]},{"name":"date","trans":["n. date, dating, date palm vt. Dating, setting a date vi. Dating back to n. [computer] DOS command: display or set the system date"]},{"name":"remove","trans":["n. Spacing, movement vt. remove, fire, move, take away vi. migrate, leave, relocate"]},{"name":"arrow","trans":["n. Arrow, arrow vi. Fast and straight forward like an arrow shuttling"]},{"name":"label","trans":["n. Label; mark, symbol; label the line foot on a [build] door or window; label; call...; list...; [transform] use radioactive elements to mark (elements or atoms, etc.)"]},{"name":"within","trans":["Adv. Inside n. Inside prep. In... adj. The one inside"]},{"name":"issue","trans":["n. Issues; Releases; Issues; Publications vt. Publish, release; distribute; release, discharge vi. Issued; released; caused... as a result; transmitted"]},{"name":"different","trans":["adj. different, different"]},{"name":"available","trans":["adj. available, available, useful, effective"]},{"name":"returned","trans":["adj. sent back, returned"]},{"name":"associate","trans":["vt. (Make) Connect; (Make) Union; Get Connected; Associate; Partner; Partner; Partner; Partner; Comrade; Unofficial Member adj. Joint; Partnership; Informal; (by nature) closely linked"]},{"name":"attribute","trans":["n. Attributes, characteristics; signs, symbols vt. belonging to, belonging to"]},{"name":"DOS","trans":["n. [meter] disk operating system (=Disk Operating System)"]},{"name":"before","trans":["prep... before; before, better than; in front of...; with... conj. before; before...; before...; before...; before, before; with... adv. before, before; before, ahead"]},{"name":"order","trans":["n. Order; Order; Rules, Systems; Order v. Order; Order; Arrangement vi. Place Order"]},{"name":"modify","trans":["vt. Modification, Correction, Mitigation vi. rewritten"]},{"name":"array","trans":["n. Arrays, (Chen) arrays, large batches, a series of vt. Arrange, deploy, dress up"]},{"name":"mouse","trans":["n. Mice, mice, timid people, dark blue lumps vi. Catching mice, creeping action vt. Search carefully"]},{"name":"note","trans":["n. Notes, notes, memos, notes, notes, notes, notes, notes vt. Record, Annotate, Note"]},{"name":"locate","trans":["vt. Find, set in, and establish vi. establishing"]},{"name":"video","trans":["adj. Video n. Video (machine) vt. Make a video of..."]},{"name":"printer","trans":["n. Printers, printers"]},{"name":"bar","trans":["n. Bars, bars, bars vt. ban, obstruct"]},{"name":"bottom","trans":["n. Bottom; hips; hull; bottom of water; part underneath clothing; lowland; background color; end adj. VT at the bottom. Fill... the bottom up, build the foundation, and reach the bottom vi. Reach the bottom, get to the bottom, drop to the bottom"]},{"name":"carriage","trans":["n. Four-wheeled carriages, carriages"]},{"name":"content","trans":["n. Content, table of contents, content adj. Satisfied, satisfied vt. Satisfy..., reassure..."]},{"name":"either","trans":["pron Any conj. Or, also adj. Either, adv from both parties. also"]},{"name":"OK","trans":["adj. OK, good, adv. OK, good, OK"]},{"name":"space","trans":["n. Location, space, distance, space, open space, continuous period of time vt. &vi. evenly spaced, divided"]},{"name":"editor","trans":["n. Editor, Editor"]},{"name":"exist","trans":["v. Existence"]},{"name":"scope","trans":["n. Competence, scope, vision, opportunity, leeway vt. Study it carefully"]},{"name":"paragraph","trans":["n. Paragraph vt. Subdivide... and write a short review vi. Write a short review"]},{"name":"multi","trans":["n. Various; many"]},{"name":"clear","trans":["adj. Clear, unequivocal, clear, clear-headed vt. Clarify, remove barriers, and make bright, clear vi. Become clear, disappear, clear adv. clearly, always n. Gaps, open spaces, open places"]},{"name":"exit","trans":["n. Exit, exit, departure vi. Quit, die vt. runaway"]},{"name":"report","trans":["n. Rumors, reports, transcripts, explosions vt. Report, Report, Record vi. narrative, report"]},{"name":"execution","trans":["n. Execute, complete, execute"]},{"name":"backup","trans":["n. Backup, backup"]},{"name":"version","trans":["n. Versions, statements, translations"]},{"name":"find","trans":["vt. &vi. Discover, feel, and think of n. Discoveries"]},{"name":"pointer","trans":["n. Pointers, pointers, hounds (that can indicate the location of the prey), suggest that Pointer: points to the pole star"]},{"name":"subset","trans":["n. Subset"]},{"name":"keyboard","trans":["n. Keyboard vt. Use the keyboard to enter (information)"]},{"name":"full","trans":["adj. full, full; complete, complete; rich; detailed adv. extremely, sufficient; fully, completely; complete; directly n. full; complete; complete; complete; at peak v. sew clothes wide; sew the skirt out of wrinkles; [print] steam, rinse"]},{"name":"check","trans":["<美>vt. Check, check; stop, suppress; check... vi. verify, check; suspend; check; check; [chess] General n. Check; stop, suppress; check, check"]},{"name":"should","trans":["Verb auxiliary. Should, actually, probably"]},{"name":"single","trans":["adj. Single, simple, single n. Single ticket, single room, single person vt. Single out vi. (baseball) Make a first run"]},{"name":"provide","trans":["vi. supply, provide vt. provide; stipulate; prepare"]},{"name":"title","trans":["n. Title, Name, Title, Ownership, Qualification, Championship vt. Give it a title, add the title to adj. Of the title"]},{"name":"expression","trans":["n. Expression, expression, expression, expression, phrase"]},{"name":"through","trans":["Adv. Crossing, completely prep. Pass by, through, with adj. completed; completed; penetrating, straight-through"]},{"name":"toggle","trans":["n. Ping-pong switches, triggers, lasso pins, rod-shaped buttons vt. Fasten the buttons and provide cable studs vi. Open the switch"]},{"name":"code","trans":["n. Codes, Passwords, Regulations, Guidelines vt. Code... into a code"]},{"name":"such","trans":["adj. Such, such pron. This kind of adv. So much"]},{"name":"beginning","trans":["n. Beginning, beginning, origin, early adj. present participle of begin the verb to begin"]},{"name":"guide","trans":["vt. Guide; Manipulate; Influence n. Mentor; Guide; Guide; Things with guiding significance"]},{"name":"tree","trans":["n. Tree"]},{"name":"environment","trans":["n. Environment, the outside world"]},{"name":"but","trans":["Adv. Just, just conj. But prep. Except for... pron. only"]},{"name":"device","trans":["n. Installation, design, strategy, equipment"]},{"name":"highlight","trans":["n. Highlighted areas, highlights, most important details or events, flashpoints vt. Highlight, highlight, make... seem important, illuminate [computer] stand out"]},{"name":"call","trans":["v. Calling, shouting; summoning, calling, summoning; ordering; calling n. Shouting, shouting; telephone communication; necessity, reason; request"]},{"name":"continue","trans":["vt. &vi. continue, continue, maintain"]},{"name":"indicate","trans":["v. Indicate, indicate, display, symbolize, indicate"]},{"name":"until","trans":["prep. Until... conj. Till... when..."]},{"name":"begin","trans":["vt.& vi. start; start; start; found vi. (From...); Begin; Begin; Begin to Speak"]},{"name":"place","trans":["n. Place, position, award list vt. Place, appoint, arrange vi. Get a ranking"]},{"name":"rename","trans":["v. rename, rename n. [computer] DOS command"]},{"name":"swap","trans":["n. Exchange vt. &vi. Exchange, trade with..."]},{"name":"work","trans":["n. Work, role, achievement, work, good deeds, process, effectiveness, construction engineering, factory, (mechanical) moving parts adj. Working vi. create, achieve, work, operate, function, function, function properly, succeed, make an impact, proceed gradually, process vt. create, produce, operate, forge, strive to achieve, use"]},{"name":"remain","trans":["v. Keep, Still, Remain, Remain, Remain n. Remains, Remains, Remains"]},{"name":"close","trans":["n. End, conclusion adj. Close, close, almost, close, evenly matched vt. Close, end, close to vi. Close, close, fight adv. next to each other, tightly"]},{"name":"combination","trans":["n. Combine, combine"]},{"name":"profile","trans":["n. Side, half face; shape, outline; [aircraft] airfoil; character profile vt. Outline of...; draw a side picture for...; write a biography for (someone); [machine] mill out the outline of..."]},{"name":"unless","trans":["conj. Unless prep. Except..."]},{"name":"except","trans":["vt. Except, excluding prep. &conj. Other than..., if not, unless"]},{"name":"turn","trans":["vt.& vi. turn; rotate; change direction; cause discomfort vt. turn acid; transform; turn n. flip; change (of course or direction); opportunity"]},{"name":"back","trans":["adj. Backward, remote, outdated, backward adv. Backward n. Back, spine, back, backrest vt. Back, support vi. receding"]},{"name":"sure","trans":["adj. Convinced, inevitable, certain advv. Of course, definitely, unquestionably"]},{"name":"section","trans":["n. Part, section, section, area, department, road segment, section vt. Divide and cut vi. divide"]},{"name":"follow","trans":["vt. Follow, follow, follow, and understand vi. Follow along, then n. Follow"]},{"name":"split","trans":["n. Cleavage, fissure, fissure adj. Scattered v. separate, split, split"]},{"name":"need","trans":["n. Required, required, lacking v. required, required conj. needing"]},{"name":"access","trans":["n. Entry, exit; approach, entry; growth; outbreak v. approach, entry; use, approach, acquisition"]},{"name":"additional","trans":["adj. additional, additional"]},{"name":"cancel","trans":["n. Cancel, revoke vt. Cancel, delete, divide vi. offsetting"]},{"name":"document","trans":["n. Documents, official documents vt. Record, prove [computer] documents with documents, etc."]},{"name":"case","trans":["n. Situation, factual situation, case vt. Pack the box, step on"]},{"name":"numeric","trans":["adj. numeric, n. number of numeric values, number"]},{"name":"go","trans":["vi. Go, go, become, carry on, put, go, disappear vt. Walk through, weigh [computer] and execute"]},{"name":"load","trans":["n. Load, burden, load capacity v. Load, load, load (gun), load (gun), load [computer]"]},{"name":"try","trans":["n. Try, test vt. Trial, attempt, test vi. trying"]},{"name":"size","trans":["n. Dimensions, size vt. Arrange (or sort) by size adj. A vt of a certain size. Fill (something) with..."]},{"name":"entire","trans":["adj. whole, complete, homogenous, pure, comprehensive"]},{"name":"leave","trans":["leave, resign, leave"]},{"name":"history","trans":["n. History"]},{"name":"second","trans":["n. vt. Support n. Second, second adj. Second one, second one, another"]},{"name":"reflow","trans":["vi. reflux"]},{"name":"output","trans":["n. Yield, output, output power, output terminal vt. Outputs (information, etc.)"]},{"name":"out","trans":["VT. adj. Outward, outward, outdated, unconsidered adv. outward, offshore, out, out, out, out, run out, run out, finish, show up, end vt. Release, reveal vi. Uncover prep. Outward, through n. Outward, outsider, outcast"]},{"name":"both","trans":["adj. both, both pron. both adv. both are conj. Not only... but also...,... and... both"]},{"name":"install","trans":["v. Install, install, make... work n. [computer] install, DOS command: finish loading and host the software"]},{"name":"source","trans":["n. Source"]},{"name":"way","trans":["n. Method, path, direction, style, (some) aspect, degree, state adv. Very, very, very far adj. The midpoint of the route, associated with the midpoint of the route"]},{"name":"assign","trans":["v. Assign, assign n. [computer] DOS command redirects drive letter to second drive letter"]},{"name":"support","trans":["n. Support, Assistance, Support vt. Support, help, support"]},{"name":"specific","trans":["adj. Special, clear, specific n. Specific drugs, characteristics, details"]},{"name":"join","trans":["v. Participate, combine, join"]},{"name":"expand","trans":["vt. Add, detail, expand, expand... vi. expand, add, detail"]},{"name":"like","trans":["adj. Similar, same vt. &vi. Like, would, and would like to prep. Like, like n. Hobbies, similar people (or things) adv. Probably, the same as... conj. as"]},{"name":"Diskette","trans":["n. [meter] floppy disk"]},{"name":"skip","trans":["n. Jump, read vt. &vi. Jump, bounce, skip"]},{"name":"application","trans":["n. Application, application; application, request, application form; diligence, hard work; application, application of medication"]},{"name":"confirmation","trans":["n. Confirmation, confirmation, Christian faith"]},{"name":"whether","trans":["conj. &adv. whether"]},{"name":"hold","trans":["vt. Hold, Hold; Retain, Preserve; Detain, Detain; Contain vi. Hold, Hold; Agree, Approve; Remain Unchanged; Effective n. Hold; Retain; Control"]},{"name":"click","trans":["n. Click, tick, tap vt. Click, make a tick, make... beat and answer vi. Hit, perfect match, success, select by clicking"]},{"name":"write","trans":["v. Write"]},{"name":"byte","trans":["n. Bytes, 8-bit tuples"]},{"name":"abbreviate","trans":["vt. Abbreviate, shorten, make... short"]},{"name":"show","trans":["n. Shows, performances, things vt. &vi. indicate, manifest, indicate"]},{"name":"otherwise","trans":["Adv. Otherwise, differently, pron in different ways. Other adj. varying"]},{"name":"working","trans":["adj. worker's, labor's"]},{"name":"delimiter","trans":["n. Delimiters, separators"]},{"name":"location","trans":["n. Location, location"]},{"name":"perform","trans":["v. Execute, perform, do"]},{"name":"graphic","trans":["adj. Vivid, infographic n. Chart"]},{"name":"read","trans":["vt.& vi. reading, reading aloud; showing; research; understanding vt. showing; reading; reading, understanding n. reading; reading; reading; read; read; read aloud; knowledgeable; knowledgeable"]},{"name":"confirm","trans":["v. Determination, approval, certification"]},{"name":"sort","trans":["n. Type, appearance, attitude v. Classification, sorting n. [computer] DOS command: sort data in character files, or sort the output of DOS commands"]},{"name":"clause","trans":["n. Clauses, clauses, clauses"]},{"name":"once","trans":["Adv. Once, used to conj. Once n. Adj. Once upon a time"]},{"name":"however","trans":["Adv. However, conj. However, however,"]},{"name":"extend","trans":["v. Expand, extend, expand"]},{"name":"look","trans":["n. Look, look, look, face vi. Look, pay attention, and look, as if vt. Look at it, look at it, express it with your eyes or face, look forward"]},{"name":"now","trans":["n. Now, right now, adj. Existing, current adv. Now, conj right away. Since ABBR. =National Organization of Women"]},{"name":"original","trans":["adj. original, original; original, original n. Original, original; original person, weirdo"]},{"name":"correspond","trans":["vi. compliance, communication, equivalent"]},{"name":"property","trans":["n. Property; nature; props"]},{"name":"several","trans":["adj. A few, their own prons. A few"]},{"name":"learn","trans":["vt. Learn, learn vi. understand, learn"]},{"name":"cause","trans":["n. Reason; career; goal vt. cause; cause suffering"]},{"name":"bracket","trans":["n. Brackets, brackets, grade vt. Support, in parentheses, fall into one category, include, support"]},{"name":"omit","trans":["vt. omission, omission, omission"]},{"name":"running","trans":["n. Running; management, adj. running; mobile; running adv. serially"]},{"name":"edge","trans":["n. Edge, edge, edge vt. Add an edge to... and slowly cross it, causing a gradual loss of vi. Move forward slowly"]},{"name":"form","trans":["n. Form, Shape, Form v. Formation, Composition, Establishment"]},{"name":"instruction","trans":["n. Instructions, instructions, instructions"]},{"name":"ASCII","trans":["American Standard Code for Information Interchange, American Standard Code for Information Interchange"]},{"name":"below","trans":["adv. below, to below prep. (indicates position) below...; (indicates status) under the cover of...; (indicates comparison) falls short; below"]},{"name":"standard","trans":["n. Standards, specifications; flags, military flags; standards of measurement and measurement; upright pillars adj. standard, qualified; common; generally; generally; generally accepted as excellent"]},{"name":"occurrence","trans":["n. Occurrence, event, discovery"]},{"name":"lock","trans":["n. Lock; sluice lock, boat lock; lock (machine parts, etc.); lock, lock, close; fix; hide vi. get stuck, don't move; get tangled; stiff and immovable"]},{"name":"append","trans":["v. Attach, add, hang n. [computer] DOS command to establish a subdirectory search path for data files"]},{"name":"destination","trans":["n. Destinations, destinations, attractions"]},{"name":"password","trans":["n. Password, password"]},{"name":"point","trans":["n. Points, main points, tips, details, goals vt. &vi. point out, aim"]},{"name":"variety","trans":["n. Diversity, variety, juggling"]},{"name":"many","trans":["n. Many people, many adj. A lot of prons. Many people or things"]},{"name":"buffer","trans":["n. Buffer, buffer vt. Lightening, cushioning"]},{"name":"useful","trans":["adj. useful"]},{"name":"object","trans":["n. Object, object, object v. Objection, proposal... as a reason for objection"]},{"name":"again","trans":["Adv. Also, again, on the other hand"]},{"name":"carry","trans":["n. Handling, range, projection, intermodal transport vt. load, transport, transmit, express, carry, accommodate, bear, conceive, continue, drive, win, record vi. the load is conveyed, allowed to be transported, passed"]},{"name":"update","trans":["vt. &vi. Update, add the latest information n. Update"]},{"name":"moving","trans":["vbl.move"]},{"name":"coprocessor","trans":["coprocessor"]},{"name":"overlay","trans":["overwritten"]},{"name":"practice","trans":["n. Practice, practice, habit; business v. &vi practice, internship, start a business"]},{"name":"navigation","trans":["n. Navigation, navigation"]},{"name":"automatically","trans":["adj. A thoughtless adv. automatically"]},{"name":"total","trans":["adj. total (amount, etc.); total; complete; absolute n. Total, total; total quantity vt.& vi. sum, calculate the total number of..."]},{"name":"previous","trans":["adj. Before... before, before, before"]},{"name":"software","trans":["n. Software"]},{"name":"shortcut","trans":["n. Shortcuts v. Take shortcuts, take shortcuts"]},{"name":"long","trans":["adj. Long, long, long vi. Desire, Desire, Desire Adv. long term, far away n. Long time, long syllable"]},{"name":"unique","trans":["adj. unique, unique, rare"]},{"name":"part","trans":["n. Part, part, role, part vt. Separate, separate, distribute vi. Separation, leaving adv. Partly adj. separating"]},{"name":"internal","trans":["adj. domestic, internal, internal to the body"]},{"name":"fill","trans":["vt. Fill, fill, spread, hold n. Enough"]},{"name":"basic","trans":["adj. basic; [chemistry] alkaline; [geology] fundamental; primary n. Fundamental, basic; basic principles, basic principles, basic rules; elements; basic training"]},{"name":"math","trans":["n. Mathematics"]},{"name":"since","trans":["Adv. Then conj. Since, because, since prep. Since"]},{"name":"determine","trans":["vt. & vi. (Make) make a determination, (make) make a decision v. decide, determine, adjudicate; make a decision; limit vi. [Mainly used for law] Settlement, termination, termination"]},{"name":"making","trans":["n. Make the present participle of the verb make"]},{"name":"center","trans":["n. Center, center, protagonist, center, focus vi. Centered, focus on... vt. Focus, put it in the center"]},{"name":"already","trans":["Adv. already"]},{"name":"keyword","trans":["n. Keywords"]},{"name":"action","trans":["n. Prosecution, conduct, role, circumstances, activity"]},{"name":"condition","trans":["n. Circumstances, conditions v. Determination, domination, training subject to..."]},{"name":"quick","trans":["adj. fast, rapid; smart, aggressive; flexible; adv. made in a short time quickly, quickly n. Live flesh (under the nails); the center of feelings, the place where you feel the most; the key point, the core"]},{"name":"give","trans":["vt.& vi. give; give; give; make vt. supply; produce; host; pay (to buy something or do) vi. (Object) falls down; concessions n. Stretchability, elasticity"]},{"name":"large","trans":["adj. Broad, big, intense adv. universally, massively"]},{"name":"chapter","trans":["n. Chapters, chapters, regular meetings of pastors, local chapters"]},{"name":"computer","trans":["n. Computer"]},{"name":"complete","trans":["adj. A thorough, complete, completed vt. complete; make perfect, make perfect"]},{"name":"past","trans":["adj. Past advs. Over n. Past prep. past, past"]},{"name":"match","trans":["n. Match, match, rival, match person, spouse v. make... match, compete with..."]},{"name":"recover","trans":["vt. Recovering; Regaining; Recovering <正> (proper state or position) vi. restoring health (physical strength, ability, etc.) n. Restoring initial posture"]},{"name":"always","trans":["Adv. always"]},{"name":"require","trans":["v. Needs, Requirements"]},{"name":"opening","trans":["n. Start, talk, unveil, vacant positions vbl. Open, open, start"]},{"name":"network","trans":["n. Network, system, broadcast network vt. Use the network to cover, network vi. Join the network"]},{"name":"sign","trans":["n. Symbols, plus and minus signs, signs, signs v. sign, sign, sign"]},{"name":"release","trans":["n. Release, Extradition, Release vt. release, relinquish, grant permission to publish, launch"]},{"name":"three","trans":["num. Three prons. &adj. Three (one, only...)"]},{"name":"recall","trans":["vt. recall; recall, remember; cancel n. recall; recall; withdraw"]},{"name":"deletion","trans":["n. Delete"]},{"name":"fixed","trans":["adj. fixed, unchanging, ready v. repair, make... fix, decide vbl. Repair, fix..., decide [computer] fixed"]},{"name":"amount","trans":["n. Quantity, total amount vi. Total, equal to"]},{"name":"alias","trans":["n. Aliases, pseudonym adv. Also known as,"]},{"name":"quote","trans":["n. Quote v. Quote, prove, quote"]},{"name":"correct","trans":["adj. Correct v. correction, correction vt. rectifying"]},{"name":"else","trans":["adj. Other, other advs. Also, otherwise"]},{"name":"maximum","trans":["n. Extreme, maximum amount, maximum adj. The highest, the greatest extreme"]},{"name":"under","trans":["prep. Under..., within..., under... control, below adv. Under..., in a coma, drowned adj. The one below, the subordinate one, the lesser"]},{"name":"take","trans":["vt. take, take; take; accept (gifts, etc.); spend (time, etc.) vi. take; obtain n. lenses; opinions; amount of income; scene"]},{"name":"element","trans":["n. Composition, elements, basic principles, (plural) severe weather"]},{"name":"modification","trans":["n. Amendment, modification"]},{"name":"input","trans":["n. Enter"]},{"name":"uppercase","trans":["n. Capital letter adj. Uppercase vt. Typeset or print in capital letters"]},{"name":"plus","trans":["prep. (indicates calculation) plus; (indicates inclusiveness) plus; [colloquial language] and; (indicates number) above zero (degree) n. plus sign; [mathematics] positive quantity; benefit; addition; addition; positive; additional; more than the amount shown"]},{"name":"found","trans":["vt. establish, establish; found v. find (past participle of find)"]},{"name":"debug","trans":["v. Debug, exterminate (somewhere) pests, remove obstacles, correct... errors, find and remove eavesdropping devices within..."]},{"name":"force","trans":["n. Strength, force, violence, influence vt. violence, coercion, extortion, pressure [computer] coercion"]},{"name":"lowercase","trans":["adj. vt in lowercase. Write in lowercase, type in lowercase n. Lowercase, lowercase"]},{"name":"just","trans":["adj. Just, fair, and proper adv. Just right, just right"]},{"name":"undo","trans":["v. Untie, release, cancel"]},{"name":"environ","trans":["vt. surround, surround"]},{"name":"why","trans":["Adv. Why conj. The reason for..., why int. Whoops, pron. Why, why"]},{"name":"temporary","trans":["adj. temporary, temporary n. Temporary workers"]},{"name":"put","trans":["vt. Place, place, and place in vi. submit, note"]},{"name":"instead","trans":["Adv. instead, instead"]},{"name":"encounter","trans":["n. Unexpected encounter, encounter vt. &vi. encounter, chance encounter, encounter"]},{"name":"across","trans":["Adv. Cross over, make... be understood (or accepted) prep. through, across"]},{"name":"matching","trans":["adj. matching, the present participle of the compatible verb match"]},{"name":"wildcard","trans":["n. [meter] wildcard"]},{"name":"spill","trans":["vt.& vi. overflow; spill; gush; swarm out n. Spill; spill; overflow; small plug"]},{"name":"level","trans":["n. Level, Level, Standard, Hierarchy adj. Flat, flush, stable, reasonable, full vt. flatten, equalize, aim, flatten, overthrow, accuse vi. Move towards stability, aim, treat people sincerely, and make equality"]},{"name":"browse","trans":["vt. &vi. browse, watch freely, graze n. Browse, young leaves"]},{"name":"speech","trans":["n. Speech, conversation, discourse, language"]},{"name":"occur","trans":["vi. occur; appear; flash"]},{"name":"memo","trans":["n. Memorandum"]},{"name":"prior","trans":["adj. The more important, earlier adv. First n. Abbot of the Priory; Deputy Abbot of the Priory"]},{"name":"loaded","trans":["adj. Loaded (loaded, loaded with ammunition, weighted) v. loading"]},{"name":"length","trans":["n. Length, length"]},{"name":"round","trans":["n. Circle, (some kind of round) ballroom dance, regular activity, one round (round) adj. Round, slightly chubby, complete, candid, well-finished adv. Circumferential vt. Make a circle, go around it, make... completely, make it an integer vi. Become round (fat), curved prp. around, all over"]},{"name":"variant","trans":["n. Variant adj. varying"]},{"name":"floppy","trans":["adj. crackling, laid-back, sloppy"]},{"name":"machine","trans":["n. Machine, machine; mechanical person; core v. manufactured by machine, vi. machined by machine vi. cut by machine"]},{"name":"square","trans":["n. Square, block, square, square adj. A square, upright, just, and strong vt. Make... square, adjust, and consistent vi. In line with adv. at a right angle, straight, square"]},{"name":"supply","trans":["n. Supply, Supply, Reserve vt. supply, supply, provide enough to satisfy"]},{"name":"home","trans":["adj. Home (hometown) adv. Home, at home, right direction n. Home, residence, domestic, nursing home vt. Providing accommodation vi. Go home, move"]},{"name":"normal","trans":["adj. normal, normal n. Normal, standard"]},{"name":"onto","trans":["prep. To..."]},{"name":"during","trans":["prep. During..."]},{"name":"module","trans":["[Computer] module n. Components"]},{"name":"monochrome","trans":["n. Monochrome painting, monochrome painting method adj. monochrome, black and white [computer] monochrome"]},{"name":"assistance","trans":["n. Help, aid"]},{"name":"tell","trans":["vt. Tell, say, know, recognize, count vi. narrate, denounce, testify, produce results"]},{"name":"library","trans":["n. Libraries, collections"]},{"name":"demonstration","trans":["n. Demonstration, demonstration, expression, assembly"]},{"name":"stack","trans":["n. Stack, heap vt. Stack it up and place it in vi. Pile up in a pile"]},{"name":"even","trans":["adj. Flat, even-numbered, equal adv. Even, exactly, just v. makes flat, equal"]},{"name":"evaluate","trans":["vt. evaluation, evaluation"]},{"name":"times","trans":["n. Time, duration, number of times, multiplied by vt. Schedule time, time, time, multiply [computer] DOS commands: display and allow changing the system time adj. According to time, of time"]},{"name":"previously","trans":["Adv. Previous (Advance)"]},{"name":"directly","trans":["Adv. directly (immediately, completely)"]},{"name":"logical","trans":["adj. Logical, logical, and capable of reasoning"]},{"name":"template","trans":["n. Templates, templates"]},{"name":"calling","trans":["n. Occupations, industries, invitations to call"]},{"name":"later","trans":["adj. The later one, the later adv. Later, later, late"]},{"name":"driver","trans":["n. Driver, driver"]},{"name":"therefore","trans":["Adv. Therefore, so"]},{"name":"saving","trans":["n. n. Savings, salvage (plural) savings: savings, deposits"]},{"name":"detail","trans":["n. Details, details, parts, dispatch vt. Describe, select, and decorate with small elements vi. Draw details"]},{"name":"linker","trans":["[Meter] (object code) connector"]},{"name":"loop","trans":["n. Rings, rings, bends, circuits vt. Make... form a ring, use a circle, connect vi with a ring. Form a ring, act in a circle"]},{"name":"process","trans":["n. Process; process; work method; process flow v. processing; review; review; review vi. line up adj. those that have undergone special processing (or treatment)"]},{"name":"scheme","trans":["n. Plan, Plan, Conspiracy v. Plan, Design, System, Structure, Intent"]},{"name":"every","trans":["adj. Every, every..."]},{"name":"refer","trans":["vt. Submit...; attribute... and categorize it as vi. Talk, consult, reference"]},{"name":"possible","trans":["adj. possible"]},{"name":"above","trans":["adj. The adv above. On top, more than n. Prep. On top of..., more than"]},{"name":"overview","trans":["n. Overview (situation), summary [computer] overview"]},{"name":"result","trans":["n. Results, Achievements, Answers v. Produce, Start, Cause"]},{"name":"syntax","trans":["n. Syntax"]},{"name":"abbreviation","trans":["n. Abbreviations"]},{"name":"BIOS","trans":["abbr. (=Basic Input/Output System) Basic input/output system"]},{"name":"hidden","trans":["adj. hidden, secret vbl. hide, hide, hide [computer] hidden"]},{"name":"null","trans":["adj. ineffective, ineffective, worthless n. zero [computer] empty vt. invalidate"]},{"name":"send","trans":["vt. Give, send, send, launch vi. broadcast n. Wave thrust"]},{"name":"private","trans":["adj. private, covert n. Soldiers, Soldiers"]},{"name":"hard","trans":["adj. Hard; tough, demanding adv. diligently, violently, steadfastly"]},{"name":"hardware","trans":["n. Hardware n. (computer) hardware"]},{"name":"say","trans":["vt. Say, say, express, assume, indicate vi. Say n. Right to speak adv. circa"]},{"name":"equal","trans":["adj. Equal, equal, competent n. Opponents, rivals, peers vt. Equal to, comparable"]},{"name":"pack","trans":["n. Package, group, pair, gang, group vt. Pack, bundle, stuff, pack up your luggage and wear vi. package, preserve (with something), preserve, pack"]},{"name":"minus","trans":["adj. Negative, minus n. minus sign, negative number, disadvantage prep. subtracting"]},{"name":"alternate","trans":["adj. Alternating, alternating, spaced vt. &vi. alternate, take turns"]},{"name":"collapse","trans":["n. Collapse, collapse, collapse vi. Collapse, collapse, collapse vt. collapse, shrink"]},{"name":"linux","trans":["A UNIX-like operating system that can be used for free"]},{"name":"corner","trans":["n. Corner, corner; corner; dilemma; [business] hoarding vi. driving around; gathering in a corner v. monopoly; forcing into trouble adj. located in the corner"]},{"name":"present","trans":["n. Present, now adj. In-person, attended, present v. gifted, proposed, presented"]},{"name":"interpreter","trans":["n. Interpreters, interpreters, interpreters of procedures"]},{"name":"advance","trans":["n. Move forward, advance vt. Move forward, increase, stay ahead vi. Move forward, improve adj. in advance, in advance"]},{"name":"forward","trans":["adv. moving forward; moving forward; moving forward; ahead of time; adj. forwardly; rapidly; (social/political) progressive; precocious vt. promoting, encouraging; forwarding (according to new address); sending n. forward"]},{"name":"fast","trans":["adj. fast; fast; fast sensitive; tight adv. Fast; fast; tight; thorough (than the exact time or announced) vi. fasting, (in particular) fasting n. Fasting period, fasting period; fasting, dieting"]},{"name":"special","trans":["n. Albums, cars, specialties, specials, special issues adj. special, special"]},{"name":"slash","trans":["vi. Drastic cuts in vt. Slash, sharp slash, drastic reduction n. Slash, slash, long incision, underwear"]},{"name":"utility","trans":["n. Public facilities, utility, utility programs, utility supplies, practical adj. Versatile, multi-functional"]},{"name":"regardless","trans":["adj. Careless, careless adv. disregard"]},{"name":"disable","trans":["v. Incapacitate..."]},{"name":"compatible","trans":["adj. able to coexist, juxtaposed, suitable, compatible n. Compatible"]},{"name":"depend","trans":["vi. Rely on, Trust, and Count on"]},{"name":"empty","trans":["adj. empty, empty, empty n. Empty object vt. Use... empty vi. becomes empty, flows in"]},{"name":"alphabetical","trans":["adj. in alphabetical order"]},{"name":"branch","trans":["n. Branches, branches vt &vi. branch, bifurcation"]},{"name":"resume","trans":["v. Continue, start again n. Curriculum vitae, curriculum vitae; Summary"]},{"name":"multiple","trans":["adj. Many, diverse n. multiples, in parallel"]},{"name":"monitor","trans":["n. Supervisors, class leaders, listeners, [computer] displays, monitors v. Surveillance, monitoring"]},{"name":"configuration","trans":["n. Structure, layout, morphology, Gestalt mental completion [computer] configuration"]},{"name":"replacement","trans":["n. Exchange, replacement, replacement"]},{"name":"required","trans":["adj. required"]},{"name":"table","trans":["n. Table, flat ground, slate, table vt. shelving, fitting, watch-making adj. Of the table"]},{"name":"loss","trans":["n. Loss, loss, loss"]},{"name":"exact","trans":["adj. Exact vt. demand, demand"]},{"name":"aboveboard","trans":["Adv. Clear and just earth, frankly adj. Clear and honest, straightforward"]},{"name":"activate","trans":["v. Stimulate, make... activity, create"]},{"name":"around","trans":["adj. Approximately, within the existing range adv. Approximately, everywhere, around prep. In the vicinity of..., everywhere"]},{"name":"slow","trans":["adj. slow advs. Slowly vt.& vi. slow down, slow down"]},{"name":"floating","trans":["adj. the present participle of the verb float which is floating, fluid, unfixed"]},{"name":"refresh","trans":["vt. & vi. Make... invigorate, lift your spirits, restore your spirit"]},{"name":"stop","trans":["n. Stop, stop, stop, block vt. Stop, stop, block vi. stop, stop, end"]},{"name":"pass","trans":["vt.& vi. walk through; pass; approve; pass; pass; happen; no n. channel required; pass; pass; pass; pass; pass; pass; pass; pass"]},{"name":"public","trans":["adj. Open, well known, public n. public places, members of the public"]},{"name":"eject","trans":["vt. ejection; eviction; forced departure vi. ejection"]},{"name":"ignore","trans":["vt. ignore, ignore, ignore"]},{"name":"share","trans":["n. Part, share, plow vt. Share, share, distribute vi. share"]},{"name":"sequence","trans":["n. Sequence, series, sequence, set of shots vt. Arrange the order"]},{"name":"consist","trans":["n. Composition vi. Composition, Existence, Consistency"]},{"name":"step","trans":["n. Steps, steps, steps vt. tread, measured in steps"]},{"name":"double","trans":["n. Double, replica, double actor, reverse, double room adj. Double, double, deceptive, increased adv. Double ground, double ground, reverse ground vt. Double it, fold it in half, hold it tight, and make a stand-in vi. Double up, turn around, part-time, substitute performance"]},{"name":"come","trans":["vt. Approach and play vi. come, happen, reach, enter"]},{"name":"lower","trans":["adj. Lower, lower, lower vt. Lower, fall, weaken, devalue vi. frowning, lowering, gloomy, less n. frowning, subordinate, gloomy appearance, omens"]},{"name":"describe","trans":["vt. Description, drawing (especially geometric figures)"]},{"name":"count","trans":["v. Compute, treated as, depending on n. Count"]},{"name":"pop","trans":["n. Take out, loud sound, pop music, pop culture and art, (especially used as a title) dad adj. Popular, hot, popular vt. Take it out, make a bursting sound, then suddenly stick it out, hit it, and fire vi. It made a bang (out of excitement and surprise), Zhang Da adv. Suddenly, pop abbr. =point of purchase POP abbr. =population population"]},{"name":"valid","trans":["adj. well-founded; effective; proper, lawful"]},{"name":"suspend","trans":["v. Postponement, Suspension (Suspension), Suspension, Cancellation vi. Crane, suspension vt. hang, hang, suspend, abort"]},{"name":"enhance","trans":["vt. improve, strengthen, increase"]},{"name":"separate","trans":["n. Separate, printed copy adj. separate, separate, separate v. separate, separate, separate"]},{"name":"echo","trans":["n. Echo, echo, echo, reverberation, resonance vt. Echo, echo, repeat, imitate vi. echo, echo n. [computer] DOS command: disallow (or allow) batch command line display on screen"]},{"name":"necessary","trans":["adj. essential, necessary, necessary n. [pl.] necessities"]},{"name":"able","trans":["adj. capable, capable"]},{"name":"marking","trans":["n. Imprint, mark, mark the present participle of the verb mark"]},{"name":"ask","trans":["vt. Inquiries, requests, requests, offers vi. Inquire, beg"]},{"name":"term","trans":["n. Term; Terms; Term; Term v. Called...; Called..."]},{"name":"bring","trans":["vt. Brings, causes, motivates, and persuades vi. yielded"]},{"name":"warning","trans":["n. Warnings, Alerts, Notices vbl. Warnings, Precautions, Notices"]},{"name":"less","trans":["adj. Fewer, smaller adv. Fewer, smaller n. Smaller amounts, secondary prep. Minus"]},{"name":"comment","trans":["n. Comments, Comments; Gossip v. Comments, Comments"]},{"name":"effect","trans":["n. Results, effects, effects; gist vt. induce, cause; achieve, achieve"]},{"name":"expanding","trans":["adj. expanded, expanded"]},{"name":"on-line","trans":["adj. online, real-time"]},{"name":"reorder","trans":["Reorder, reorder"]},{"name":"direct","trans":["adj. Straight, direct, and candid vt. Command, command, and be responsible vi. guidance, pointing out"]},{"name":"enclose","trans":["vt. Surround, circle, put in an envelope, and include [computer]"]},{"name":"reset","trans":["n. RESET, RE-ORGANIZE v. RESET, RE-ORGANIZE"]},{"name":"various","trans":["adj. various"]},{"name":"paper","trans":["n. Papers, papers, papers, newspapers, notes vt. Use a paper package, supply paper, and complete vi in a hurry. wallpaper adj. paper, paperwork, theoretical"]},{"name":"prevent","trans":["v. Prevention, prevention"]},{"name":"side","trans":["n. Side, side, side adj. Side, side vt. Support, agree vi. supports"]},{"name":"push","trans":["n. Push, work hard, resolve vt. &vi. push, squeeze, force"]},{"name":"programming","trans":["n. Programming, present participle of the programming verb program"]},{"name":"upper","trans":["adj. upper, higher status, upper, northern n. shoe upper, upper teeth, stimulants, pleasant experience"]},{"name":"row","trans":["n. Line ups, boat trips, loud vt. Boating, in rows of vi. boating, arguing"]},{"name":"pressed","trans":["adj. The past tense and past participle of the oppressed, compressed verb press"]},{"name":"temporarily","trans":["adj. Temporary advs. temporarily, temporarily"]},{"name":"day","trans":["n. Daytime, one day"]},{"name":"repaint","trans":["v. Repaint, Redraw v. Redraw"]},{"name":"redefine","trans":["vt. redefinition"]},{"name":"relation","trans":["n. Relationships, Family, Relatives, Narratives, Statements"]},{"name":"dimension","trans":["n. Dimensions, dimensions, volume, dimensions n. Range; aspect vt. Standard size; form... size"]},{"name":"boundary","trans":["n. Demarcation line, border"]},{"name":"zoom","trans":["vi. humming; rapid rise n. buzzing sound; rumbling sound; (vehicle, etc.) speeding sound; zoom vt. causes rapid rise; causes rapid increase"]},{"name":"initialize","trans":["vt. initialized"]},{"name":"personal","trans":["adj. private, personal n. (newspaper's) private column"]},{"name":"true","trans":["adj. An accurate, reliable, true, correct, official adv. Straightforward, factual n. True, precise vt. Balance..."]},{"name":"wish","trans":["n. Desire, wish, (plural) praise, command vt. &vi. want, hope"]},{"name":"font","trans":["n. Font; font; sanctuary (located in a church, often made of stone)"]},{"name":"know","trans":["vt. &vi. know, understand, know"]},{"name":"convert","trans":["v. Transform, make... change faith, invert n. Converts, converts"]},{"name":"global","trans":["adj. global, global"]},{"name":"installation","trans":["n. Installations, installations, military sites"]},{"name":"invoke","trans":["vt. Seek help, summon, request, apply, cause [computer] to call"]},{"name":"interactive","trans":["adj. interactive [computer] interactive"]},{"name":"century","trans":["n. Century, 100 years, hundreds of things"]},{"name":"literal","trans":["adj. Verbatim, literal, literal [computer] text"]},{"name":"rather","trans":["Adv. Rather, rather, some, quite, instead"]},{"name":"exclusive","trans":["adj. Exclusive, unique, exclusive; expensive, trendy [computer] mutually exclusive n. Exclusive news, exclusive"]},{"name":"marker","trans":["n. Markers, marking tools, marketers, scorekeepers"]},{"name":"wait","trans":["vt.& vi. wait; wait; hope (especially in the long term); hope vi. ready; at hand; available; can use vt. to postpone, set aside, delay"]},{"name":"appropriate","trans":["adj. Appropriate, commensurate vt. disburse (funds); use"]},{"name":"fit","trans":["adj. Appropriate, Right, Ready v. Suitable, Install n. Appropriate, Seizure, For a while"]},{"name":"adapter","trans":["n. Adapters n. Adapters"]},{"name":"filter","trans":["n. Filter, filter, color filter vt. &vi. filtering, penetrating [computer] filtering"]},{"name":"break","trans":["n. Rest, Break, Break v. Break, Break"]},{"name":"backward","trans":["adj. Backward adv. rearward"]},{"name":"searching","trans":["adj. The present participle of search is the verb to explore, to be insightful"]},{"name":"receive","trans":["vt. Receive, accept, greet, accept, suffer, believe vi. receive, obtain"]},{"name":"dual","trans":["adj. double, double n. Double"]},{"name":"retry","trans":["vt. retry"]},{"name":"normally","trans":["Adv. normally, normally"]},{"name":"exactly","trans":["adj. A complete adv. Exactly, exactly, correctly, accurately, exactly"]},{"name":"immediately","trans":["Adv. Conj immediately, directly. One... (Just)"]},{"name":"separated","trans":["adj. The past tense and past participle of separate verb separate"]},{"name":"high","trans":["adj. tall, slightly deteriorated, noble, serious, strong adv. high, good n. Highland, heaven, high air pressure, altitude, excitement"]},{"name":"equivalent","trans":["adj. equivalent, equal n. Equals"]},{"name":"light","trans":["n. Light, light, light, inspiration, as we all know, clear-eyed, vision adj. Light, unimportant, easy, bright, light-colored vi. Ignite, catch fire, brighten, dismount, fall, happen vt. Ignite, illuminate adv. Lightweight, lightweight"]},{"name":"zero","trans":["num. &n. zero"]},{"name":"storage","trans":["n. Storage, storage, storage, storage fees"]},{"name":"width","trans":["n. Width, breadth, material of a certain width"]},{"name":"language","trans":["n. Language"]},{"name":"startup","trans":["n. Start, go"]},{"name":"much","trans":["adj. Many advs. Very, very pron. &n. Many"]},{"name":"per","trans":["prep. Every, every adv. per person"]},{"name":"over","trans":["prep. (indicates direction) over; (partially or fully covered) above...; because; (indicates discussion) with respect to the end of adv.; again; (inverted); from side to side adj. past; outside; above; above; superior n.; additional; remaining (or excess) amount; remaining (or excess); remaining"]},{"name":"mirror","trans":["n. Mirror vt. reflection, reflection"]},{"name":"request","trans":["n. Request, request vt. request, request"]},{"name":"keypad","trans":["n. [computer] keypad"]},{"name":"keep","trans":["vt. Maintain; Retain; Comply; Prevent vi. (Food) Keep it new; keep it healthy n. Maintain, maintain; support, nurture; life, livelihood; feed; forage"]},{"name":"resident","trans":["adj. resident n. residents, travelers"]},{"name":"learning","trans":["n. Learn, learn the present participle of the verb learn"]},{"name":"talk","trans":["n. Talk, talk, talk vt. Talk, talk, discuss vi. Gossip, confession, open talk, small talk"]},{"name":"summary","trans":["n. Summary, summary adj. abridged, abridged"]},{"name":"well","trans":["n. Wells, wellsprings, stairwell adj. A healthy, good, suitable adv. Very well, appropriately vi. Gushing interj. OK, ah"]},{"name":"link","trans":["n. Links, links, rings (of chains), circles vt. &vi. connect, contact"]},{"name":"identify","trans":["v. identify, recognize; determine; engage; treat... as the same vi. confirm; agree"]},{"name":"pertain","trans":["vi. affiliation, about"]},{"name":"expansion","trans":["n. Expand, expand"]},{"name":"incompatible","trans":["adj. incompatible, incompatible, conflicting"]},{"name":"blinking","trans":["adj. flashing adj. Damn, nasty, present participle of the verb blink"]},{"name":"month","trans":["n. Month"]},{"name":"precede","trans":["vt. &vi. Before... better than, over..."]},{"name":"readily","trans":["Adv. without hesitation, quickly, easily"]},{"name":"transportable","trans":["portable computer, transportable"]},{"name":"routine","trans":["n. Routine, routine, boring adj. Routine, routine, tedious"]},{"name":"ready","trans":["adj. Ready, willing, ready made vt. Be prepared for..."]},{"name":"listing","trans":["[Computer] Inventory"]},{"name":"newly","trans":["Adv. Brand-new, Newly Reformed, with a New Method"]},{"name":"year","trans":["n. year; age; period of one year; students in a certain grade"]},{"name":"contact","trans":["v. Contact (with), (with) contact n. Contact, contact person"]},{"name":"session","trans":["n. Meeting, meeting; session (of a court); duration of session, semester; a period of time (carrying out an activity continuously)"]},{"name":"own","trans":["adj. My own, legitimate family's pron. Your own vi. Acknowledging VT. possess, acknowledge"]},{"name":"redraw","trans":["v. Redesignation"]},{"name":"here","trans":["adv. here; at this point; (say when giving something or pointing out something) n. here int. hey; hi"]},{"name":"manual","trans":["adj. Manual, physical strength n. Manuals, Guides, Keyboards"]},{"name":"particular","trans":["n. Individual projects, detailed description adj. special, unique; discerning; detailed"]},{"name":"rectangle","trans":["n. Rectangular, rectangular"]},{"name":"additive","trans":["n. Attachments (addition) adj. Added"]},{"name":"similar","trans":["adj. similar, similar, same"]},{"name":"assembly","trans":["n. Assemble, assemble"]},{"name":"copyright","trans":["adj. Copyright (s) n. Copyright, Copyright"]},{"name":"description","trans":["n. Description, description, instructions, drawing n. Type"]},{"name":"retrieve","trans":["vt. Recover, recover, remember, and make up vi. Retrieve prey n. Retrieve, recover"]},{"name":"mistake","trans":["n. Wrong, misunderstanding vt. Mistaken, misunderstood vi. erred"]},{"name":"produce","trans":["n. Products, crops vt. Produce, propose, cause, give birth, produce vi. Production, manufacture"]},{"name":"ram","trans":["abbr. random access memory (abbreviation for random access memory); random access memory (abbreviation for random-access memory) n. ram; hammer; impact device; warship with impact angle; (hydraulic press) [machine] piston v. impact; blockage; forced passage or acceptance"]},{"name":"exception","trans":["n. Exclude, exception"]},{"name":"digit","trans":["n. Numbers, digits, fingers"]},{"name":"reverse","trans":["n. Opposite; reverse; failure, frustration adj. opposite, reverse, reverse v. reverse, reverse"]},{"name":"minimum","trans":["adj. lowest, smallest n. Minimum quantity, minimum"]},{"name":"enough","trans":["adj. Enough adv. Enough n. Sufficient, enough pron. enough (of)"]},{"name":"although","trans":["conj. Although, although"]},{"name":"third","trans":["adj. Third (of) n. One-third num. third"]},{"name":"red","trans":["adj. red n. Red"]},{"name":"along","trans":["Adv. Move forward, (with someone) prep. along"]},{"name":"test","trans":["n. Test, test vt. Test, test, take tests, measure... adj. Tested"]},{"name":"small","trans":["adj. Small, less advs. Slightly n. Narrow part"]},{"name":"feed","trans":["vt. Feeding; satisfying (desires, etc.); providing to; making food vi. eating, eating...; infusing, injecting, entering (such as oil flowing into a machine); [electronics] feed n. Feed (especially coarse feed), fertilize; feed; feed; forage"]},{"name":"company","trans":["n. Companions, guests, groups, companies v. Companionship vi. jointed"]},{"name":"movie","trans":["n. Movies"]},{"name":"compile","trans":["v. Compile, edit, compile [computer] compilation"]},{"name":"frequently","trans":["Adv. often, frequently"]},{"name":"undefined","trans":["adj. undefined"]},{"name":"state","trans":["n. State, country, situation adj. National, state, official vt. Saying, stating, declaring, stipulating"]},{"name":"accept","trans":["vi. acknowledge; agree; accept v. accept; acknowledge; undertake; accept"]},{"name":"intense","trans":["adj. Extraordinary, intense, intense, passionate"]},{"name":"documentation","trans":["n. File"]},{"name":"asterisk","trans":["n. Asterisks (*)"]},{"name":"easily","trans":["adj. Easily, effortlessly adv. readily"]},{"name":"become","trans":["vt. Become vi. Being, becoming, experiencing change or development"]},{"name":"address","trans":["n. Address; Communications Office; Address; Title"]},{"name":"interface","trans":["n. Interface, contact surface vt. Connect, as an interface vi. joins"]},{"name":"pause","trans":["n. Suspension, suspension, indecision vi. Pause, abort vt. Pause"]},{"name":"repeat","trans":["n. Repeat, repeat vt. Repeat, repeat vi. Repeat adj. repetitive, repetitive"]},{"name":"restart","trans":["restarts"]},{"name":"assumed","trans":["adj. the past tense and past participle of the supposed, pretend verb assume"]},{"name":"speed","trans":["n. Speed, speed, light sensitivity, super speed vt. Accelerate, encourage, promote vi. speed up, speed up, progress"]},{"name":"entry","trans":["n. Entry, entry, registration, project"]},{"name":"combine","trans":["n. Group, Combine Harvester v. Merge, Combine, Union vi. Combined, united vt. unite, unite"]},{"name":"root","trans":["n. Root, root, ancestor vt. &vi. Rooted, rooted, scouted, originated in"]},{"name":"symbol","trans":["n. Symbols, signs, symbols"]},{"name":"binary","trans":["adj. binary, binary n. Binary, Binary"]},{"name":"whenever","trans":["Adv. No matter when conj. Whenever, no matter when, anytime"]},{"name":"reach","trans":["n. Extension, extent, river section vt. Reach, reach out, extend, get in touch vi. extending"]},{"name":"caution","trans":["n. Warnings, precautions, caution, eye-catching items or people vt. warns"]},{"name":"subtotal","trans":["n. Subtotal adj. Not quite"]},{"name":"card","trans":["n. Cards, cards, business cards, playing cards, program list vt. Attach or provide a card, print the card, list it on the card, check eligibility"]},{"name":"general","trans":["n. General, general, mostly adj. An ordinary, universal v. command, as... general"]},{"name":"associated","trans":["adj. joint, related"]},{"name":"transfer","trans":["n. Transfer, Transfer, Transfer v. Transfer, Transfer"]},{"name":"connect","trans":["vt. Connect, connect, make connections vi. connect, connect"]},{"name":"partition","trans":["n. Division, Isolation, Partition v. Distinction, Separation, Division"]},{"name":"hexadecimal","trans":["adj. hex, hex n. Hex"]},{"name":"generate","trans":["vt. generate, occur, cause [computer] to generate"]},{"name":"specification","trans":["n. Specifications, details, detailed instructions"]},{"name":"customize","trans":["vt. Customize [computer] Customize"]},{"name":"far","trans":["Adv. &adj. Far (place) n. Far away"]},{"name":"nest","trans":["n. Nest, nest vt. Embed vi. nesting"]},{"name":"duplicate","trans":["n. Copy, copy adj. Reproduced, double vt. Copy, repeat vi. Duplicate [computer] copy"]},{"name":"compression","trans":["n. Compression, compression, reduction"]},{"name":"unable","trans":["adj. No, no v. no, no, no"]},{"name":"means","trans":["n. Methods, means, compromises, material wealth"]},{"name":"intensity","trans":["n. Intense, intense, intense"]},{"name":"reading","trans":["adj. Reading n. Reading"]},{"name":"let","trans":["vt. Let, allow, release vi. rent, contract n. Obstacles, wipe tennis"]},{"name":"compare","trans":["vt. &vi. compare, compare, compare n. Compare, contrast"]},{"name":"sector","trans":["n. Sector, sector, region vt. zoning"]},{"name":"problem","trans":["adj. Problematic, difficult to deal with n. Problems"]},{"name":"backspace","trans":["vi. Press backspace n. Backspace"]},{"name":"terminate","trans":["adj. There is an ending, limited vt. End, termination, expiration vi. Reach the end"]},{"name":"people","trans":["n. Nation, people, people, people, family vt. populating"]},{"name":"short","trans":["adj. short, short, short n. shorts adv. briefly; suddenly"]},{"name":"drag","trans":["n. Things used to drag, drag, drag vt. Drag, drag (move) vi. drag (move), walk slowly"]},{"name":"preview","trans":["n. Pre-review, review, preview vt. Check in advance, review, preview"]},{"name":"underscore","trans":["vt. Underline, emphasize, provide accompaniment n. Underline, film accompaniment"]},{"name":"correctly","trans":["adv. aptly, correctly"]},{"name":"initially","trans":["Adv. Initially, at the beginning"]},{"name":"reformat","trans":["vt. reformat, reformat"]},{"name":"inside","trans":["adj. The adv inside. Inside n. Internal prep. Inside the..."]},{"name":"integrate","trans":["v. Integrate, make... a whole"]},{"name":"controlled","trans":["adj. The past tense and past participle forms of the controlled, bound verb control"]},{"name":"period","trans":["n. Credit hours, class hours; period, period; end"]},{"name":"huge","trans":["adj. huge, to a high degree"]},{"name":"determined","trans":["adj. Persevering, determined"]},{"name":"trailing","trans":["adj. n. Present participle of the trailing verb trail of traction"]},{"name":"seek","trans":["n. Seek v. Seek, seek, search"]},{"name":"introduction","trans":["n. Introduction, introduction, introduction, preface"]},{"name":"indent","trans":["n. Contract, Order Form v. Cut to a serrated shape, indent, order [computer] indent, indent"]},{"name":"base","trans":["n. Foundation, foundation (support, income, strength, etc.) vt. Use... as a base adj. despicable; immoral"]},{"name":"integer","trans":["n. Complete thing, whole, integer [computer] integer"]},{"name":"attempt","trans":["vt. try; try n. attack; try, impact"]},{"name":"twice","trans":["Adv. Twice, twice"]},{"name":"formed","trans":["adj. Past tense and past participle of the formative verb form"]},{"name":"subscript","trans":["n. Subscript adj. Write it down below"]},{"name":"tiny","trans":["adj. Extremely small, tiny"]},{"name":"model","trans":["n. Model, model adj. Exemplary, used as a model v. Model, shape, imitate"]},{"name":"correction","trans":["n. Where revisions, corrections are made"]},{"name":"rating","trans":["n. Ratings, ratings, ratings"]},{"name":"secondary","trans":["adj. Intermediate, moderate, secondary n. Secondary position, deputy"]},{"name":"limit","trans":["n. Limits; Limits, Limits; Limits vt.Limits, Limitations"]},{"name":"sun","trans":["n. Sun, sunshine, central figure, something like the sun vt.& vi. Bask in the sun"]},{"name":"translate","trans":["vt. Translate; transform; explain; transform into; transfer vi. translator"]},{"name":"reason","trans":["n. Reason, reason, reason vt. Convince, summarize vi. Exhort, make judgments"]},{"name":"colon","trans":["n. Colon, colon (monetary unit of Costa Rica and El Salvador) (Colon) Colon (city of Port Panama)"]},{"name":"avoid","trans":["v. Avoid vt. avoid, evade"]},{"name":"range","trans":["n. Range; range; category; arrangement (of mountains, houses, etc.) vi. search; change; extension; roaming vt.; sort (in a certain position or order); classify...; wander around adj. ranches, grazing areas"]},{"name":"allocate","trans":["v. Allocations, allocations"]},{"name":"simply","trans":["Adv. &adj. Simply, just"]},{"name":"verify","trans":["v. Verify and verify n. [Computer] DOS command: Turn on and off the file writing check switch during DOS operation"]},{"name":"manner","trans":["n. Look, manners, style, manner"]},{"name":"direction","trans":["n. Direction, guidance, usage instructions, trends"]},{"name":"portion","trans":["n. Part, Part, Destiny v. Will... allocate, distribute"]},{"name":"emulator","trans":["n. Emulators"]},{"name":"successful","trans":["adj. successful, achieving the goal"]},{"name":"applied","trans":["adj. App v. Application, applicable vbl. apps"]},{"name":"sum","trans":["n. Total (total), amount, vertex, summary, amount of money vt. Total, summary vi. totals"]},{"name":"achieve","trans":["vt. Complete, achieve, achieve vi. Reaching the goal"]},{"name":"together","trans":["Adv. Adj together, together, in combination, simultaneously and in a coordinated manner. clear-headed, calm"]},{"name":"affect","trans":["vt. influence, effect, emotion"]},{"name":"delay","trans":["n. Delay, delay vt. Delay, delay vi. tarry"]},{"name":"free","trans":["adj. Free, generous, free vt. Release, release adv. freely, freely"]},{"name":"properly","trans":["Adv. Appropriately, fairly, of course"]},{"name":"kind","trans":["adj. benevolent, friendly n. Kind, essence"]},{"name":"splitting","trans":["explosive"]},{"name":"feature","trans":["n. Characteristics, appearance vt. Featured by... vi. plays an important role"]},{"name":"console","trans":["vt. Comfort, comfort n. Dashboard, console, (game) platform"]},{"name":"operate","trans":["vi. Operation, operation vt. It works, it works"]},{"name":"kernel","trans":["n. Core, center, essence [computer] core"]},{"name":"easy","trans":["adj. Easy, comfortable, and effortless adv. Slowly, carefully"]},{"name":"modifier","trans":["n. Person who made the correction, modifiers"]},{"name":"invalid","trans":["adj. invalid, disabled n. Patient, disabled vt. loss of health"]},{"name":"compiler","trans":["n. Editor, [computer] compiler, compiling programs"]},{"name":"dot","trans":["n. Small dots, small amounts, small things vt. Use small dots to decorate vi. Make a small dot mark [computer] dot"]},{"name":"beep","trans":["n. Beeping vt. Produce a sound (such as a horn) vi. Blow the horn and make a beep"]},{"name":"face","trans":["n. Face, look, face, surface vt. Facing, facing vi. Morning, Facing"]},{"name":"random","trans":["n. Any, any adj. Arbitrary, casual, random adv. randomly"]},{"name":"facility","trans":["n. Equipment; ease; ability; dexterity"]},{"name":"heading","trans":["n. Title, title, present participle of the heading verb head"]},{"name":"asynchronous","trans":["adj. asynchronous"]},{"name":"series","trans":["n. Series, continuous"]},{"name":"individual","trans":["adj. individual; unique n. Individual, individual"]},{"name":"explain","trans":["vt. &vi. explain, explain"]},{"name":"paste","trans":["n. Paste, paste, leaded glass vt. paste, cover, punch"]},{"name":"welcome","trans":["vt. Welcome; happy to accept adj. popular; pleasant; n. Expressing thanks, welcome, greet"]},{"name":"six","trans":["n. Six; six; six years old; six point num.six; six"]},{"name":"early","trans":["Adv. &adj. early"]},{"name":"wrap","trans":["vt. bag; wrap; wrap (or wrap, cover, etc.) with...; cover n. knee blanket, shawl, scarf, scarf, scarf, scarf, scarf, scarf, scarf, coat; wrapping paper; '' confidential vi. wrap, wrap (usually used in conjunction with over, around, etc.); wrap, wrap; wear (clothing, etc.)"]},{"name":"blue","trans":["adj. blue, depressed, melancholy, (woman) learned n. Blue vt. Make... blue vi. Turn blue"]},{"name":"queue","trans":["n. Queuing, long queuing v. queuing vi. Long queues"]},{"name":"interrupt","trans":["n. Interruption vt. Interrupt, hinder vi. Plug [computer] interrupted"]},{"name":"respect","trans":["n. Respect, respect; relationships, aspects vt. respect, respect; about, involve"]},{"name":"common","trans":["adj. common, ordinary, ordinary n. Civilians, ordinary, commons, parks"]},{"name":"hyphen","trans":["n. Hyphens v. Connect with hyphens"]},{"name":"serial","trans":["n. Sequence, serial adj. continuous, a series of"]},{"name":"loading","trans":["n. Loading, loading"]},{"name":"retain","trans":["vt. Keep, keep; remember"]},{"name":"setup","trans":["n. Equipment, organization, plans"]},{"name":"freeze","trans":["v. frozen, frozen, stiff"]},{"name":"intend","trans":["v. intention vt. want, plan, plan"]},{"name":"explanation","trans":["n. Explanation, explanation"]},{"name":"certain","trans":["adj. A certain pron. Some, certain, certain, unquestionably, are bound to happen"]},{"name":"zap","trans":["vt. Destroy and shoot vi. Move int quickly. Knock (indicates the sound of gunfire, etc.)"]},{"name":"archive","trans":["n. Archives, archives vt. filings"]},{"name":"negative","trans":["adj. Negative, negative, negative n. Negative, negative vt. negation"]},{"name":"image","trans":["n. Image, image, portrait, imagination, image vt. imagine, depict, reflect"]},{"name":"platform","trans":["n. Platform, platform, podium, altar, plan"]},{"name":"often","trans":["Adv. often"]},{"name":"signal","trans":["n. Signal, trigger, motivation vt. Send a signal, sign vi. Send a signal adj. salient"]},{"name":"CPU","trans":["abbr. [computer] central processing unit (= central processing unit)"]},{"name":"bit","trans":["n. A little bit, a small amount of n. Drill bit, horse chew, auxiliary coin n. Bit (binary information unit) v. Control"]},{"name":"fully","trans":["Adv. ten minutes, completely, all"]},{"name":"deactivate","trans":["vt. invalidate, inactivate, disband troops"]},{"name":"especially","trans":["Adv. special, especially"]},{"name":"usually","trans":["Adv. usual"]},{"name":"recommend","trans":["vt. Suggest, recommend, advise vt. make desirable, make popular"]},{"name":"maintain","trans":["vt. maintain; repair, maintain; insist; assertion"]},{"name":"important","trans":["adj. important, very impactful"]},{"name":"central","trans":["adj. central, basic, compromise, central n. Telephone communication, central office, center"]},{"name":"addition","trans":["n. Addition, addition, addition"]},{"name":"anytime","trans":["Adv. anytime; without exception"]},{"name":"analyst","trans":["n. Analysts"]},{"name":"false","trans":["adj. Unreal, false, artificial, fake, hypocritical adv. insincere, hypocritically"]},{"name":"black","trans":["adj. black (color); black race; dark n. black; black pigment; dark v. blackening; resistance; rejection; darkening"]},{"name":"gather","trans":["vt. collect; gather, gather; tighten, shrink; collect vi. gradually increase, accumulate n. gather; clothing folds"]},{"name":"cycle","trans":["n. Cycle, cycle, long term, circle, suite, bike, vt. Circumfering, biking vi. Make the loop"]},{"name":"relative","trans":["adj. Relative, comparable, related n. relatives, similar things, related things"]},{"name":"offer","trans":["n. Bid, proposal vt. Offer, bid; contribute, dedicate vi. propose; appear; propose"]},{"name":"ending","trans":["n. End, end"]},{"name":"rent","trans":["n. Rent v. Rent vi. Rent vt. rent, rent"]},{"name":"sentence","trans":["n. Sentence, opinion, sentence, sentence, proposition vt. adjudicate, adjudicate, suffer"]},{"name":"remember","trans":["vt. &vi. Remember, remember"]},{"name":"proper","trans":["adj. Appropriate, proper, proper, orderly"]},{"name":"design","trans":["vt.& vi. design; draw up vt. design; plan; attempt; resolve (do) n. design; pattern; structure; plan vi. design; design (for crafts, decoration projects, etc.); be a designer; idea"]},{"name":"examine","trans":["vt. examination, investigation; examination; medical examination; interrogation vi. examination; investigation"]},{"name":"initial","trans":["n. (word) initial adj. Beginning, initial, prefixed vt. The first letter of the signature is"]},{"name":"corrupt","trans":["adj. corrupt, depraved vt. Deteriorate..., bribe..., corrupt... vi. decay, depravity"]},{"name":"buy","trans":["n. Reasonable price, buy vt. Buy, trade, buy, accept vi. purchasing"]},{"name":"increase","trans":["v. Increase, improve n. Increase, enhance"]},{"name":"host","trans":["n. [computer] host; host, host; program host; hotel owner vt. act as host; host a banquet, host a program; entertain, be the host vi. be the host"]},{"name":"sample","trans":["n. Sample, specimen vt. sample, taste adj. Exemplary"]},{"name":"pending","trans":["adj. A pending, upcoming or upcoming prep. Until, while waiting..., during..."]},{"name":"divide","trans":["vt.& vi. division; division; separation; (making) differences n. watershed, dividing line; allocation"]},{"name":"boot","trans":["n. Boots, [English] car suitcase, kick, lock vt. Kick, wear boots, lock cars vi. Start (computer), install a brake device on the wheel (usually an illegally parked car), use, help"]},{"name":"hide","trans":["<口> <口>vt. hiding; hiding; hiding; hiding, covering vi. concealing; hiding; hiding; covering n. animal skin; life; human skin; hidden places (for watching wild animals)"]},{"name":"half","trans":["adj. Half, not quite adv. half n. half, half"]},{"name":"magenta","trans":["N.&adj. Fuchsia (dye)"]},{"name":"leading","trans":["n. Leadership, mentoring, lead board adj. The leading, main, previous VBL. Lead, lead, and bridge the gaps between [computer] lines with lead"]},{"name":"wrong","trans":["adj. Wrong, improper, abnormal adv. wrongly n. Wrong, unfair vt. hurt, defame, deceive, slander"]},{"name":"today","trans":["N.&adv. todays"]},{"name":"least","trans":["adj. The fewest, smallest n.&adv. least, smallest"]},{"name":"opposite","trans":["adj. Relative, opposite, opposite n. Opponent, antagonist, rival adv. Prep on the opposite side, in the opposite position. Across from..."]},{"name":"white","trans":["adj. white, white, pure, lucky n. white, caucasian"]},{"name":"override","trans":["vt. abandonment, disregard, supremacy, excessive burdening n. Commission given to agents, misuse [computer] abolition"]},{"name":"brown","trans":["adj. brown, brown n. brown, brown (surname) brown"]},{"name":"hex","trans":["v. Cast a spell, curse n. The person who cast the spell abbr. (=hexagon) hexagon abbr. (=) hex"]},{"name":"rest","trans":["n. Rest; Remaining Part; Support; Serenity, Tranquility vt.& vi. (Make) rest; (make) lean [support] vi. rest; rest; stop; reassure vt. rest; relax; sleep longer; make dependent"]},{"name":"damage","trans":["n. (pl.) indemnity, damage, destruction vt. damage, destruction"]},{"name":"instant","trans":["n. Immediate, instant adj. immediate, immediate"]},{"name":"reserved","trans":["v. Reservations (scheduled, postponed) adj. reserved (reserved, indifferent, silent)"]},{"name":"technology","trans":["n. Technology, technology (science)"]},{"name":"handle","trans":["n. Handle, handle vt. Trading, Handling, and Operations vi. Manipulate"]},{"name":"apply","trans":["vt. Apply, apply; paint vt. Focus on vi. application; relevant"]},{"name":"stand","trans":["n. Standing, stopping, stairs, stalls vi. Standing, located, stagnant vt. endure, stand"]},{"name":"payment","trans":["n. Payment, payment"]},{"name":"kilobyte","trans":["n. [total] kilobytes (1024 bytes)"]},{"name":"parenthesis","trans":["n. Brackets, interlude, interlude, pause"]},{"name":"scan","trans":["vt. Scan; browse; take a close look; investigate in detail; mark the pattern vi. scan; sweep n. Scan; browse; examine; take a close look"]},{"name":"developer","trans":["n. Developer, developer"]},{"name":"murder","trans":["n. Murder, dangerous goods vt. Murder, torture, damage vi. murders"]},{"name":"flush","trans":["n. Overflow, blush, vigorous, flush (especially flushing the toilet), sprouting suddenly, (cards) flush smoothly, clean [computer] flush vi. Red face, wash away, grow vigorously vt. Rinse with water, surprise (a flock of birds), fill... the old nest, and excite adj. Abundant, well-balanced, full adv. honestly, shyly"]},{"name":"unlock","trans":["vt. Turn it on, reveal it, let go"]},{"name":"movement","trans":["n. Activity, movement, movement"]},{"name":"consecutive","trans":["adj. continuous, consistent"]},{"name":"collection","trans":["n. Collections, collections, groups, collections"]},{"name":"front","trans":["n. Front; front; front of the body; front line adj. front; frontal; v. facing in front of the tongue; in front of...; in front of...; positive; leader"]},{"name":"prefix","trans":["n. Prefix vt. Add... as a prefix, put adj in front. Of the prefix"]},{"name":"carousel","trans":["n. Carousel, luggage conveyor (at the airport) = carrousel"]},{"name":"safety","trans":["n. Safety; Safety; Safe Place; Zhongwei Adj. Ensuring Safety"]},{"name":"static","trans":["n. Static electricity, electrostatic interference, noise, obstruction, criticism, adj. static, electrostatic, solid state"]},{"name":"fact","trans":["n. Fact, fact"]},{"name":"alter","trans":["v. Change"]},{"name":"track","trans":["n. Path, runway, track, trail; convention, routine v. tracking, tracking"]},{"name":"precedence","trans":["n. Priority, priority"]},{"name":"skeleton","trans":["n. Skeletons, outlines, bones, skinny people or animals, domestic clumsiness adj. skeletal"]},{"name":"log","trans":["n. Record, log, log, meter vt. Logging, cutting, recording, sailing, spending (time) vi. Logging"]},{"name":"star","trans":["n. Star, star v. Decorate with a star to become an actor"]},{"name":"hot","trans":["adj. Hot, passionate, spicy, sexy adv. Excited, quickly n. The highest temperature, hot thing"]},{"name":"replaceable","trans":["adj. replaceable, replaceable"]},{"name":"accessible","trans":["adj. accessible, accessible, accessible"]},{"name":"involve","trans":["vt. include, get involved, get involved, get involved, get involved"]},{"name":"configure","trans":["v. Placement"]},{"name":"question","trans":["n. Questions, Questions, and Disputes vt. Inquire, doubt vi. ASK QUESTIONS"]},{"name":"green","trans":["adj. green; unripe, young; immature; advocating environmental protection n. Green vegetables; green clothing; plants vi. greening to make environmental protection issues more important"]},{"name":"entirely","trans":["Adv. wholly"]},{"name":"helpful","trans":["adj. Helpful, helpful"]},{"name":"middle","trans":["n. Middle, middle; waist; center; middle adj. middle; middle; center; center; middle vt.; place... in the middle; fold... in half; place vi in the middle; fold in half"]},{"name":"declared","trans":["adj. the past tense and past participle of acknowledge, announce the verb declare"]},{"name":"compress","trans":["vt. compression, compression n. [medical] compress"]},{"name":"graphically","trans":["Adv. Use a chart to show the ground"]},{"name":"auto","trans":["n. autos=automobile automatic car pref. automatic, own"]},{"name":"automatic","trans":["n. Automatics, semi-automatic weapons adj. automatic, mechanical, semi-automated"]},{"name":"anywhere","trans":["Adv. Anywhere pron. any (one) place"]},{"name":"terminal","trans":["n. n. Terminal, end adj. terminal, late, fatal"]},{"name":"door","trans":["n. Door"]},{"name":"expire","trans":["vi. Expiration, invalidity, termination, discontinuation vt. exhales"]},{"name":"resolution","trans":["n. Determination; Resolution; Determination; Resolution"]},{"name":"local","trans":["adj. local, local, partial [computer] partial"]},{"name":"semicolon","trans":["n. Semicolon"]},{"name":"reread","trans":["vt. reread, reread"]},{"name":"overwrite","trans":["v. Rewrite, write too much, describe too much"]},{"name":"critical","trans":["adj. critical, fussy; dangerous, critical; decisive; [material] critical"]},{"name":"manager","trans":["n. Manager"]},{"name":"capability","trans":["n. Abilities, abilities, capacity"]},{"name":"affected","trans":["adj. Influenced; made-up; feigned vt. influence; pretend; move... (past tense and past participle of affect)"]},{"name":"border","trans":["n. Edge vt. Make the border of..., plus side"]},{"name":"cache","trans":["n. Computer high-speed buffer memory; storage; hidden place vt. Hide; hide vi. hide"]},{"name":"bell","trans":["n. Bells, bells, flower crowns, roars vt. Ring the bell so that it opens like a bell vi. Make a bell shape, open"]},{"name":"play","trans":["n. Games, play, scripts, contests, actions in matches, influence vt. &vi. play, play, play, tease, pretend"]},{"name":"quickly","trans":["Adv. fast, quick"]},{"name":"fastback","trans":["Quick return"]},{"name":"answer","trans":["vt.& vi. answer; answer; answer; adapt n. answer; answer; reaction; comparable person"]},{"name":"represent","trans":["vt. Manifest, represent, depict, represent vi. File an objection"]},{"name":"difference","trans":["n. Differences, differences vt. Make a difference"]},{"name":"project","trans":["n. Engineering, Project, Plan, Career v. Plan, Design, Expression v. Projection, Screening, Highlight"]},{"name":"physical","trans":["adj. physical, physical, material n. physical examination"]},{"name":"matter","trans":["n. Incident, substance, cause vi. It's related"]},{"name":"hercules","trans":["n. Heroic Heroes, Sumo Warriors, Warriors"]},{"name":"reduce","trans":["vt. conversion; constraint; make; make weak vi. lose weight; lose weight; [biology] (cell) meiosis; (liquid) concentrate to thicken"]},{"name":"publisher","trans":["n. Publishers, distributors"]},{"name":"trim","trans":["n. Neat, decorated, trimmed parts adj. A neat, well-balanced adv. Neatly vt. Repair, cut, equip, beat, defeat, and clean vi. Keep your balance and watch the wind to steer"]},{"name":"substitute","trans":["n. Substitutes, Substitutes v. Substitutes VI. (for) instead of vt. Use... instead of"]},{"name":"disabled","trans":["adj. incapacitated n. Disabled people"]},{"name":"recent","trans":["adj. recent, recent"]},{"name":"positive","trans":["adj. An affirmative, positive, absolute adj. positive, positive, positive"]},{"name":"upgrade","trans":["vt. improve (increase, concentrate, strengthen) n. improve (increase, concentrate, strengthen)"]},{"name":"instance","trans":["n. Examples, Examples; Situations; Requirements, Suggestions; [Law] Litigation Procedure vt. examples..."]},{"name":"happen","trans":["vi. happened, happened, happened by chance"]},{"name":"future","trans":["adj. future n. Future, future n. Futures"]},{"name":"midnight","trans":["n. Midnight, pitch black"]},{"name":"though","trans":["Adv. But, however, conj. Despite, although prep. BUT."]},{"name":"nor","trans":["conj. &adv. Nor, there is no [count] “or not”, “not or” abbr. Norman (= Norman) abbr. North (= North) abbr. Norway (= Norway) abbr. Norwegian (= Norwegian)"]},{"name":"mono","trans":["pref. It means “one” and “single” adj. (records, etc.) monophonic n. Monophonic records n. (=infectious mononucleosis) infectious mononucleosis"]},{"name":"slide","trans":["n. Slide, slide, avalanche, landslide, slide vt. Slide vi. slip, fall"]},{"name":"abort","trans":["v. Miscarriage, abortion"]},{"name":"jump","trans":["n. Jump, jump, rise vt. &vi. Jump, Surge, Surprise Jump"]},{"name":"toward","trans":["prep. For, about, close, close, towards, towards adj. promising, favorable, approaching"]},{"name":"throughout","trans":["Adv. Everywhere, prep from beginning to end. pervasive, pervasive"]},{"name":"via","trans":["prep. via"]},{"name":"among","trans":["prep. In the midst of..."]},{"name":"neither","trans":["adj. None, neither are ints. Both are not congruent. neither, neither"]},{"name":"layer","trans":["n. Layer, layer; film; [Plant] press; Placer, planner vt. stack... in layers; use the crimping method; root and reproduce; cut (hair) into different levels vi. form or divide into layers; [Plant] Rooting through the pressing method"]},{"name":"scatter","trans":["n. Dispersion, sporadic small amounts vt. Disperse, spread vi. dispersion, dissipation"]},{"name":"attention","trans":["n. Attention (strength), care, correction"]},{"name":"convention","trans":["n. Conferences; all participants; international conventions; practices, customs, rules"]},{"name":"conventional","trans":["adj. ordinary, common, habitual, routine"]},{"name":"tool","trans":["n. Tools, utensils, people used, printed patterns vt. Drive, process with tools, and print the pattern on vi. Driving, processing with tools"]},{"name":"processor","trans":["n. Processor, processor"]},{"name":"desktop","trans":["n. Desktop, desktop computer adj. Tabletop one, for use on a desk"]},{"name":"build","trans":["vt. &vi. Build, create, develop, gradually enhance n. physique, body"]},{"name":"development","trans":["n. Development, development zone, development"]},{"name":"exceed","trans":["vt. Exceed, overcome, exceed boundaries vi. precedence"]},{"name":"understand","trans":["vt. Understand, hear vi. Understand, trust, and show empathy"]},{"name":"horizontal","trans":["adj. horizontal, horizontal n. Horizontal line, horizontal surface"]},{"name":"meet","trans":["n. Rallies, contests, sports meetings adj. Appropriate, suitable vt. meet, introduce, experience, meet, deal with, satisfy, pay vi. meet, meet, confront, intersect"]},{"name":"protect","trans":["vt. Protect, insure vi. Providing protection"]},{"name":"reserve","trans":["n. Preparations, storage, alternatives n. Restraint, implication vt. Reserve, Reserve, Extend"]},{"name":"clock","trans":["n. Clock, timer"]},{"name":"manifest","trans":["n. Bill of lading, waybill, passenger list adj. Obviously, understood vt. show, prove, show"]},{"name":"safe","trans":["adj. secure n. safe"]},{"name":"disconnect","trans":["vt. Separate vi. Disconnect, disassemble"]},{"name":"clockwise","trans":["adj. Clockwise adv. in a clockwise direction"]},{"name":"eliminate","trans":["v. Remove, Exclude, Exclude [Computer] Eliminate"]},{"name":"actual","trans":["adj. actual, real"]},{"name":"declaration","trans":["n. Declarations, declarations"]},{"name":"probably","trans":["Adv. Probably, maybe"]},{"name":"ring","trans":["n. Ring, ring, ring, ring vt. Surround, hang bells vi. It sounds, echoes, and spirals in the air, forming a circle"]},{"name":"cover","trans":["n. Cover, cover, surface v. covering, involving, including"]},{"name":"indicator","trans":["n. Indicator, indicator [computer] indicator"]},{"name":"apple","trans":["n. Apple"]},{"name":"icon","trans":["n. Portrait, idol, symbol, pattern [computer] icon, pattern"]},{"name":"consideration","trans":["n. Consideration, consideration, respect, opinion"]},{"name":"skill","trans":["n. Skills, techniques"]},{"name":"picture","trans":["n. Pictures, photographs, views vt. Draw, describe, imagine"]},{"name":"layout","trans":["n. Layout, arrangement, design"]},{"name":"suggest","trans":["vt. Suggestions, Suggestions, Requests"]},{"name":"convenient","trans":["adj. convenient"]},{"name":"instruct","trans":["v. Teach, command, guide [computer] instructions"]},{"name":"appendix","trans":["n. Appendix, appendix"]},{"name":"medium","trans":["n. Media, method, medium adj. moderate, medium"]},{"name":"truncate","trans":["vt. Cut off the tip, shorten it, and cut the edge into a flat surface adj. Cut off the head, the shortened one, the truncated one"]},{"name":"inhibit","trans":["vt. &vi. ban, suppress [computer] ban"]},{"name":"nearly","trans":["Adv. Almost, almost"]},{"name":"warn","trans":["vt. WARN, ATTENTION, STAY AWAY vi. reminds"]},{"name":"underline","trans":["v. Underline..."]},{"name":"register","trans":["v. Records, registers, registrations n. Storage, records, registers n. (language) domain; ventilation control equipment"]},{"name":"stuff","trans":["n. Materials, raw materials, things n. Qualities, essences; waste vt. Fill up, fill"]},{"name":"exclude","trans":["vt. Exclude, Exclude, Reject [Computer] Exclude"]},{"name":"destroy","trans":["vt. &vi. destroy, destroy [computer] Undo"]},{"name":"calculation","trans":["n. Compute"]},{"name":"angle","trans":["n. Angle (degrees), corner vt. Oblique movement, change angle vi. fishing, seeking, changing angles n. (Angle) Anglos"]},{"name":"lexical","trans":["adj. Of a dictionary, of a statement"]},{"name":"decide","trans":["vt. &vi. Decide, make a choice"]},{"name":"trouble","trans":["n. Trouble, trouble, difficulty, glitch vt.& vi. trouble, trouble"]},{"name":"customer","trans":["n.Customer, guy"]},{"name":"port","trans":["n. Port; (meaning of the matter); interface (of a computer and other equipment); port side (of a ship, aircraft, etc.) vt. gun; turn left rudder vi. turn left side adj. port side, left side vt.& vi. turn the rudder (left), turn (rudder) to the left adv. to the port side, to the left"]},{"name":"discuss","trans":["vt. discussions"]},{"name":"segment","trans":["n. Part v. Part, segment, split vt. separation"]},{"name":"filing","trans":["n. File (collection of documents)"]},{"name":"market","trans":["n. Market, trade, marketing region vt. Trade on the market to get... listed vi. Buy and sell on the market"]},{"name":"valuable","trans":["adj. Valuable, valuable n. (pl.) valuables"]},{"name":"limited","trans":["adj. limited"]},{"name":"trying","trans":["vbl. Test, try adj. uncomfortable, exhausting, tiring"]},{"name":"heap","trans":["n. Heap, many, cumulative vt. Make a pile, fill up the [computer] stack"]},{"name":"grey","trans":["adj. gray n. Gray (s) v. becomes gray [=gray] vi. Turns gray"]},{"name":"permanently","trans":["Adv. perpetually"]},{"name":"accelerator","trans":["n. Accelerator, throttle, [chemical] accelerator, accelerator"]},{"name":"originally","trans":["Adv. Originally, it turned out, what was initially important"]},{"name":"ability","trans":["n.Talents, abilities"]},{"name":"internally","trans":["Adv. included, in the center"]},{"name":"derelict","trans":["adj. abandoned, unowned, derelict n. Abandoned, abandoned person, derelict person"]},{"name":"redirect","trans":["adj. Then directly v. re-import, re-send"]},{"name":"reside","trans":["v. Residence, residence, belonging"]},{"name":"header","trans":["n. Cover holder, ear cutter, top beam, header n. [body] header, diving position with head in the water n. [meter] header"]},{"name":"extra","trans":["adj. Additional advs. In particular n. Additional things, for an additional fee"]},{"name":"repeated","trans":["adj. repetitive, and the past tense and past participle of the verb repeat"]},{"name":"death","trans":["n. Death, death, death, destruction"]},{"name":"observe","trans":["v. Observe, observe, take note"]},{"name":"density","trans":["n. Intensity, density, transparency"]},{"name":"management","trans":["n. Management (layer), operation, processing"]},{"name":"environmental","trans":["adj. environmental"]},{"name":"surrounding","trans":["adj. n. Surrounding environment, surrounding things"]},{"name":"master","trans":["n. Owner, master, mother machine, adj. Master's, Major v. Conquer, Control, Mastery"]},{"name":"recursive","trans":["adj. recursive, cyclic"]},{"name":"trap","trans":["n. Traps, traps, dilemmas, two-wheeled lightweight carriages vt. &vi. Set traps, set traps"]},{"name":"dimensional","trans":["Adj. Spatial"]},{"name":"logic","trans":["n. Logic (science), logic, rational reasoning"]},{"name":"conjunction","trans":["n. Conjunctions, combinations, associations, simultaneous occurrence (of events, etc.)"]},{"name":"identical","trans":["adj. the same, the same"]},{"name":"advice","trans":["n. Advice, suggestion, advice"]},{"name":"meaning","trans":["n. Meaning, meaning, meaning adj. profoundly meaningful"]},{"name":"fall","trans":["n. Fall, Fall, Waterfall v. Fall, Fall"]},{"name":"interval","trans":["n. Interval, break time, (math) interval, (musical) interval"]},{"name":"compatibility","trans":["n. Harmonious coexistence and compatibility"]},{"name":"rule","trans":["n. Practice, Rules, Governance v. Adjudication, Domination, Domination vi. ruling, ruling vt. ruled"]},{"name":"flag","trans":["n. Flags, flags, signal flags vt. Hit the flag vi. Weakness to sagging, decline"]},{"name":"criterion","trans":["n. Standards, guidelines"]},{"name":"office","trans":["n. Office, position, affairs"]},{"name":"express","trans":["n. Express, express delivery, special adj. A rapid, clear, and direct adv. By express; purposely vt. express; express; extrude; express"]},{"name":"volume","trans":["n. Volume, Volume n. Volume, Book"]},{"name":"soft","trans":["adj. Soft, gentle, unintense, delicate, light adv. Softly, gently n. Soft things"]},{"name":"activity","trans":["n. Activities; Actions; Active"]},{"name":"odometer","trans":["n. Odometer"]},{"name":"phoenix","trans":["n. Phoenix, the bird of eternal life (immortality) introduced as rebirth"]},{"name":"obtain","trans":["vt. Get, get vi. universal, popular, present"]},{"name":"easel","trans":["n. Easels"]},{"name":"latter","trans":["adj. The one behind, the latter pron. &n. The latter"]},{"name":"decrease","trans":["n. Decrease (quantity), decrease vt.& vi. reduce, reduce"]},{"name":"mainframe","trans":["n. Mainframe, mainframe"]},{"name":"diacritical","trans":["adj. distinguishable = diacritic"]},{"name":"confidential","trans":["adj. Confidential, trustworthy, easy to trust"]},{"name":"trace","trans":["n. Traces, traces, trace vt. Trace, find the root cause, delineate vi. tracking"]},{"name":"division","trans":["n. Distinguish, separate, divide, companies, departments, divisions (in the military)"]},{"name":"regular","trans":["adj. regular, regular, tidy, formal"]},{"name":"implicit","trans":["adj. implied, blindly [computer] implicit"]},{"name":"mention","trans":["vt. Mention, talk; nomination praise n. Mention"]},{"name":"near","trans":["adj. Close, close, close, reluctant, direct, petty, approximate adv. Close, almost, close to prep. Close to vt. Closer, closer to vi. reaching"]},{"name":"fifth","trans":["num. Fifth n. one-fifth"]},{"name":"seven","trans":["num. seven"]},{"name":"whereas","trans":["conj. &adv. However, on the contrary"]},{"name":"review","trans":["n. Review, review, review vt. Review, review, review vi. WRITE A REVIEW"]},{"name":"transform","trans":["vt. Transform, transform vi. Change n. Transform"]},{"name":"align","trans":["vt. Make one line, make consistent, make alliances, adjust, arrange vi. Form a line"]},{"name":"yellow","trans":["adj. yellow n. yellow"]},{"name":"assist","trans":["n. Devices to help, assist, assist vt. help, assist vi. help, assist, attend"]},{"name":"finish","trans":["n. Finished, Finished, Finished, Perfect vt. Finished, got... how many places vi. end, finish"]},{"name":"micro","trans":["adj. Tiny n. microns (parts per million, micrometer)"]},{"name":"beyond","trans":["Adv. Further away, n. Far away, afterlife prep. surpass, surpass, and"]},{"name":"against","trans":["prep. oppose, rely on, violate, defend, compare, relative"]},{"name":"upon","trans":["prep. On..."]},{"name":"service","trans":["n. Service, civil service, service, serve, method of service vt. maintenance, maintenance"]},{"name":"little","trans":["adj. Small advs. No, a small amount n. Almost none (refers to quantity or extent, etc.)"]},{"name":"exhaust","trans":["n. Exhaust, exhaust device v. Exhaustion, exhaustion, exhaustion... [computer] eliminate"]},{"name":"choice","trans":["adj. Superior, selected n. Select, pick"]},{"name":"sounding","trans":["n. Detecting the depth of water, testing adj. present participle of the vocal, exaggerated verb sound"]},{"name":"develop","trans":["vt. Develop, develop, and wash photos vi. strides"]},{"name":"holding","trans":["n. Control, support, maintain vbl. hold, hold, hold"]},{"name":"alpha","trans":["n. The first letter of the Greek alphabet, initially beginning with adj. [Chemical] Alphabetical, dominant, primary, alphabetical"]},{"name":"constant","trans":["adj. regular, invariant n. constant, constant"]},{"name":"warranty","trans":["n. Warranties, assurances, basis"]},{"name":"stay","trans":["n. Stay, stop; rely, perseverance; support vt. Wait, hold on until the end vi. keep, stay, stay"]},{"name":"industry","trans":["n. Industry, industry, diligence, hard work"]},{"name":"trigger","trans":["vt. trigger, cause; trigger vi. Release the wrench n. Trigger; [electronic] trigger; skid maker"]},{"name":"lesson","trans":["n. Lessons, lessons vt. Give... lessons, lessons"]},{"name":"treat","trans":["v. Treatment, treatment, treatment, hospitality, treated as n. Hospitality, feast"]},{"name":"busy","trans":["adj. Busy, messy vt. Keep busy with vi. busy"]},{"name":"usage","trans":["n. Idioms, uses, uses"]},{"name":"difficult","trans":["adj. difficult, difficult to please (people), difficult to get along with"]},{"name":"failure","trans":["n. Failure, a failed person or thing"]},{"name":"communication","trans":["n. Communication, transportation"]},{"name":"building","trans":["n. Buildings"]},{"name":"ally","trans":["n. Allies, Allies vt. &vi. Alliances, alliances, alliances"]},{"name":"exclamation","trans":["n. Exclamations, exclamations"]},{"name":"turning","trans":["n. Rotation, rotation, steering"]},{"name":"whole","trans":["adj. whole, complete, undamaged, (human) fully developed n. All, normal circumstances adv. completely, uniformly"]},{"name":"parent","trans":["n. Parents, roots vt. &vi. nurture, produce"]},{"name":"connection","trans":["n. Connections, relationships, connections, relatives"]},{"name":"connectivity","trans":["n. [computer] connectivity"]},{"name":"translation","trans":["n. Translation, translation"]},{"name":"dynamic","trans":["adj. dynamic, (with) power, (with) force; energetic n. Power; mechanics"]},{"name":"foreground","trans":["n. Prospects, most prominent positions"]},{"name":"preserve","trans":["vt. Protection; preservation, preservation; pickled food; preservative treatment vi. preservation; preservation; preservation; preservative; prohibition of hunting n. preserves; protective equipment; prohibited hunting grounds; exclusive objects (or ranges)"]},{"name":"vice","trans":["n. Vices, evils, sins, flaws, vices, vices vt. Clamp the prep. Alternate, Vice, Next"]},{"name":"necessarily","trans":["Adv. Necessarily, necessarily, necessarily"]},{"name":"circle","trans":["n. Circles, social circles, circulation vt. &vi. surround, circle, surround"]},{"name":"differ","trans":["vi. Inconsistent, different (opinion)"]},{"name":"stationary","trans":["adj. immovable (stable) n. Fixtures (garrisons)"]},{"name":"extract","trans":["n. Extracts, essences, excerpts vt. Extraction, Extraction, Extraction, Selection [Computer] Extraction"]},{"name":"unrecognized","trans":["adj. unrecognized, unrecognized"]},{"name":"thereafter","trans":["Adv. Then, from then on"]},{"name":"inverse","trans":["adj. opposite, inverted n. The opposite, (mathematical) inverse function, reciprocal, negative"]},{"name":"spell","trans":["v. Spell, read slowly or effortlessly n. Charisma, mantra vt. Use a charm to calm (someone) n. A period of time, shift v. shift, rest"]},{"name":"limiting","trans":["adj. present participle of limit verb limit"]},{"name":"restructure","trans":["v. Change the structure, rebuild the structure"]},{"name":"delimit","trans":["vt. demarcation, demarcation"]},{"name":"pay","trans":["n. Payroll, Payments, and Compensation vt. Pay, pay, reimburse, give vi. Pay off debt, worth it, bear the consequences adj. Those that put in coins, those that ask for money"]},{"name":"separately","trans":["Adv. separately; separately; separately"]},{"name":"classify","trans":["v. Classification, classification, classification"]},{"name":"interfere","trans":["vi. obstruction, conflict, interference"]},{"name":"mind","trans":["n. Thoughts, ideas, minds, memories, vt. Be careful, pay attention, mind, take care vi. Pay attention, care"]},{"name":"individually","trans":["Adv. individually, individually, uniquely"]},{"name":"vertical","trans":["adj. vertical, vertex, longitudinal n. vertical object, vertical position"]},{"name":"undesirable","trans":["adj. unpopular, bad, undesired, hateful n. Unpopular person, bad person"]},{"name":"lot","trans":["Adv. Very, very pron. Lots n. Many, amounts, groups, draws, venues, destiny vt. allocation, division"]},{"name":"piece","trans":["n. Block, piece, chapter vt. repair, combine"]},{"name":"unavailable","trans":["adj. What you can't get, what's not available, what you can't use"]},{"name":"unlike","trans":["adj. A different, unsimilar prep. Unlike, and different from..."]},{"name":"sit","trans":["vt. Sit, take charge, meet, vi. Sit, sit n. Sit"]},{"name":"insufficient","trans":["adj. insufficient"]},{"name":"map","trans":["n. Map v. Map, draw a map of..., plan [computer] storage allocation map"]},{"name":"figure","trans":["n. Graphics, numbers, shapes; figures, shapes v. Arithmetic, thinking, understanding"]},{"name":"prepare","trans":["vt. preparation; preparation (meals); preparation; preparing (oneself) vt.& vi. to prepare, carry out all preparations; prepare; prepare; prepare; prepare; exercise (physical, etc.), train"]},{"name":"consider","trans":["vt. consider, think, think"]},{"name":"detect","trans":["vt. Discovery, detection of information, reconnaissance vi. Be a detective"]},{"name":"convenience","trans":["n. Appropriate, convenient, convenient, convenient time, comfort"]},{"name":"method","trans":["n. Method, approach, rationale"]},{"name":"mean","trans":["n. Average value, average number; middle adj. Poor, mean; mean; stingy adj. Average, moderate v. meaning, desire, motivation"]},{"name":"salary","trans":["n. Salary vt. Give... a salary"]},{"name":"pacific","trans":["adj. Pacific, (Pacific) A peace-loving, peace-seeking, and conciliatory n. Pacific"]},{"name":"strong","trans":["adj. Strong, firm, firm, strong, intense, strong"]},{"name":"emphasize","trans":["v. Emphasize, focus on vt. underscoring"]},{"name":"department","trans":["n. Department, Department"]},{"name":"forced","trans":["adj. The past tense (participle) of forced, forced, forcible, unnatural force"]},{"name":"ANSI","trans":["abbr. American National Standards Institute (American National Standards Institute)"]},{"name":"permanent","trans":["adj. permanent, long-lasting n. (oral) perm"]},{"name":"remark","trans":["n. Remarks, comments, notes vt. Comments, notes, mentions"]},{"name":"away","trans":["Adv. stay away, leave, go out, continuously, far away"]},{"name":"concatenate","trans":["v. link, chain adj. Chained"]},{"name":"lightning","trans":["n. Lightning adj. Lightning-fast, vi. flash"]},{"name":"additionally","trans":["Adv. Also (plus, again)"]},{"name":"emulate","trans":["vt. Follow the example, do your best to catch up, simulate [computer] simulation"]},{"name":"tape","trans":["n. Video tape, audio tape, tape vt. Tie it up with a tape and record for... vi. taping"]},{"name":"concept","trans":["n. Concepts, ideas"]},{"name":"optimize","trans":["v. make... perfect, be optimistic, make... perfect v. optimize"]},{"name":"counter","trans":["n. Calculator, calculator, counter [computer] counter adj. The opposite adv. Contrary to... vt. Oppose, fight back vi. oppose, fight back"]},{"name":"expect","trans":["vt. Expecting; Anticipating; Requiring; Thinking (Something) Will Happen vi. Expecting; Expecting; Conceiving; Pregnancy"]},{"name":"subsequently","trans":["Adv. later, then"]},{"name":"registration","trans":["n. Registration, registration"]},{"name":"city","trans":["n. Cities"]},{"name":"designate","trans":["adj. The specified vt. designate, select, indicate"]},{"name":"visible","trans":["adj. visible, visible"]},{"name":"consult","trans":["v. Discuss, ask... for advice, check"]},{"name":"completely","trans":["Adv. completely, completely, not at all"]},{"name":"virtually","trans":["Adv. Almost, actually"]},{"name":"substantially","trans":["Adv. Essentially, essentially, broadly"]},{"name":"specialize","trans":["vi. specialization; specialization; detailed description; specialization v. specialization; adaptation to special situations; detailed description; enumeration"]},{"name":"fail","trans":["vi. Recession, failure, failure vt. Disappointed, lacking, failed to do n. Fail"]},{"name":"primarily","trans":["Adv. First of all, mainly"]},{"name":"client","trans":["n. Customers; parties; litigation clients; [computer] clients"]},{"name":"runtime","trans":["[Meter] Running time"]},{"name":"fix","trans":["vt. &vi. fix... fix, repair, prepare n. Situations (of ships, planes, etc.), bribe"]},{"name":"author","trans":["n. Author, creator vt. create, write"]},{"name":"programmer","trans":["n. Programmer, Program Planner, Program Arranger = Programer (English)"]},{"name":"commercial","trans":["adj. commercial n. Commercial advertising"]},{"name":"particularly","trans":["Adv. special, especially"]},{"name":"low","trans":["n. Low, low point (price), depth, bullshouting adj. Low, depressed, lowly, vulgar, debilitating vi. Cow barking"]},{"name":"sheet","trans":["n. Sheets, sheets vt. Cover the sheet, spread it all over, and make a sheet vi. falling or flowing in pieces adj. flaky"]},{"name":"employee","trans":["n. Employees"]},{"name":"legal","trans":["adj. legal, lawful, statutory"]},{"name":"qualified","trans":["adj. Eligible vbl. Get Eligible"]},{"name":"context","trans":["n. Context, context"]},{"name":"involved","trans":["v. Involves (includes, pervasiveness, occupation, facilitation, multiplication) adj. Included (complex form)"]},{"name":"conditional","trans":["adj. conditional, supposed, hypothetical n. [term] conditional sentence"]},{"name":"halfway","trans":["adj. Halfway, imperfect adv. Halfway through, halfway"]},{"name":"oriented","trans":["adj. directed, targeted"]},{"name":"pair","trans":["n. Double, pair, vice vt.& vi. Make... pair up, pair up"]},{"name":"week","trans":["n. Week, week"]},{"name":"subroutine","trans":["n. [computer] subroutine"]},{"name":"manually","trans":["Adv. hand"]},{"name":"preset","trans":["vt. Pre-installed, pre-adjusted"]},{"name":"autoindex","trans":["adj. [Meter] Automatic indexing, automatic address change"]},{"name":"restrict","trans":["v. Limitations, Restraints"]},{"name":"performance","trans":["n. Performance; Acting; Performance; Execution"]},{"name":"showing","trans":["n. Show, show the present participle of the verb show"]},{"name":"ever","trans":["Adv. Once, forever, exactly"]},{"name":"distribution","trans":["n. Distribute, distribute, distribute"]},{"name":"denote","trans":["vt. symbolize, indicate"]},{"name":"cash","trans":["n. Cash vt. Cash out, pay in cash adj. Of cash"]},{"name":"repeatedly","trans":["Adv. repeatedly, over and over"]},{"name":"replicate","trans":["vt. &vi. fold, copy, mimic n. Same sample adj. The turning point"]},{"name":"mega","trans":["Trillion, million"]},{"name":"conform","trans":["vt. Be consistent, comply, and comply vi. Consistent, compliant"]},{"name":"rebuild","trans":["v. Reconstruct, reconstruct, rehabilitate"]},{"name":"certainty","trans":["n. Certainly, something true"]},{"name":"controller","trans":["n. Controllers, managers, accountants"]},{"name":"pseudo","trans":["adj. fake, impersonated"]},{"name":"manage","trans":["vt. manage, process, maintain, achieve, operate vi. manage, achieve"]},{"name":"administrator","trans":["n. Managers, Administrators"]},{"name":"ensemble","trans":["n. Overall, choral music, women's full costume"]},{"name":"bus","trans":["n. Buses"]},{"name":"allowable","trans":["adj. permitted, acknowledged"]},{"name":"restriction","trans":["n. Limitations, restrictions vi. As a result, occurs (as a result)"]},{"name":"height","trans":["n. Height, height, highest peak, extreme point"]},{"name":"remainder","trans":["n. Remains, other people, remnants vt. Cheap sale adj. residual"]},{"name":"traverse","trans":["n. Crossing, Yokogi v. Crossing, inscribed"]},{"name":"organization","trans":["n. Agency, organization adj. organized"]},{"name":"resulting","trans":["adj. as a result, which occurred as a result"]},{"name":"solution","trans":["n. Solution, Solution, Solution"]},{"name":"external","trans":["n. External adj. external, external, objective, superficial"]},{"name":"adequate","trans":["adj. Adequate, Adequate, Adequate, Competent"]},{"name":"vary","trans":["vt. Change, diversify vi. change, violation"]},{"name":"gap","trans":["n. Differences (opinions, personality, etc.), gaps, gaps vt. Manufacturing gap Gapu (one of the Fortune 500 companies, headquartered in the US, mainly engaged in clothing retail)"]},{"name":"indexing","trans":["n. Indices (indexing, indexing, transposition, conversion angle, shift, address change)"]},{"name":"board","trans":["n. Planks, decks, boards n. Meals; stage, actor's career; boat side vt. Boarding (airplanes, cars, boats, etc.); providing room and board for a fee; covering vi. partner"]},{"name":"package","trans":["n. Package, batch transaction vt. Pack..., sell..."]},{"name":"insertion","trans":["n. Insert, publish, insert"]},{"name":"intervene","trans":["vi. insertion, intervention, intervention, mediation [computer] intervention"]},{"name":"conflict","trans":["n. Conflict; Fighting; Mutual Interference; Contradiction vi. Conflict; Fighting; Conflict"]},{"name":"really","trans":["Adv. Really, really, actually"]},{"name":"overflow","trans":["n. Overflow, Overflow, Overflow v. Overflow, Overflow [Computer] Overflow"]},{"name":"charge","trans":["n. Charges, charges; care, liability vt. &vi sue, add crime, ask for price, credit, recharge, manage"]},{"name":"phone","trans":["n. Sound level, phone, headphone vt. &vi. telephoned"]},{"name":"virtual","trans":["adj. virtual; effective; substantial, factual"]},{"name":"compose","trans":["vt. Compose, write, compose, and calm vi. creations"]},{"name":"snapshot","trans":["n. Snapshot, impression"]},{"name":"sensitivity","trans":["n.Sensitive, sentimental, sensitive"]},{"name":"familiar","trans":["adj. Familiar, familiar, unscrupulous n. Acquaintance, someone familiar with something"]},{"name":"Mach","trans":["n. [matter] Mach (unit of velocity) n. Mach (Austrian physicist, psychologist, philosopher) abbr. machine (= machine)"]},{"name":"incorrect","trans":["adj. incorrect, wrong"]},{"name":"cut","trans":["n. Incision, cut, reduction, share, ablation, cut piece of meat vt. Cut, reduce, stop, trim vi. Cut, move quickly [computer] cut"]},{"name":"lowest","trans":["adj. lowest, bottom, smallest"]},{"name":"simple","trans":["adj. simple, innocent, naive, basic, pure n. civilians, mentally ill, herbs"]},{"name":"subsequent","trans":["adj. later, later"]},{"name":"compact","trans":["adj. Compact, compact, and simple v. makes full, makes simple"]},{"name":"plain","trans":["n. Plains, grasslands adj. Simple, flat, normal, homely adj. pure, unadulterated"]},{"name":"noted","trans":["adj. Past tense and past participle forms of the famous, prestigious verb note"]},{"name":"desirable","trans":["adj. worthy, satisfying, attractive n. Attractive person"]},{"name":"substitution","trans":["n. Proxy, replace, exchange"]},{"name":"consume","trans":["vt. Consume, destroy, eat, drink, squander vi. Extinguished lives, burned"]},{"name":"forget","trans":["vt. &vi. forget, ignore"]},{"name":"keyed","trans":["v. type vbl. type"]},{"name":"tornado","trans":["n. Hurricanes, cyclones, tornadoes"]},{"name":"quotation","trans":["n. 1. Quotes, Quotations 2. Quotations 3. Quotes"]},{"name":"parse","trans":["v.&n. grammatical analysis"]},{"name":"experience","trans":["n. Experience, experience vt. experience, experience"]},{"name":"manufacture","trans":["n. Product, manufacturing, manufacturing vt. Manufacturing, processing vi. Participate in manufacturing"]},{"name":"hundred","trans":["n. 100, 100 things adj. One hundred, one hundred"]},{"name":"thousand","trans":["adj. One thousand, one thousand"]},{"name":"twentieth","trans":["n. 1/20 num. &adj. twentieth"]},{"name":"understanding","trans":["n. Understanding, understanding, personal opinion, informal agreement, understanding, compassion, insight adj. sympathetic"]},{"name":"hand","trans":["n. Hand, grasp, assist vt. help, give adv. manually, artificially"]},{"name":"fancy","trans":["n. Imagination, fantasy, preferences, love adj. Imaginative, funky, ornately decorated, extravagant, technical vt. imagination, self-opinion, preference"]},{"name":"wide","trans":["adj. Broad, broad adv. large land, all land"]},{"name":"fine","trans":["n. Fines, fines, end vt. Penalty vi. purify, refine adj. A beautiful, high-quality, delicate, sunny, healthy, slender, flattering, and flamboyant adv. Exactly, appropriately"]},{"name":"worry","trans":["n. Worry, Worry, Distress vt. Make... annoy..., make... anxious, hold on to something and throw it or pull vi. Feeling distressed, feeling anxious"]},{"name":"quiet","trans":["n. Quiet, relaxed, calm adj. Quiet, still, serene adv. Quietly vt. &vi. Calm..., reassure..."]},{"name":"purge","trans":["n. Purification, elimination, laxative, purification vt. Purify, clear, get rid of vi. clear, defecate, diarrhea, become clean"]},{"name":"mod","trans":["abbr. (=modern) Modern, trendy abbr. (=modulus) modulus, absolute value"]},{"name":"numeral","trans":["adj. numeric, n. Number representing a number, number"]},{"name":"whichever","trans":["adj. No matter which one, no matter what pron. whichever"]},{"name":"purchase","trans":["n. Purchase, purchased item n. Fulcrum; hold tight, hold on vt. buy, win; lift (with device), move"]},{"name":"care","trans":["n. Caution, care, worry, prudence, anxiety factors vi. Care, care for, love vt. Mind you, hope abbr. =Cooperative for American Remittances to Europe Remittances to European Cooperatives"]},{"name":"watch","trans":["n. Watch, watch vt. Observe, monitor, watch, care, wait vi. pay attention, observe"]},{"name":"endeavor","trans":["n. Hard work, hard work, enterprising spirit vt. Work hard, do your best vi. attempt, seek"]},{"name":"mismatch","trans":["vt. Mismatched, mismatched n. Mismatched, mismatched"]},{"name":"printout","trans":["n. (computer) printout"]},{"name":"ellipsis","trans":["n. Omit"]},{"name":"ship","trans":["n. Ships, ships, crews, spaceships vt. Transport by boat, ride a boat, transport, enter water, work on a boat vi. Get on a boat, ship, transport, work on a boat"]},{"name":"British","trans":["adj. British n. British people, British English"]},{"name":"parallel","trans":["adj. parallel, identical, similar, parallel adv. Parallel n. Parallel lines (surfaces), analogues, contrast vt. Compared to, corresponded to, parallel to..."]},{"name":"custom","trans":["n. Customs, customs"]},{"name":"congratulation","trans":["n. Congratulations"]},{"name":"protection","trans":["n. Protection, defence"]},{"name":"glass","trans":["n. Glass, glassware, windows, (complex) glasses, lenses vt. Cover (or cover, surround)... with glass, and put glass on... to make it look like glass, reflect, reflect, examine vi. Become glassy and look at it with an optical instrument"]},{"name":"pattern","trans":["n. Patterns, models v. Decorated with patterns; imitation, imitation"]},{"name":"insure","trans":["vt. Insurance, make sure vi. Buy insurance"]},{"name":"factory","trans":["n. Factories, manufacturing sites"]},{"name":"implement","trans":["n. Tools, utensils; items that are tools vt. implement, implement; provide tools (or means) to..."]},{"name":"effort","trans":["n. Efforts, results of efforts"]},{"name":"worker","trans":["n. Workers, workers"]},{"name":"ampersand","trans":["n. and, & (symbol for and)"]},{"name":"deal","trans":["n. Transactions, Agreements, Quantities v. (, [delt]) Processing, Payback, Distribution"]},{"name":"power","trans":["n. Strength, power, electricity vt. Power supply, motivation, full speed ahead adj. Related to power, relating to power, power control"]},{"name":"difficulty","trans":["n. Difficulties, disputes, objections, trouble"]},{"name":"lose","trans":["vt. loss, loss, failure, getting rid of vi. lost, failed [computer] lost"]},{"name":"magic","trans":["adj. Magical, magical n. Magic, magic vt. Use magic (transformation, etc.)"]},{"name":"proprietary","trans":["adj. Patent, title n. Ownership, owner"]},{"name":"aware","trans":["adj. Knows, realizes"]},{"name":"numerous","trans":["adj. Many, many"]},{"name":"vowel","trans":["n.Vowels, vowels"]},{"name":"closely","trans":["Adv. Closely, Closely, Closely"]},{"name":"accuracy","trans":["n. Accuracy (sex), accuracy"]},{"name":"traditional","trans":["adj. traditional"]},{"name":"synchronization","trans":["n. Synchronize"]},{"name":"fragment","trans":["n. Fragments vt. &vi. Become Fragments [Computer] Fragments"]},{"name":"primary","trans":["n. Most important person adj. primary, initial, fundamental"]},{"name":"safely","trans":["Adv. safely"]},{"name":"habit","trans":["n. Habits, habits; hobbies vt. Get dressed"]},{"name":"comprise","trans":["vt. including, composing"]},{"name":"landler","trans":["n. Randler dance (folk dance from the Austrian countryside), Landler dance music"]},{"name":"absence","trans":["n. None; lacking; absent; inattentive"]},{"name":"revolutionize","trans":["vt. Revolutionize and completely transform vi. Change = revolutionise (English)"]},{"name":"constantly","trans":["Adv. constantly, often"]},{"name":"seldom","trans":["Adv. Very few adj. scant"]},{"name":"unfortunately","trans":["Adv. unluckingly"]},{"name":"expunge","trans":["v. Erase, delete, remove"]},{"name":"security","trans":["n. Safety; Guarantee, Guarantee; Protection, Protection; Marketable Securities adj. Safe, Secure, Confidential"]},{"name":"touch","trans":["n. Touch, touch, slight marks, modifications vt. Touch, eat, drink, touch, touch vi. contact, contact"]},{"name":"contrast","trans":["n. Contrast, contrast; difference; contrast, opposite; [photo] contrast"]},{"name":"invent","trans":["v. Inventions v. invent, create"]},{"name":"reflect","trans":["v. Reflect, reflect, blame"]},{"name":"undone","trans":["adj. The past participle of the unfinished, unfinished verb undo"]},{"name":"unshift","trans":["vi. Release the typewriter or keyboard's font change key"]},{"name":"complex","trans":["adj. complex n. complex"]},{"name":"complexity","trans":["n. Complexity, complexity, complicated things"]},{"name":"creation","trans":["n. Create, create"]},{"name":"unknown","trans":["adj. unknown, unfamous"]},{"name":"greatly","trans":["Adv. Very, very"]},{"name":"cost","trans":["n. Price, cost; cost, expense; sacrifice; [in plural] [legal] litigation costs vi. price is, cost; estimated cost v. cost; valuation; loss; cause effort"]},{"name":"degrade","trans":["vt. devalue; humiliate...; demote...; degrade... vi. demotion, reduction; degradation"]},{"name":"suggestion","trans":["n. Suggestions, Opinions, Signs, Suggestions, Associations"]},{"name":"real","trans":["adj. Practical, realistic, real, real adv. Very n. real thing, real"]},{"name":"experimentation","trans":["n. Experiments, tests"]},{"name":"experiment","trans":["n. Experiment, test, try vi. Do an experiment, try"]},{"name":"substantial","trans":["n. Important part, essence adj. Extensive, substantial, contentious"]},{"name":"solely","trans":["Adv. alone, alone"]},{"name":"announce","trans":["vi. announcing participation in the election campaign; when announcer vt. announces; statement; claim; teaser"]},{"name":"squeeze","trans":["n. Squeezing, small amounts squeezed out, commissions, financial constraints vt. Holding tight, squeezing, making the economy difficult vi. concessions, oppression, narrow victory"]},{"name":"distribute","trans":["vt. &vi. distribute, distribute"]},{"name":"negate","trans":["v. Deny, Deny, Dismiss"]},{"name":"capture","trans":["n. Catch, loot, catch vt. Catch, get, captivate"]},{"name":"father","trans":["n. Father, originator vt. Having children as a father vi. Take care like a father"]},{"name":"reinstate","trans":["v. Reinstatement (former position) vt. Reinstate the original position"]},{"name":"tutorial","trans":["n. Individual guidance adj. Individually guided"]},{"name":"nicety","trans":["n. Precise, discreet, fine, and subtle differences"]},{"name":"roll","trans":["vt.rotate; turn (eyeballs, etc.) left and right; (make) spin in place; roll vi. shake left and right; roll; start moving, start n. roster; roll over"]},{"name":"exponent","trans":["n. Advocates, Explainers, Models n. Index n. Experts, Masters, Adj. Explained"]},{"name":"exponential","trans":["adj. n. Index of exponents"]},{"name":"prefer","trans":["vt. prefer; promote, promote; give (creditor) priority; file (complaint) vi. prefer"]},{"name":"complicated","trans":["adj. complicated, difficult to understand"]},{"name":"reactivate","trans":["v. Reinvigorate and resume activities"]},{"name":"spread","trans":["n. Spread, stretch adj. Extended v. Dissemination, promotion, outreach"]},{"name":"synchronize","trans":["v. Make simultaneous, simultaneous"]},{"name":"formation","trans":["n. Structure, formation, formation"]},{"name":"widely","trans":["Adv. widely"]},{"name":"comma","trans":["n. Commas, pauses, intermittent n. Silver-patterned polygonal butterfly"]},{"name":"very","trans":["adj. A real, complete, own, simply, the same, special adv. Really, very"]},{"name":"unnecessary","trans":["adj. unnecessary, superfluous n. Unnecessary stuff"]},{"name":"unchanged","trans":["adj. invariant"]},{"name":"cross","trans":["n. Crosses, cross-shaped objects, crosses, crossroads adj. Angry, crossed vt. Remove the cross and draw a horizontal line on vi. Crossing Prep. Pass through"]},{"name":"yet","trans":["Adv. Also, still, immediately conj. Although, however"]},{"name":"slowly","trans":["adj. Slowly adv. slowly"]},{"name":"inexperienced","trans":["adj. inexperienced, unskilled"]},{"name":"unwanted","trans":["adj. unnecessary, idle"]},{"name":"unused","trans":["adj. Unused, unaccustomed"]},{"name":"unmarked","trans":["adj. unmarked, unnoticed"]},{"name":"nothing","trans":["Adv. Not at all. Pron someone or thing that is insignificant. Nothing"]},{"name":"chart","trans":["n. Chart vt. Make a chart"]},{"name":"dearly","trans":["Adv. Deeply, sincerely, and expensively"]},{"name":"extremely","trans":["Adv. Extremely, very"]},{"name":"hardly","trans":["Adv. hardly"]},{"name":"placement","trans":["n. Direction, location, job search, arrangement"]},{"name":"think","trans":["v. think; think; think; see vi. think; consider; imagine; recall adj. thoughtful; n. thought; thought for thought; idea"]},{"name":"technical","trans":["adj. Craftsmanship, technical"]},{"name":"idea","trans":["n.Idea, idea, idea"]},{"name":"stamp","trans":["n. Print, stamp, printer vt. Seal, stand still, put on a stamp"]},{"name":"equation","trans":["n. Equality, equation (formula), equilibrium"]},{"name":"smooth","trans":["adj. Smooth, smooth, peaceful, smooth, well-mixed vt. Smooths, polishes, comforts, and straightens (feathers) vi. Become smooth"]},{"name":"attached","trans":["adj. additional, fixed"]},{"name":"average","trans":["n. Average, average level adj. Average, normal, average vt. &vi. Take the average value and reach the average level"]},{"name":"quietly","trans":["adj. Silently, still adv. quietly, calmly"]},{"name":"discard","trans":["n. Lost cards, scrapped cards vt. Discard, throw away vi. Lost cards"]},{"name":"never","trans":["Adv. Never, never"]},{"name":"initiate","trans":["n. Founder adj. Newly joined vt. Start, Initiate, Enlighten, Introduce Join"]},{"name":"powerful","trans":["adj. powerful"]},{"name":"purpose","trans":["n. Purpose, intention; will, determination; topic vt. intention, determination"]},{"name":"regard","trans":["vt. think; watch; involve; respect vi. stare; pay attention n. stare; pay attention; respect; greet"]},{"name":"daily","trans":["adj. Daily, calculated by day, daily adv. Daily, daily n. Daily report, (duplicate) work sample"]},{"name":"possibly","trans":["Adv. Possibly, maybe"]},{"name":"potentially","trans":["Adv. potentially"]},{"name":"moreover","trans":["adv. furthermore; furthermore; and; at the same time"]},{"name":"American","trans":["adj. American, American n. American, American English"]},{"name":"guard","trans":["n. Guards, guards, guards, protection vt. &vi. Defend, guard, guard"]},{"name":"world","trans":["n.World (person), field, secular world"]},{"name":"independent","trans":["adj. independent, autonomous, private, unbiased n. Independents, non-partisans"]},{"name":"independently","trans":["adv. independently, independently"]},{"name":"continuously","trans":["adv. continuously, continuously"]},{"name":"shield","trans":["n. Shield, defensive object, shield-like object vt. protection, masking"]},{"name":"glance","trans":["vi. glare; glare; glare; pass, wipe; mention anything, touch n. Browse briefly; flash; skew, sweep"]},{"name":"happening","trans":["n. The present participle of the verb happen incidental"]},{"name":"transaction","trans":["n. Transactions, processing, processing"]},{"name":"emulation","trans":["n. Imitation, competition, imitation"]},{"name":"strike","trans":["n. Strike, Strike, Assault v. Strike, Strike, Incension"]},{"name":"dump","trans":["n. Garbage site, dumping site vt. Discard, sell, export vi. Plummeting, garbage disposal"]},{"name":"occasionally","trans":["Adv. occasionally"]},{"name":"tension","trans":["n. Tension, tension, tension vt. Tighten (wire, sail, etc.)"]},{"name":"probable","trans":["adj. Probable n. Probable"]},{"name":"talent","trans":["n.Talents, talents, talents"]},{"name":"financial","trans":["adj. financial, fiscal"]},{"name":"meter","trans":["n. Meters, rhythm, meter vt. Measure with a meter [measure, record]"]},{"name":"logged","trans":["adj. The past tense and past participle of the verb log, recorded in water, sawn into a log, heavy"]},{"name":"ware","trans":["n. Products, utensils, goods vt. Pay attention, be aware of adj. Knows, realizes"]},{"name":"disregard","trans":["n. Ignore, ignore vt. ignore, disregard"]},{"name":"waiting","trans":["n. Wait adj. present participle of the alternate verb wait"]},{"name":"preceding","trans":["adj. Ahead, Ahead"]},{"name":"comparison","trans":["n. Compare"]},{"name":"advanced","trans":["adj. advanced, advanced"]},{"name":"rate","trans":["n. Ratio, grade, price vt. Assess, think, rank; scold vi. popular, admired; scolded"]},{"name":"fly","trans":["n. Flies, two-winged insects, flying, elevating vt. &vi. fly, fly, run away, fly away, move abruptly"]},{"name":"programmable","trans":["adj. programmable"]},{"name":"definable","trans":["adj. definable, determinable"]},{"name":"readable","trans":["adj. An adj with easily recognizable handwriting. Readable, easy to read, relatable"]},{"name":"recoverable","trans":["adj. recoverable, retractable"]},{"name":"possibility","trans":["n. Possibility, possible things, potential value"]},{"name":"finisher","trans":["n. Last hitter in sports, finishing machine (finisher)"]},{"name":"applicable","trans":["adj. suitable, applicable"]},{"name":"printable","trans":["printable"]},{"name":"executable","trans":["adj. implemented, implemented"]},{"name":"essentially","trans":["Adv. Essentially, originally"]},{"name":"confuse","trans":["vt. Confused, embarrassed, confused"]},{"name":"familiarize","trans":["vt. Familiarize"]},{"name":"employe","trans":["(=employee) n. employee, employee"]},{"name":"suitable","trans":["adj. suitable, suitable"]},{"name":"generation","trans":["n. generation, generation"]},{"name":"quality","trans":["n. Qualities, traits, talents adj. High quality"]},{"name":"defective","trans":["adj. defective, deficient, incomplete variable verb n. defective person, incomplete variable verb"]},{"name":"interpretable","trans":["adj. explainable, translatable, judgable"]},{"name":"interest","trans":["n. Interests, hobbies, interest; shares vt. Make... interested"]},{"name":"fourscore","trans":["adj. N. 80 of eighty"]},{"name":"teach","trans":["vt. Teach, teach, teach, teach vi. Give guidance"]},{"name":"procedural","trans":["adj. N. police suspect works of procedure"]},{"name":"phrase","trans":["n. Phrases, idioms, personal style, phrases vt. Expressing words, dividing (music) into phrases (to play)"]},{"name":"specifically","trans":["Adv. specifically, unequivocally"]},{"name":"penalty","trans":["n. Penalties, punishments"]},{"name":"violate","trans":["vt. offense, blasphemy, interference, assault, rape"]},{"name":"indefinitely","trans":["Adv. infinitely (over a long period of time, infinitely)"]},{"name":"major","trans":["n. Major, adult, army major; giant adj. The main, many, most of the vi. majoring"]},{"name":"higher","trans":["adj. taller"]},{"name":"wise","trans":["adj. Wise, learned, wise, smart n. Way vt. Guide vi. Learn"]},{"name":"becoming","trans":["adj. present participle of the verb become suitable, appropriate, good-looking"]},{"name":"equally","trans":["Adv. equally, equally, equally"]},{"name":"enjoy","trans":["vt. &vi. enjoy, like"]},{"name":"forth","trans":["adv. forward, forward; naked, outward; [nonsense] get out, leave home prep. come from, leave from..."]},{"name":"disappear","trans":["vi. Vanishing, extinction vt. cause disappearance"]},{"name":"crop","trans":["n. Crop, harvest, group, flat head vt. Cut, prune, shorten, harvest, grow grains vi. Eat grass, grow grains"]},{"name":"diagonally","trans":["Adv. diagonally to ground, diagonally"]},{"name":"decision","trans":["n. Decision, determination"]},{"name":"effective","trans":["adj. effective, impactful"]},{"name":"significant","trans":["adj. meaningful, meaningful; significant; significant n. (complex) meaningful; sign"]},{"name":"avail","trans":["vi. Advantageous vt. Useful n. Benefit"]},{"name":"hang","trans":["vt. Hanging; (Being) Hanging; Hanging; Hanging; Hanging; Hanging; Attached, Relying; Suspended; Suspended (of Action); Purpose, Key Points; (Oral) Practice, Tips;"]},{"name":"craze","trans":["n. Fanaticism, pandemic, cracks (on the surface of ceramics, etc.) v. (making) mad, (causing) causing cracks"]},{"name":"consequently","trans":["Adv. So, therefore"]},{"name":"introduce","trans":["vt. introduce, introduce, adopt, propose, promote, put in"]},{"name":"team","trans":["n. Team, Group vt. Collaborative work vi. Form a team adj. The team's"]},{"name":"visual","trans":["adj. visual n. picture, image"]},{"name":"acknowledgment","trans":["n. Acknowledgement, acknowledgement, thanks = acknowledgement"]},{"name":"efficiently","trans":["adv. efficiently, effectively"]},{"name":"predict","trans":["v. Predict, prophesy, forecast"]},{"name":"anticipate","trans":["vt. Expectations, expectations; preemption, early use"]},{"name":"bypass","trans":["vt. Bypass, ignore n. Branch roads, bypass roads"]},{"name":"nature","trans":["n. Nature, natural state; nature, nature, nature; quality; personality; sex; essence"]},{"name":"natural","trans":["adj. natural; material; natural; natural; undone n. natural things; (born) idiots; [music] (organ, etc.) white keys"]},{"name":"grant","trans":["vt. Acknowledgement; Consent; Permit; Grant n. Grant; Grant; Grant (such as property, land grant, exclusive right, grant, grant, grant, etc.) vi. consent"]},{"name":"logarithm","trans":["n. [number] logarithm"]},{"name":"reload","trans":["v. Reload"]},{"name":"occupy","trans":["vt. occupy, occupy, advance"]},{"name":"photograph","trans":["n. Photo vi. Photography, photography vt. Take a picture of..."]},{"name":"resolve","trans":["n. Decision, determination, determination vt. Decision, Settlement, Separation, Voting vi. separation, decision"]},{"name":"unsafe","trans":["adj. unsafe, unstable, dangerous"]},{"name":"separator","trans":["n. Separator, separator"]},{"name":"hierarchical","trans":["adj. By grade"]},{"name":"assortment","trans":["n. Classification, coordination, and variety of items"]},{"name":"growing","trans":["adj. developed, expanded"]},{"name":"discussion","trans":["n. Discussion v. Discussion, Discussion"]},{"name":"alphabet","trans":["n. Alphabet, basic principles (elements), symbolic system"]},{"name":"scattered","trans":["adj. scattered, sparse"]},{"name":"eventually","trans":["Adv. finally, finally"]},{"name":"finally","trans":["Adv. finally, finally"]},{"name":"subgroup","trans":["n. Affiliated organizations"]},{"name":"superimpose","trans":["vt. Overlap (install, add)"]},{"name":"reorganization","trans":["n. Reorganization, reorganization, transformation"]},{"name":"rewrite","trans":["n. Rewrite, rewrite vt. Rewrite, rewrite vi. rewritten"]},{"name":"university","trans":["n.University"]},{"name":"deter","trans":["v. stop, make... give up"]},{"name":"pool","trans":["n. Reservoirs (pools), swimming pools, pool vi. Form a pond vt. Concentrate, accumulate"]},{"name":"moment","trans":["n. Moment, moment, accurate moment, very important moment, moment"]},{"name":"shut","trans":["adj. Closed, closed, surrounding vt. Close, prevent entry, confinement, close, stop, or interrupt vi. Close, stop, or abort n. Close"]},{"name":"closed","trans":["adj. closed, closed, past tense and past participle of the verb close"]},{"name":"respond","trans":["vi. &vt. Reply, respond, respond n. Arch column"]},{"name":"repeating","trans":["adj. present participle of the repetitive, repetitive verb repeat"]},{"name":"repetitive","trans":["adj. repeated"]},{"name":"reenter","trans":["v. Re-entry"]},{"name":"rearrange","trans":["Reorganize, reorder"]},{"name":"rectangular","trans":["adj. rectangular; right-angled"]},{"name":"tag","trans":["n. Labels, appendages, names, proverbs vt. Attach a signature, trailing, addition, accusation, link vi. follow, follow"]},{"name":"suppose","trans":["vt. assume; conjecture, speculate; think; let (used in a prayerful tone) vi. imagine, conjecture"]},{"name":"supposed","trans":["adj. imaginary, hypothetical"]},{"name":"operator","trans":["n. Operators, managers, technicians, operators"]},{"name":"masking","trans":["n. Present participle of masking verb mask"]},{"name":"price","trans":["n. Price, cost, value vt. Standard, List Price, Compare Prices"]},{"name":"demonstrate","trans":["vt. Demonstrating, Demonstrating, Proving vi. demonstrations"]},{"name":"importance","trans":["n. Significant, important"]},{"name":"pipe","trans":["n. Pipe, pipe, flute vt. Convey with a tube, load a pipe, play, speak loudly, copy the edge vi. Wind playing, screaming"]},{"name":"overall","trans":["adj. A total, whole-hearted, all-inclusive adv. Generally speaking, all n. Protective clothing, cover-ups"]},{"name":"turnkey","trans":["n. Prison guard, prison guard adj. Ready-to-use"]},{"name":"restricted","trans":["vt. limit, restraint adj. restricted, limited, confidential"]},{"name":"suspension","trans":["n. Suspension, Suspension, Pending, Suspension"]},{"name":"seamless","trans":["seamless"]},{"name":"clipper","trans":["n. Shears, big scissors, barber scissors n. (19th century) fast sailboat n. Fast horse"]},{"name":"unsigned","trans":["adj. unsigned, unsigned"]},{"name":"unformatted","trans":["adj. unformatted"]},{"name":"infinite","trans":["adj. infinity, infinity n. infinity"]},{"name":"useless","trans":["adj. useless, ineffective"]},{"name":"mountain","trans":["n. Mountains, mountain ranges, large numbers"]},{"name":"redundant","trans":["adj. superfluous, unemployed"]},{"name":"dependent","trans":["adj. dependent, dependent, overhanging n. recipient of financial aid"]},{"name":"background","trans":["n. Background, behind-the-scenes, voice vt. Providing background"]},{"name":"product","trans":["n. Product, outcome, product"]},{"name":"assignment","trans":["n. Assignments, homework, tasks, assigned (extracurricular) assignments; (assigned) tasks, delegated"]},{"name":"bad","trans":["adj. bad, unsatisfying, harmful, sick n. Bad person, bad thing"]},{"name":"declare","trans":["vt. &vi. Announcements, Declarations, Declarations"]},{"name":"adjust","trans":["vt. Adjust... to fit vi. adapts"]},{"name":"recognize","trans":["vt. recognize, acknowledge, recognize, be grateful"]},{"name":"route","trans":["n. Route, route, route vt. Send by route, change route"]},{"name":"respectively","trans":["Adv. separately, separately"]},{"name":"unsuccessful","trans":["adj. unsuccessful, unsuccessful"]},{"name":"received","trans":["adj. generally recognized, recognized"]},{"name":"navigate","trans":["vi. Sailing, driving, and manipulating vt. Sailing, driving"]},{"name":"considered","trans":["adj. considered, respected"]},{"name":"due","trans":["adj. due to; proper; reservation; due n. Entitlement; due; due; payables adv. positive; opposite"]},{"name":"recently","trans":["Adv. recently"]},{"name":"room","trans":["room, space"]},{"name":"descend","trans":["vt. &vi. surrender, transmission, advent"]},{"name":"contiguous","trans":["adj. proximate, in contact, continuous"]},{"name":"consistent","trans":["adj. Consistent, consistent, persistent"]},{"name":"multiprocessing","trans":["n. Multiple processing, multiple processing technology"]},{"name":"architecture","trans":["n. Architecture, construction industry, buildings, structures [general term] buildings, architectural styles"]},{"name":"structural","trans":["adj. structural, structural, architectural, architectural"]},{"name":"outcome","trans":["n. Results"]},{"name":"association","trans":["n. Unions, Combinations, Interactions, Associations, Associations, Associations"]},{"name":"opinion","trans":["n. Opinions, Opinions v. Judgments, Opinions, Claims"]},{"name":"interpret","trans":["v. Explanation, performance, translation [computer] explanation"]},{"name":"explanatory","trans":["adj. explained, explained"]},{"name":"assemble","trans":["vt. Gather, assemble, assemble vi. gather, gather"]},{"name":"assembler","trans":["n. Assembler n. [meter] assembly program"]},{"name":"cad","trans":["n. Despicable men, indecent people abbr. (=computer-aided design) computer-aided design"]},{"name":"arithmetic","trans":["n. Arithmetic"]},{"name":"representative","trans":["adj. representative, representative, typical n. representative, representative, typical"]},{"name":"typical","trans":["adj. typical, representative"]},{"name":"sufficient","trans":["adj. enough, enough"]},{"name":"blast","trans":["n. Explosion, shock wave, airflow, burst, sound of a whistle vi. It exploded, and suddenly made a noise vt. spray, blow up"]},{"name":"clean","trans":["adj. Clean, proper, pure, complete, accurate, empty adv. Completely n. Clean vt. &vi. cleaning, cleaning"]},{"name":"caret","trans":["n. Off-character symbol, (symbol: ^ is used as an interpolation in the article)"]},{"name":"socket","trans":["n. Sockets, sockets, holes vt. Mount or plug into an outlet"]},{"name":"stated","trans":["adj. Defined, fixed, regular v. statement, explanation vbl. statement, explanation"]},{"name":"protocol","trans":["n. Draft, agreement, protocol vt. Draft protocol"]},{"name":"presence","trans":["n. Attendance, attendance, conduct"]},{"name":"telephone","trans":["n. Telephone; telephone; microphone (of a telephone); receiver vt.& vi. transmits (messages) by phone, calls (someone); uses a telephone to talk to (someone)"]},{"name":"social","trans":["adj. social, communal, communal"]},{"name":"equipment","trans":["n. Equipment, equipment"]},{"name":"lending","trans":["n. Borrow, present participle of the verb lend to borrow"]},{"name":"book","trans":["n. Book, book vt. Registration, reservation vi. Book via..."]},{"name":"situation","trans":["n. Location, situation, situation, situation, position"]},{"name":"desk","trans":["n. Desk"]},{"name":"please","trans":["int. Please vt. Please, please, agree vi. Pleasure, Willing"]},{"name":"mixture","trans":["n.Mixture, mixture"]},{"name":"representation","trans":["n. Representation, performance, statement, defense"]},{"name":"esoteric","trans":["adj. Esoteric, mysterious, incomprehensible"]},{"name":"depth","trans":["n. Depth, intensity, sincerity"]},{"name":"final","trans":["adj. The final decided n. Finals, final exam"]},{"name":"physically","trans":["Adv. The body is above ground"]},{"name":"aid","trans":["n. Help, Ambulance, Support vt. &vi. aid, help, rescue abbr. =Agency for International Development Agency [US]"]},{"name":"successive","trans":["adj. one after another, one after another, one after another"]},{"name":"succession","trans":["n. Continuity, inheritance, succession"]},{"name":"unpack","trans":["vt. Open take out, remove"]},{"name":"chunk","trans":["n. Thick pieces (slices), a fairly large amount, a chunky person or thing vt. (Golf) Did not hit vi. Make a thunderous sound"]},{"name":"alignment","trans":["n. Queue, straight line; calibration; alliance"]},{"name":"typewriter","trans":["n. n. Typewriter"]},{"name":"big","trans":["adj. A big, important adv. In a solemn manner, a large number of n. Outstanding organizations and individuals"]},{"name":"tone","trans":["n. Tone, tone, quality, tone, tone vt. Make it stronger, put it in a pretentious way, set the tone, and tone it vi. Harmonize (color) to present a pleasing tone"]},{"name":"sensitive","trans":["adj. sensitive, sensitive, vulnerable, light-sensitive, empathetic n. Sensitive person"]},{"name":"reduction","trans":["n. Reduction, reduction, (chemical) reduction reaction, (mathematical) fraction"]},{"name":"indentation","trans":["n. Indentation, indentation, indentation (coastline, etc.)"]},{"name":"terminology","trans":["n. Terminology, terminology"]},{"name":"ascending","trans":["adj. rising"]},{"name":"augment","trans":["vt. increase, supplement vi. expand n. increase, supplement"]},{"name":"increment","trans":["n. Additions (additions, increments, margins)"]},{"name":"gain","trans":["n. Gain, gain, profit vt. Get, improve, profit vi. add, get, go (clock, watch, etc.) fast"]},{"name":"stream","trans":["n. (person, car, gas) flow, water flow, group vt. Outflow, flutter vi. It flows, it flutters, it comes one after another"]},{"name":"obsolete","trans":["adj. abandoned, out of date"]},{"name":"accommodate","trans":["vi. Adapt yourself to vt. make consistent; reconcile; provide convenience; accommodate; take into account"]},{"name":"motif","trans":["n. Themes, ideas, motivations"]},{"name":"subject","trans":["n. Subject, subject; reason n. (monarchy) nationals; test subjects adj. Submissive, susceptible vt. to belong, to obey; to cause suffering"]},{"name":"job","trans":["n. Jobs, responsibilities, tasks vt. Speculative trading, commercial fraud, unfair penalties, subcontracting of tasks vi. Work, fake public service, be a distributor or wholesaler adj. Work-related"]},{"name":"differentiate","trans":["vt. Identify, make differences, find derivatives, distinguish, and treat them differently vi. difference, variation"]},{"name":"distinction","trans":["n. Difference; Excellence; Honor"]},{"name":"distinguish","trans":["vt. Differentiate, identify, and pay special attention to vi. distinguishing"]},{"name":"locking","trans":["n. The present participle of the lock verb lock"]},{"name":"progress","trans":["n. Progress, development, progress vi. promote, advance, carry out"]},{"name":"fundamental","trans":["adj. basic, fundamental, important n. Fundamental principles, foundations"]},{"name":"basis","trans":["n. Foundation, basis, main components"]},{"name":"underlying","trans":["adj. Below, basic, implicit"]},{"name":"sound","trans":["vt. Listening (diagnosis); measuring, measuring... depth; vocalization; testing; declaring n. Sound, speech; noise; strait; noise; range of hearing; [medical] probe adj. Sound, healthy; reasonable; reliable; effective and thorough adv. Thoroughly and fully vi. Hearing; Making Sound; Resonance; Depth Measurement"]},{"name":"vital","trans":["adj. vital, life-or-death, energetic, vibrant"]},{"name":"national","trans":["adj. National, national n. Nationals"]},{"name":"sale","trans":["n. Sales (volume), sale at reduced price"]},{"name":"agree","trans":["vt. Agree, Agree, Acknowledge vi. agree, agree, comply"]},{"name":"iterative","trans":["adj. iterative, repetitive"]},{"name":"inclusive","trans":["adj. Including..., covering a wide range of things, including endpoints [computers] including"]},{"name":"charm","trans":["n. Magic, charm, amulets, trinkets vt. attract, fascinate..., and cast magic on..."]},{"name":"hit","trans":["n. Hit (hit), impact, irony, success. One dose of drug, number of clicks vt. Hit (hit), collision, incidental discovery, requirements, conform to vi. strike (hit), attack, reach"]},{"name":"course","trans":["n. Course, lecture, process, route, course (dish)"]},{"name":"numerical","trans":["adj. numeric, expressed in numbers"]},{"name":"digital","trans":["adj. finger, digital, digital, electronic"]},{"name":"combo","trans":["Package, combination"]},{"name":"cord","trans":["n. Rope, restraint vt. Tied with a rope"]},{"name":"organise","trans":["VT. Organization, Founding"]},{"name":"permit","trans":["n. Permits, licenses vt. &vi. allow, license"]},{"name":"still","trans":["adj. A static, immobile, silent adv. Still, more, still conj. However, but vi. Be silent vt. calm down, grab, stop, relax n. Silence, stop photography, winery"]},{"name":"explicit","trans":["adj. clear, detailed, clear, external"]},{"name":"elapse","trans":["v. Passed away, past"]},{"name":"accidental","trans":["adj. Accidental, incidental, ancillary n. Accidental, unimportant thing, temporary symbol that changes tone"]},{"name":"sequential","trans":["adj. Continuous (sequential)"]},{"name":"indirect","trans":["adj. indirect, circumstantial, secondary, dishonest, deceptive"]},{"name":"reappear","trans":["vi. Appear again"]},{"name":"circumstance","trans":["n. Environment, (plural) circumstances, events, details"]},{"name":"mix","trans":["n. Mixing (matter), fusion vt. &vi. Blending, Blending, Synthesizing, Interacting, Connecting [Computer] Blending"]},{"name":"suppress","trans":["vt. suppress, make... stop, ban"]},{"name":"E","trans":["n. Letter E"]},{"name":"recognition","trans":["n. Recognize, Perceive, Know"]},{"name":"arm","trans":["n. Arms, harbors, narrow strips, armrests, sleeves, guns vt. Equipment, preparation (bomb) vi. Arm yourself"]},{"name":"alphanumeric","trans":["adj. alphanumeric"]},{"name":"analog","trans":["n. (=analogue) similar (analog quantity) adj. analogical, simulated"]},{"name":"automation","trans":["n. Automation"]},{"name":"band","trans":["n. Band; hoop, band, band vt. &vi. Unite, combine"]},{"name":"batch","trans":["n. Bread baked at one time, the amount made at a time, one group, batch, batch vi. batch processing"]},{"name":"brush","trans":["n. Brushes, brushes, light scrubs, skirmishes, bushes vt. Use a brush to clean, paint, wipe, and blow vi. Rub lightly, whisk"]},{"name":"calculator","trans":["n. Calculator"]},{"name":"punch","trans":["n. Hole puncher, drilling machine, beating n. Cocktails made from alcohol, water, sugar, etc. vt. Hit hard with a fist, open a hole, cut a ticket, press (key)"]},{"name":"reader","trans":["n. Readers, Books"]},{"name":"cell","trans":["n. Cell, battery, small room, single cell, nest (hive), cell phone"]},{"name":"channel","trans":["n. Channel, Channel, Strait, Method vt. guide, enlighten, form rivers, transport"]},{"name":"circuit","trans":["n. Circuit, one round, circuit vt. &vi. patrol"]},{"name":"to","trans":["prep. (indicates direction) to, to; (indicates an indirect relationship) to give; away, for, for adv. (Indicate direction) Go, (Door) Close"]},{"name":"coder","trans":["n. Encoder"]},{"name":"unit","trans":["n. Units, units"]},{"name":"core","trans":["n. Center, core, essence; fruit core, fruit core; [geology] earth core; [measurement] magnetic core v. remove (fruit) core, dig out... core; extract rock core (sample)"]},{"name":"cybernetics","trans":["n. Cybernetics"]},{"name":"disc","trans":["n. Disc, [electronic] record (equal to disk) vt. Fill in the record"]},{"name":"drum","trans":["n. Drums, drum sounds, drum shapes, ice dunes vi. Hit the drums, make the sound of drums, arouse interest vt. Recruit the military, expel them, push (after hard work)..., hit continuously"]},{"name":"electronics","trans":["n. Electronics, electronic devices"]},{"name":"emitter","trans":["n. Launcher"]},{"name":"encode","trans":["vt. coding, decoding"]},{"name":"feedback","trans":["n. Feedback, Outcomes"]},{"name":"flow","trans":["vi. flow; flow; flow out; (conversation, style, etc.) smooth n. Flow; endless talk; high tide; consistent vt. flood; submerge; discharge"]},{"name":"frame","trans":["n. Frame, structure, skeleton v. composition, frame... and frame adj. Timber structured"]},{"name":"identifier","trans":["n. Identifiers"]},{"name":"inquiry","trans":["n. Inquire, Inquire, Investigate, Inquire = enquiry (English)"]},{"name":"integrated","trans":["adj. Integrated, comprehensive vt. &vi. integrate (past tense and past participle of integrate)"]},{"name":"latency","trans":["n. Latent, potential"]},{"name":"linkage","trans":["n. Union, chain, combine"]},{"name":"logger","trans":["n. Lumberjack, recorder, register"]},{"name":"magnetic","trans":["adj. magnetic, attractive, hypnotic"]},{"name":"matrix","trans":["n. Maternal body, uterine aneurysm, letter n. Matrix"]},{"name":"microcomputer","trans":["n. Microcomputer [computer] Microcomputer"]},{"name":"nanosecond","trans":["n. Nanoseconds, very short time"]},{"name":"octet","trans":["n. [sound] octet, octet n. 8-bit group"]},{"name":"optical","trans":["adj. ocular, visual, optical"]},{"name":"panel","trans":["n. Paneling; surface; panel (on doors, walls, etc.); control board vt. Selection (jury); dividing...; placing saddle pads on...; mounting... into frames"]},{"name":"perforator","trans":["n. Perforator, Piercer"]},{"name":"peripheral","trans":["adj. Not important, peripheral n. Peripherals"]},{"name":"pulse","trans":["n. Pulse, pulse, pulse vt. &vi. beating, pulse"]},{"name":"redundancy","trans":["n. Redundancy, backup, extra information"]},{"name":"selector","trans":["n. Pickers, selectors"]},{"name":"sentinel","trans":["n. Sentinels (tagging, teleporting) vt sentry (guarding)"]},{"name":"simulation","trans":["n. Simulation, counterfeit"]},{"name":"simulator","trans":["simulation program"]},{"name":"sorter","trans":["n. People engaged in sorting, people who sort and select things"]},{"name":"symbolic","trans":["n. Code name adj. symbolic, symbolic"]},{"name":"tabulator","trans":["n. Watchmaker, Watchmaker, Jump Bar"]},{"name":"teleprinter","trans":["n. Telefax printer"]},{"name":"timer","trans":["n. Timekeeper, timer, stopwatch"]},{"name":"timing","trans":["n. Time management (arrangement, coordination)"]},{"name":"transducer","trans":["n. Converters, sensors"]},{"name":"translator","trans":["n. Translators"]},{"name":"Winchester","trans":["n. Winchester (city in southern England)"]},{"name":"multimedia","trans":["adj. Multimedia n. Multimedia"]},{"name":"pentium","trans":["CPU chip manufactured by Intel, translated as “Pentium” in Chinese"]},{"name":"kilo","trans":["pref. Display “thousand” abbr. kg, kg (=kilogram/kilogramme)"]},{"name":"giga","trans":["pref. Gigabit"]},{"name":"bracketed","trans":["square brackets; brackets; brackets"]},{"name":"debugger","trans":["debugger"]}]