[{"name":"bushy","trans":["adj. dense; shrubby; hairy"],"usphone":"ˈbʊʃi","ukphone":"ˈbʊʃi"},{"name":"fox","trans":["n. Fox; cunning person; fox skin; vixen, sexy woman v. Can't guess; deceive, confuse; use cunning methods n. (Fox) (England, America, Germany, Dan, Love) Fox (name of person)"],"usphone":"fɒks","ukphone":"fɒks"},{"name":"fur","trans":["n. Leather, leather; fur; soft fur n. Scale vt. Cover with fur; make people wear fur clothing n. (Fur) name; (France) Phil; (Sweden) Fur"],"usphone":"fɜː(r)","ukphone":"fɜː(r)"},{"name":"hunter","trans":["n. Hunters; Hounds; Searchers"],"usphone":"ˈhʌntə(r)","ukphone":"ˈhʌntə(r)"},{"name":"mammal","trans":["n. [Spine] mammals"],"usphone":"ˈmæml","ukphone":"ˈmæml"},{"name":"pointy","trans":["adj. sharp; very sharp"],"usphone":"ˈpɔɪnti","ukphone":"ˈpɔɪnti"},{"name":"amazing","trans":["adj. Amazing v. astonishes (in the form of an amazing ing)"],"usphone":"əˈmeɪzɪŋ","ukphone":"əˈmeɪzɪŋ"},{"name":"captain","trans":["n. Captain, Chief; Captain; Captain; Navy Colonel vt. command; lead"],"usphone":"ˈkæptɪn","ukphone":"ˈkæptɪn"},{"name":"miner","trans":["n. Miner; miner n. (Miner) name; (English) Miner; (West) Miner"],"usphone":"ˈmaɪnə(r)","ukphone":"ˈmaɪnə(r)"},{"name":"pilot","trans":["n. Pilots; pilots adj. Pilot v. driving; piloting; trial n. (Pilot) name; (Italian, Indian) Pilot; (France) Pilot"],"usphone":"ˈpaɪlət","ukphone":"ˈpaɪlət"},{"name":"ranger","trans":["n. Commando; Ranger; Ranger; Ranger n. (Ranger) name; (English) Ranje; (France) Langey"],"usphone":"ˈreɪndʒə(r)","ukphone":"ˈreɪndʒə(r)"},{"name":"stage","trans":["n. Stage; stage; drama; post station vt. Holding; staging; planning vi. Held; suitable for staging; travel by train n. (Stage); (English) Sturge"],"usphone":"steɪdʒ","ukphone":"steɪdʒ"},{"name":"bandanna","trans":["n. Tie-dye printed bandana (equal to bandana)"]},{"name":"costume","trans":["n. Costumes, costumes; costumes, theatrical costumes vt. Put on a costume for..."],"usphone":"ˈkɒstjuːm","ukphone":"ˈkɒstjuːm"},{"name":"fin","trans":["n. Fin; shark fin; fin vt. Remove the fins; install the wings vi. flapping fins; scuba diving n. (Fin) name; (French) fin"],"usphone":"fɪn","ukphone":"fɪn"},{"name":"mane","trans":["n. Mane (horse, etc.) mane n. (Mane) name; (France, Sai, Oka, Italy, Angola, Guinea-Bissau) Mane; (Japanese) true root (name)"],"usphone":"meɪn","ukphone":"meɪn"},{"name":"snout","trans":["n. Nose; pig's mouth; tobacco; mouth of nose; mouthfeel"],"usphone":"snaʊt","ukphone":"snaʊt"},{"name":"wear","trans":["v. Wear, wear; save (hair, whiskers); exposure; wear and tear; durability; accept (especially things you disapprove of); (boat) raise (flag); (poetry, text) wear and tear (time); (make) the bow turn (downwind) n. Clothing; wear and tear; durability"],"usphone":"weə(r)","ukphone":"weə(r)"},{"name":"antelope","trans":["n.Antelope; antelope leather"],"usphone":"ˈæntɪləʊp","ukphone":"ˈæntɪləʊp"},{"name":"curved","trans":["adj. Curved; curved n. Inverse arc angle vt. curved (past tense of curve)"],"usphone":"kɜːvd","ukphone":"kɜːvd"},{"name":"fight","trans":["v. Fight against...; fight; fight; competition; strong opposition; fight; fight; fight; fight; participate in (boxing match); oppose... proposals; command (force); fight (fire); struggle to win (election); restraint (emotional expression); loss of balance (between parties); fight (lawsuit) n. Fight; fight; contest; boxing match; argument; fight; fighting; fighting spirit"],"usphone":"faɪt","ukphone":"faɪt"},{"name":"horn","trans":["n. Speaker, horn; horn vt. Cast in the name of n. (Horn); (English, German, Czech, Luo, Bo, Finn, Sey, Sweden) Horn; (France) Orne; (Original) Hong"],"usphone":"hɔːn","ukphone":"hɔːn"},{"name":"scratch","trans":["n. Abrasion; scratches; scratchy sound; graffiti adj. For drafting; coincidental; coincidental vt. Grab; scrape; dig out; paint vi. Catch; kick; scrape; barely make ends meet; quit the game"],"usphone":"skrætʃ","ukphone":"skrætʃ"},{"name":"straight","trans":["adj. Straight; continuous; straight; upright; neat; heterosexual adv. directly; continuously; immediately; frankly n. straight; straight; straight; straight, straight, straight; straight man, straight woman, heterosexual n. (Straight) name; (English) Strait"],"usphone":"streɪt","ukphone":"streɪt"},{"name":"brush","trans":["n. Brushes; Brushes; Brushes; Quarrels; Conflicts; Bushland; Short Trees; Fox Tails vt. brush; painting; vi. brush; wipe; skim; touch (as you pass by)"],"usphone":"brʌʃ","ukphone":"brʌʃ"},{"name":"long","trans":["adj. Long; long term; long term; long sound; (human) high; continuous; lengthy; long term; long term (profitable) adv. Over a long period of time; (before or after something) for a long time; (after the noun of time); far away n. Long; long sound; forward securities; long size (of clothing); long pants v. desire, hope n. (long) (US, UK, Ireland) long (name of person)"],"usphone":"lɒŋ","ukphone":"lɒŋ"},{"name":"sticky","trans":["adj. sticky; sticky"],"usphone":"ˈstɪki","ukphone":"ˈstɪki"},{"name":"strong","trans":["adj. Strong; strong; firm; good at adv. Strongly; violently n. (Strong) person's name; (English) Strong"],"usphone":"strɒŋ","ukphone":"strɒŋ"},{"name":"thin","trans":["adj. Thin; skinny; thin; weak vt. Make thin; make thin; make thin vi. Get thinner; get thinner; become thinner adv. sparsely; faintly n. Small part n. (Thin) person's name; (Yue) Chen; () Ting"],"usphone":"θɪn","ukphone":"θɪn"},{"name":"tongue","trans":["n. Tongue; language vt. Lick; rebuke; blow with tongue vi. Speaking; wind instrument n. (Tongue) person's name; (English) Tang"],"usphone":"tʌŋ","ukphone":"tʌŋ"},{"name":"bob","trans":["v. (make) jump up and down, vibrate; (make) knock; cut (hair) into waves; ride a large sled; suddenly appear (or disappear); move quickly (in a direction); nod; bow slightly n. Swing, bump; knock; knock quickly; nod (or bow) quickly; floats; pendulums, hanging ornaments; short haircuts, wave heads; large sleds; (1) shillings; quite a bit of money; short lines at the end of the poem; Telling the bell n. (Bob) Bob (person's name)"],"usphone":"bɒb","ukphone":"bɒb"},{"name":"explore","trans":["vt. Exploring; Exploring; Exploring vi. Explore; explore; explore"],"usphone":"ɪkˈsplɔː(r)","ukphone":"ɪkˈsplɔː(r)"},{"name":"fair","trans":["adj. Fair; beautiful, white; [weather] clear adv. Fairly; directly; clearly vi. Changqing n. Exhibition; Market; Beauty n. (Fair) Name; (English, Finn) Fair"],"usphone":"feə(r)","ukphone":"feə(r)"},{"name":"fall","trans":["v. Falling; falling; sagging; kneeling; falling down (ground); falling (in quantity, etc.); falling (rain or snow); falling; falling (in a certain state); falling; falling (of snow, rock, etc.); falling (in quantity, etc.); fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; collapse, decay adj. n. (Fall) (West) Fowler (name of person) of autumn"],"usphone":"fɔːl","ukphone":"fɔːl"},{"name":"hay","trans":["n. Hay vt. Dry it in the sun vi. Mow the grass and dry it"],"usphone":"heɪ","ukphone":"heɪ"},{"name":"maze","trans":["n. Labyrinth; bewilderment; confusion vt. lose; confuse; confuse n. (Maze) names; (English) Metz; (French) Maze"],"usphone":"meɪz","ukphone":"meɪz"},{"name":"book","trans":["n. Books; Volumes; Books of Accounts; Roster; Workbooks vt. Reservation; registration n. (Book) name; (Chinese) Bu (Cantonese, Waitama); (North); (English) Booker; (Sweden) Bock"],"usphone":"bʊk","ukphone":"bʊk"},{"name":"library","trans":["n. Library, library; library"],"usphone":"ˈlaɪbrəri; ˈlaɪbri","ukphone":"ˈlaɪbrəri; ˈlaɪbri"},{"name":"listen","trans":["vi. Listen, listen; obey, listen n. Listen, listen"],"usphone":"ˈlɪsn","ukphone":"ˈlɪsn"},{"name":"read","trans":["vt. Read; read, understand vi. Read; read it up n. Read; book adj. An educated n. (Read) name; (English) Reed"],"usphone":"riːd","ukphone":"riːd"},{"name":"story","trans":["n. Story; novel; description; news report; origin; false story; layer; a unit of measurement (1 story equals 3.3 meters) vt. Decorate with historical story paintings vi. Lying n. (Story) Story (person name)"],"usphone":"ˈstɔːri","ukphone":"ˈstɔːri"},{"name":"visit","trans":["v. Visit, visit; browse (web page); inspect; stay; consult; chat; (mostly used in the Bible); experience n. Visit, visit; browse (to the website); stay; consult; meet, chat n. (Visit) (Thailand) Weishi (name of person)"],"usphone":"ˈvɪzɪt","ukphone":"ˈvɪzɪt"},{"name":"backyard","trans":["n. Backyard; backyard"],"usphone":"ˌbækˈjɑːd","ukphone":"ˌbækˈjɑːd"},{"name":"camp","trans":["n. Camping; Camp; Holiday Camp; Detention Camp; Military Camp; Camp; Grazing Area; Annual Short-Term Military Service; Prehistoric Camp Ruins; Manipulation v. Camping; Concentrated rest (livestock); Fencing adj. Feminine; exaggerated, (costume) bizarre n. (Camp) (American, English, Canada, French) Kang (name of person)"],"usphone":"kæmp","ukphone":"kæmp"},{"name":"flashlight","trans":["n. Flashlights; flashes"],"usphone":"ˈflæʃlaɪt","ukphone":"ˈflæʃlaɪt"},{"name":"pajamas","trans":["n. Pajamas; wide pants"],"usphone":"pə'dʒɑːməz","ukphone":"pə'dʒɑːməz"},{"name":"sleeping bag","trans":["sleeping bag"],"usphone":"ˈsliːpɪŋ bæɡ","ukphone":"ˈsliːpɪŋ bæɡ"},{"name":"tent","trans":["n. Tents; residences; curtains vt. Cover it with a tent; make it possible to stay in a tent vi. Living in a tent; name of a person temporarily residing n. (Tent); (Russia, Sweden) tent"],"usphone":"tent","ukphone":"tent"},{"name":"bat","trans":["n. Bats; bats; rackets; batch file extensions vt. Hit the ball with a bat; the batting rate reached... vi. It's your turn to hit the ball; hit the ball with a bat n. (Bat) name; (Mongolian, English) Bart"],"usphone":"bæt","ukphone":"bæt"},{"name":"cave","trans":["n. Caves, caves; caverns v. collapse; surrender; cave exploration; cave digging int. (Old, school slang) Beware n. (Cave) (beauty, love) Kaif (name of person)"],"usphone":"keɪv","ukphone":"keɪv"},{"name":"evening","trans":["n. Evening; evening; (gala) party; late adj. At night; for the evening; int for use at night. Good evening (same as good evening)"],"usphone":"ˈiːvnɪŋ","ukphone":"ˈiːvnɪŋ"},{"name":"hang","trans":["vt. hang, hang; decorate; hang; leave unresolved vi. Suspended, hanged; hanged; suspended, suspended n. (Hang) name; (Luo) Han; (Chinese in Southeast Asian countries) Kang; (old) Han; () Han (used in the first section of the name), hang"],"usphone":"hæŋ","ukphone":"hæŋ"},{"name":"hunt","trans":["v. Hunting; searching; hunting; (UK) fox hunting; hunting with (horses and hounds) (especially fox or deer hunting); hunting with dogs (or horses); hunting (animals); (animal) hunting); (machine, instrument pin, or system) swinging; (aircraft or rocket) swinging irregularly n. Searching; hunting; (UK) foxhunting activities; hunting teams (where foxhunting is often held in the United Kingdom); hunting groups; hunting grounds; hunting grounds; hunting n. (American) (American) (American name))"],"usphone":"hʌnt","ukphone":"hʌnt"},{"name":"return","trans":["v. Return; (particularly feeling) recover; return...; return...; return (ball) with...; return (ball) n. Return; recover; return; hit back the ball (tennis, etc.); returned object; circuit wire adj. Back and forth; touring; repaying; returning;"],"usphone":"rɪˈtɜːn","ukphone":"rɪˈtɜːn"},{"name":"counter","trans":["n. Counter; counter; counter; chips (for some board games) vt. Fight back, fight back; move in reverse, face to face; refute, answer vi. Move in the opposite direction, facing the stem; refute adj. The opposite adv. in the opposite direction; in the opposite direction"],"usphone":"ˈkaʊntə(r)","ukphone":"ˈkaʊntə(r)"},{"name":"litter","trans":["n. Garbage; car, stretcher; nest (animal pups); messy vt. Throw it away; give... bedding grass; make a mess... vi. Giving birth; littering waste n. (Litter) name; (Litter, Germany) Litt"],"usphone":"ˈlɪtə(r)","ukphone":"ˈlɪtə(r)"},{"name":"newspaper","trans":["n. Newspapers Newspapers Old newspapers"],"usphone":"ˈnjuːzpeɪpə(r)","ukphone":"ˈnjuːzpeɪpə(r)"},{"name":"plastic","trans":["n. Plastics; Plasticology; (informal) credit cards adj. Made of plastic; man-made; unnatural; (matter, material) plastic; three-dimensional; plastic; creative; adaptable to environmental changes"],"usphone":"ˈplæstɪk","ukphone":"ˈplæstɪk"},{"name":"recycle","trans":["v. Recycle; recycle; reuse n. Recycle, recycle"],"usphone":"ˌriːˈsaɪkl","ukphone":"ˌriːˈsaɪkl"},{"name":"steel","trans":["n. Steel; steel products; strong vt. Toughen; make cold adj. Made of steel; from the steel industry; strong n. (Steel) name; (German) Steele; (English) Steel"],"usphone":"stiːl","ukphone":"stiːl"},{"name":"bee","trans":["n. Honeybee, bee; hardworking person n. (Bee) name; (); (Chinese in Southeast Asian countries) US; (English) bee (female educational names Beatrix and Beatrice)"],"usphone":"biː","ukphone":"biː"},{"name":"favorite","trans":["adj. Most loved (equal to favorite) n. The most loved person (or thing); the most promising winner (in a competition or competition); Favorite (equal to favorite) v. Add... to a favorite n. (Favorite) (US) Favourite (US) Favourite (name of person)"],"usphone":"'feɪvərɪt","ukphone":"'feɪvərɪt"},{"name":"feed","trans":["v. Feed; feed; provide enough food for...; fertilize; fuel (fire); provide raw materials or power for (a machine); provide (someone) (information, ideas, etc.); supply water (body of water); (ball sports terms) feed (ball), pass the ball to (teammates); move (slowly and smoothly); move (slowly and smoothly); pass (slowly and smoothly) through (limited space); promote; graze; raise (family, etc.) (informal) feed; Feeding (especially to animals or infants); eating; a meal (of an animal or baby); a feeding device (of a machine); (machinery, equipment) Raw material supply; (satellite or network) transmission; (computer) subscription source"],"usphone":"fiːd","ukphone":"fiːd"},{"name":"help","trans":["vt. help; promote; cure; remedy n. Help; remedy; helper; something beneficial vi. help; useful; welcome n. (Help) person's name; (Fen) Help"],"usphone":"help","ukphone":"help"},{"name":"job","trans":["n. Work; occupation vt. Contracting; valet trading vi. Name of person doing odd jobs n. (Job); (English) Job; (French, Portuguese) Rube; (? -1605) Job the Moscow Patriarch of the Russian Orthodox Church. ; (Germany, Serbia, Czech Republic, Netherlands, Italy) Job"],"usphone":"dʒɒb","ukphone":"dʒɒb"},{"name":"without","trans":["prep. Nothing; not with...; not with; in... outside adv. No, lacking; outside conj. Otherwise; unless n. Outside, outside"],"usphone":"wɪˈðaʊt","ukphone":"wɪˈðaʊt"},{"name":"earthquake","trans":["n. Earthquakes; major upheavals"],"usphone":"ˈɜːθkweɪk","ukphone":"ˈɜːθkweɪk"},{"name":"quilt","trans":["n. Quilts; quilts vt. Made from east patchwork; sewn after adding soft lining vi. Sew a quilt"],"usphone":"kwɪlt","ukphone":"kwɪlt"},{"name":"square","trans":["adj. square; square; right angle; straight vt. Make a square; consistent with... vi. Consistent; square n. Square; Square; square adv. Narukaigakuji"],"usphone":"skweə(r)","ukphone":"skweə(r)"},{"name":"squeal","trans":["v. Whistleblowing; long screaming n. Screaming"],"usphone":"skwiːl","ukphone":"skwiːl"},{"name":"squint","trans":["vi. squinting; strabismus; peeping; offset vt. Make a squint; squint n. Strabismus; oblique hole in a small window; take a look at adj. strabismus; oblique"],"usphone":"skwɪnt","ukphone":"skwɪnt"},{"name":"squish","trans":["v. Makes a crackling sound; crushed, crushed; squeezed n. squeaks"],"usphone":"skwɪʃ","ukphone":"skwɪʃ"},{"name":"bubble","trans":["n. Bubbles, bubbles, bubbles; transparent round cover, round top vi. Boiling, bubbling; making a bubbling sound vt. make bubbles; talk nonstop"],"usphone":"ˈbʌbl","ukphone":"ˈbʌbl"},{"name":"colorful","trans":["adj. colorful; interesting; colorful"],"usphone":"ˈkʌləfl","ukphone":"ˈkʌləfl"},{"name":"material","trans":["n. Materials; tools; talents (with specified characteristics); materials; repertoire; cloth adj. Material; physical needs; related to the content of reasoning; important; (evidence or fact) decisive; objectively existing; greedy n. (Material) (meaning, beauty) (meaning, beauty) mother Teri Yali (name of person)"],"usphone":"məˈtɪəriəl","ukphone":"məˈtɪəriəl"},{"name":"pocket","trans":["n. Pocket; money; container vt. Hide; endure; put... in your pocket vi. Form a pouch or sac adj. small, pocket-sized; monetary"],"usphone":"ˈpɒkɪt","ukphone":"ˈpɒkɪt"},{"name":"solid","trans":["adj. solid; reliable; three-dimensional; strong; consistent n. solid; cubic n. (Solid) person name; (Sweden) Solide"],"usphone":"ˈsɒlɪd","ukphone":"ˈsɒlɪd"},{"name":"stick","trans":["vt. Stab; poke; stick; paste vi. insist; stick out; stick to n. stick; walking stick; dumb person n. (Stick) (Finn) stick (name of person)"],"usphone":"stɪk","ukphone":"stɪk"},{"name":"different","trans":["adj. different; individual, unique"],"usphone":"ˈdɪfrənt","ukphone":"ˈdɪfrənt"},{"name":"fall apart","trans":["collapse; collapse; disintegration; fragmentation"],"usphone":"fɔl əˈpɑrt","ukphone":"fɔl əˈpɑrt"},{"name":"lost","trans":["adj. lost, lost; lost, lost; irrecoverable; lost, lost; troubled; lost; lost; lost; died; failed v. lost; pain; miscarriage; sacrifice; failure (past tense and past participle of lose)"],"usphone":"lɒst","ukphone":"lɒst"},{"name":"love","trans":["n. Love; Love; Preference; (nickname) Dear; Loving You; Loving Someone; Favorite Thing; Zero Score v. Love (someone); Caring; Liking (something or something); Loving n. (Love) (English, Philippines, United States) Love (name of person)"],"usphone":"lʌv","ukphone":"lʌv"},{"name":"old","trans":["adj. Obsolete, ancient; old n. Ancient n. (Old) names; (English) Old"],"usphone":"əʊld","ukphone":"əʊld"},{"name":"busy","trans":["adj. Busy; lively; occupied vt. Busy n. (Busy) name; () Busy; (France) Bissey"],"usphone":"ˈbɪzi","ukphone":"ˈbɪzi"},{"name":"cattail","trans":["n. Cattails; flowers with soft inflorescences"],"usphone":"ˈkætteɪl","ukphone":"ˈkætteɪl"},{"name":"pond","trans":["n. Pond; (the pond) (informal) Atlantic Ocean v. Interception (liquid such as running water) to form a small lake n. (Pond) (beauty, love) pond (name of person)"],"usphone":"pɒnd","ukphone":"pɒnd"},{"name":"turtle","trans":["n. Turtle, turtle; turtle n. (Turtle) name; (English) Turtle"],"usphone":"ˈtɜːtl","ukphone":"ˈtɜːtl"},{"name":"water","trans":["n. Water; seawater; rainwater; ocean, large areas of water vt. Moisten; supply water; water... vi. Adding water; crying; drooling n. (Water) person's name; (English) Water"],"usphone":"ˈwɔːtə(r)","ukphone":"ˈwɔːtə(r)"},{"name":"babysitter","trans":["n. Temporary caregivers for young children"],"usphone":"ˈbeɪbisɪtə(r)","ukphone":"ˈbeɪbisɪtə(r)"},{"name":"dentist","trans":["n. Dentists Dentists Clinics"],"usphone":"ˈdentɪst","ukphone":"ˈdentɪst"},{"name":"farmer","trans":["n. Farmer, farmer n. (Farmer) name; (English) Farmer; (French) Farmer; (West) Farmer"],"usphone":"ˈfɑːmə(r)","ukphone":"ˈfɑːmə(r)"},{"name":"firefighter","trans":["n. Firefighters"],"usphone":"ˈfaɪəfaɪtə(r)","ukphone":"ˈfaɪəfaɪtə(r)"},{"name":"vet","trans":["n. Veterinarians; Veterinary Clinics; Veterans; Examination v. Examination, Examination; Veterinarian; Treatment n. (Vet) (Dutch, Russian) Wert (name)"],"usphone":"vet","ukphone":"vet"},{"name":"darker","trans":["adj. darker; darker; deeper (comparative level of dark)"],"usphone":"dɑ:kə","ukphone":"dɑ:kə"},{"name":"fuzzy","trans":["adj. vague; distorted; fuzzy n. (Fuzzy) name; (English) Fuzzy"],"usphone":"ˈfʌzi","ukphone":"ˈfʌzi"},{"name":"jumbo","trans":["adj. huge; very large n. behemoth; giant jet; large and clumsy person or object"],"usphone":"ˈdʒʌmbəʊ","ukphone":"ˈdʒʌmbəʊ"},{"name":"puffy","trans":["adj. Swollen; soft and white; (clothes) swollen; excessively modified; wheezing n. eye bags"],"usphone":"ˈpʌfi","ukphone":"ˈpʌfi"},{"name":"round","trans":["adj. round; curved; integer; perfect; approximate; obese; (sound) round; (ancient, money) large; (ancient, human, or way of speaking) straightforward adv. Spin; around; around; everywhere; in a detour; in the opposite direction; one by one; prep somewhere. Around; around; around; around...; at... stages; round; round; regular activity; circle, round object; fixed route v. (make) round; complete; round off; round off; round off; round off; progress; circumnavigate; gain weight n. (Round) (US, UK, Canada, Australia, India, Germany) Round (name of person)"],"usphone":"raʊnd","ukphone":"raʊnd"},{"name":"tall","trans":["adj. Tall; long; excessive; exaggerated adv. Exaggerate n. (Tall) names; (Mali, Arabic) Tales; (Finn, Roe, Sweden) Tarr; (English) Thor; (Turkey) Tales"],"usphone":"tɔːl","ukphone":"tɔːl"},{"name":"baker","trans":["n. Bakers; bread workers; (portable) ovens"],"usphone":"ˈbeɪkə(r)","ukphone":"ˈbeɪkə(r)"},{"name":"doctor","trans":["n. Doctor; Doctor; Dentist (title or title) Dentist; Clinic; (informal) Adviser; Knowledgeable person; Artificial flies; Cool ocean breezes; (informal) Chef on board v. Tampering, forgery; adding harmful substances (to food or drink); castrate (animals); treat diseases for...; grant a doctorate degree; repair (machine); interfere (ball); seek medical treatment; practice medicine"],"usphone":"ˈdɒktə(r)","ukphone":"ˈdɒktə(r)"},{"name":"teacher","trans":["n. Teacher; tutor n. (Teacher) name; (English) teacher"],"usphone":"ˈtiːtʃə(r)","ukphone":"ˈtiːtʃə(r)"},{"name":"city","trans":["n. City, city adj. urban; metropolitan"],"usphone":"ˈsɪti","ukphone":"ˈsɪti"},{"name":"corral","trans":["n. Corral (for agricultural and ranching in North America); vehicle array (for defense in the camp) v. put (horses, cows) in the corral; lock (a group of people) together; use (vehicles) as a vehicle; capture n. (Corral) (US) Corral (name of person)"],"usphone":"kəˈrɑːl","ukphone":"kəˈrɑːl"},{"name":"country","trans":["n. Country, Homeland; Nationality; Countryside, Countryside; Hometown adj. Motherland's, hometown's; local, rural; national; rude; country music's"],"usphone":"ˈkʌntri","ukphone":"ˈkʌntri"},{"name":"farmhouse","trans":["n. Farmhouse, [agro-industrial] farmhouse"],"usphone":"ˈfɑːmhaʊs","ukphone":"ˈfɑːmhaʊs"},{"name":"orchard","trans":["n. Orchard; grove n. (Orchard) name; (English, Spanish) Orchard"],"usphone":"ˈɔːtʃəd","ukphone":"ˈɔːtʃəd"},{"name":"shed","trans":["vt. Outflow; get rid of; disperse; pour out vi. runoff; shedding; scattering n. Hut, shed; watershed"],"usphone":"ʃed","ukphone":"ʃed"},{"name":"bog","trans":["n. Swamps; muddy ponds vt. Get stuck in a quagmire; make it impossible to move vi. Caught in a quagmire; can't move n. (Bog) name; (Germany, Ng) Borg"],"usphone":"bɒɡ","ukphone":"bɒɡ"},{"name":"cranberry","trans":["n.Cranberries"],"usphone":"ˈkrænbəri","ukphone":"ˈkrænbəri"},{"name":"dried","trans":["adj. (Food, flowers, etc.) Dried, dehydrated v. dries (past tense and past participle of dry)"],"usphone":"draɪd","ukphone":"draɪd"},{"name":"fruit","trans":["n. Fruit; Product vi. The results are real vt. Make... result n. (Fruit) person's name; (French) Freud; (English) Fruitt"],"usphone":"fruːt","ukphone":"fruːt"},{"name":"sauce","trans":["n. Soy sauce; sauce; sauce vt. Add fun; season n. (Sauce) name; (West) Saucer; (France) Sos"],"usphone":"sɔːs","ukphone":"sɔːs"},{"name":"tart","trans":["adj. sour; sharp; sharp n. flan; prostitute vt. Dress up n. (Tart) person's name; (English) Tart"],"usphone":"tɑːt","ukphone":"tɑːt"},{"name":"breakfast","trans":["n. Breakfast; breakfast vi. Have breakfast vt. Serves breakfast for..."],"usphone":"ˈbrekfəst","ukphone":"ˈbrekfəst"},{"name":"catch","trans":["vt. Catch; catch; infect; understand vi. catch; catch n. Catch; catch; window hook"],"usphone":"kætʃ","ukphone":"kætʃ"},{"name":"Father's Day","trans":["n. Father's Day (3rd Sunday in June every year)"],"usphone":"ˈfɑðəz","ukphone":"ˈfɑðəz"},{"name":"picnic","trans":["n. Picnic vi. Go on a picnic"],"usphone":"ˈpɪknɪk","ukphone":"ˈpɪknɪk"},{"name":"plan","trans":["n. Plan; floor plan vt. Plan; design; plan vi. Plan; plan n. (Plan) person's name; (Sweden) Plan; (France) Prang"],"usphone":"plæn","ukphone":"plæn"},{"name":"eat","trans":["vt. Eat, drink; corrode; annoy vi. eating; corrosion, erosion"],"usphone":"iːt","ukphone":"iːt"},{"name":"find","trans":["vt. Find, find; discover; think; feel; obtain vi. ruling n. Find n. (Find) person's name; (Dan) Finn"],"usphone":"faɪnd","ukphone":"faɪnd"},{"name":"hungry","trans":["adj. hungry; hungry; desolate; futile"],"usphone":"ˈhʌŋɡri","ukphone":"ˈhʌŋɡri"},{"name":"space","trans":["n. Space; space; distance vi. Retention interval vt. Separated"],"usphone":"speɪs","ukphone":"speɪs"},{"name":"trash","trans":["n. Garbage; waste vt. Discard; prune branches"],"usphone":"træʃ","ukphone":"træʃ"},{"name":"tree","trans":["n. Trees; lumber; tree-like objects vt. Catch up... to the tree vi. Climb up a tree; run away from a tree n. (Tree) person's name; (English) Terry"],"usphone":"triː","ukphone":"triː"},{"name":"dime","trans":["n. (American, Canadian) Very small coins; small amount of money; small things n. (Dime) (name of person)"],"usphone":"daɪm","ukphone":"daɪm"},{"name":"dollar","trans":["n. Dollar n. (Dollar) person's name; (English) dollar"],"usphone":"ˈdɒlə(r)","ukphone":"ˈdɒlə(r)"},{"name":"nickel","trans":["n. Nickel; nickel coins; five-cent nickel coins vt. Nickel-plated in the name of n. (Nickel); (German, English) Nikkel"],"usphone":"ˈnɪkl","ukphone":"ˈnɪkl"},{"name":"penny","trans":["n. (US) cents; pennies"],"usphone":"ˈpeni","ukphone":"ˈpeni"},{"name":"quarter","trans":["n. Quarter; region; quarter; one quarter hour; two corners and five points; section vi. Accommodation; residency vt. Divide... into four equal parts; for someone to stay num. quarters"],"usphone":"ˈkwɔːtə(r)","ukphone":"ˈkwɔːtə(r)"},{"name":"fog","trans":["n. Fog; smoke, dust; confusion vt. Blur; confuse; cover with fog vi. shrouded in fog; blurred n. (Fog) person's name; (Dan) Fu"],"usphone":"fɒɡ","ukphone":"fɒɡ"},{"name":"form","trans":["n. Form, shape; form, appearance; form; table vt. Composition, composition; arrangement, organization; generation, shaping vi. Formation, composition; arrangement n. (Form) names; (English) Form; (France, Germany) Forum"],"usphone":"fɔːm","ukphone":"fɔːm"},{"name":"ice","trans":["n. Ice; ice cream; restraint; () diamond vt. Ice; freeze vi. freezing adj. Ice's n. (Ice) name; (English) Ace; (French) Ice"],"usphone":"aɪs","ukphone":"aɪs"},{"name":"spooky","trans":["adj. spooky; ghostly; creepy"],"usphone":"ˈspuːki","ukphone":"ˈspuːki"},{"name":"still","trans":["Adv. Still; still; still adj. Still, immovable; silent, calm; non-bubbling n. silence; stills; distillation chamber conj. Still; however; nonetheless vt. Distillate; make... still; calm... vi. stillness; calm; distillation n. (Still) person's name; (England, Finland, Sweden) Steele; (de) Stihl"],"usphone":"stɪl","ukphone":"stɪl"},{"name":"fly","trans":["vi. fly; fly; fly vt. flight; overflight; make it fly n. Fly; fly; two-winged insect adj. An agile n. (Fly) name; (French) Foley; (English) Fry"],"usphone":"flaɪ","ukphone":"flaɪ"},{"name":"food","trans":["n. Food; nutrients"],"usphone":"fuːd","ukphone":"fuːd"},{"name":"frog","trans":["n. Frog; [Railway] fork; buckle vi. Frog catcher n. (Frog) name; (Russian) Frog"],"usphone":"frɒɡ","ukphone":"frɒɡ"},{"name":"hop","trans":["v. Jumping on one foot; jumping on two feet or on one foot; suddenly going to a place quickly; (informal) making a quick trip; (informal) leaving quickly; (changing position quickly, etc.) jumping...; exchanging; (informal) jumping on (moving vehicle); express delivery; flavoring with hops n. Short distance jumping on both legs; short trips; hops; (informal) dancing; (informal) dancing; (informal) dancing; beer (drugs) Opium in particular) n. (Hop) (American) joint (name of person)"],"usphone":"hɒp","ukphone":"hɒp"},{"name":"bulb","trans":["n. Light bulbs; bulbs; spheres vi. Raw bulb; expands into a ball"],"usphone":"bʌlb","ukphone":"bʌlb"},{"name":"plant","trans":["n. Factories, workshops; plants; equipment; crops vt. Plant; cultivate; cultivate; place vi. Name of the person who planted n. (Plant); (English, Spanish, Italian) Plant; (France) Prand"],"usphone":"plɑːnt","ukphone":"plɑːnt"},{"name":"spring","trans":["n. Spring; springs; springs; vitality; jumping adj. Spring vi. Grow; erupt; leap; crack vt. Make it jump; make it explode; suddenly propose; make it pop n. (Spring) name; (Germany) Sprin; (England, Finland, Sweden) Spring"],"usphone":"sprɪŋ","ukphone":"sprɪŋ"},{"name":"winter","trans":["n. Winter; age; depression period vi. Winter adj. Winter's; n. (Winter) person's name for wintering; (English, German, German, German, Russian, Czech, West, Finland, Sweden, France) Winter"],"usphone":"ˈwɪntə(r)","ukphone":"ˈwɪntə(r)"},{"name":"bike","trans":["n. Bicycles; bicycles vi. Cyclist (or motorcycle) n. (Bike) name; (Dukou, Sai) Bick"],"usphone":"baɪk","ukphone":"baɪk"},{"name":"bus","trans":["n. Bus by bus"],"usphone":"bʌs","ukphone":"bʌs"},{"name":"car","trans":["n. Car; car n. (Car) person's name; (Earth) Jarr; (French, Western) Carl; (Se) Tsar"],"usphone":"kɑː(r)","ukphone":"kɑː(r)"},{"name":"ferry","trans":["n. Ferries; ferries; ferries vt. Crossing (by ferry); Transportation by ferry; Transportation by air vi. Ferry; name of person traveling to and from (Ferry); (France, Germany, England, Indonesia) ferry"],"usphone":"ˈferi","ukphone":"ˈferi"},{"name":"skateboard","trans":["n. Ice skating board vi. Glide with a skateboard"],"usphone":"ˈskeɪtbɔːd","ukphone":"ˈskeɪtbɔːd"},{"name":"subway","trans":["n. Subways; tunnels vi. By subway"],"usphone":"ˈsʌbweɪ","ukphone":"ˈsʌbweɪ"},{"name":"taxi","trans":["n. Taxi; minibus (in Africa); taxi steamer v. (plane) taxiing; taxi delivery"],"usphone":"ˈtæksi","ukphone":"ˈtæksi"},{"name":"walk","trans":["v. Walking, walking; walking; walking; walking; accompanying... walking; being stolen; (ghost) infestation; (informal) release from suspicion; (baseball) free entry; (ancient) life; guide...; (informal) abandon n. walk, walk; path; (postman's) delivery route; forest area (ranger); forest area under the jurisdiction of (rangers); cockfighting farm; beagle breeding farm; leisurely pace; (baseball) free landing (n) walk (n) US) Walker (name)"],"usphone":"wɔːk","ukphone":"wɔːk"},{"name":"Easter","trans":["n. Easter"],"usphone":"ˈiːstə(r)","ukphone":"ˈiːstə(r)"},{"name":"sneaky","trans":["adj. sneaky; covert, despicable"],"usphone":"ˈsniːki","ukphone":"ˈsniːki"},{"name":"sorry","trans":["adj. Sorry; sorry, sorry int. Sorry, sorry (indicates a euphemistic refusal, etc.)"],"usphone":"ˈsɒri","ukphone":"ˈsɒri"},{"name":"take","trans":["vt. Take, take; take; accept (gifts, etc.); buy, spend; spend (time, etc.) vi. Take; obtain n. Catch; Views; Benefits, Profits; Amount (of tickets) sold"],"usphone":"teɪk","ukphone":"teɪk"},{"name":"compare","trans":["v. Compare, contrast; similar to..., compare... to; compare, match; comparative level and superlative n. comparison of components (adjectives or adverbs)"],"usphone":"kəmˈpeə(r)","ukphone":"kəmˈpeə(r)"},{"name":"greatest","trans":["adj. greatest (great superlative); the best"],"usphone":"'ɡreɪtɪst","ukphone":"'ɡreɪtɪst"},{"name":"more","trans":["Adv. More; furthermore; to a greater extent adj. More; additional pron. More quantity n. More n. (More) names; (English, French) Moore; (Italian, Spanish, Italian) Morey"],"usphone":"mɔː(r)","ukphone":"mɔː(r)"},{"name":"number","trans":["n. Numbers; periods (magazines, etc.); numbers; numbers; arithmetic vi. Included; total reached vt. Number; count; number...; limit the number"],"usphone":"ˈnʌmbə(r)","ukphone":"ˈnʌmbə(r)"},{"name":"vegetable","trans":["n. Vegetables; plants; plant people adj. vegetable; vegetable"],"usphone":"ˈvedʒtəbl","ukphone":"ˈvedʒtəbl"},{"name":"cucumber","trans":["n.Cucumber; cucumber"],"usphone":"ˈkjuːkʌmbə(r)","ukphone":"ˈkjuːkʌmbə(r)"},{"name":"grow","trans":["vi. Develop; grow; gradually become... vt. Make grow; grow; expand n. (Grow) person's name; (English) Grow"],"usphone":"ɡrəʊ","ukphone":"ɡrəʊ"},{"name":"onion","trans":["n.Onions; onion heads"],"usphone":"ˈʌnjən","ukphone":"ˈʌnjən"},{"name":"salad","trans":["n. Salad; in particular lettuce n. (Salad) name; (Arabic) salad"],"usphone":"ˈsæləd","ukphone":"ˈsæləd"},{"name":"collecting","trans":["gather to collect (present participle of collect)"]},{"name":"create","trans":["vt. create, create; cause"],"usphone":"kriˈeɪt","ukphone":"kriˈeɪt"},{"name":"enjoy","trans":["vt. Appreciate, enjoy; love; make your life happy"],"usphone":"ɪnˈdʒɔɪ","ukphone":"ɪnˈdʒɔɪ"},{"name":"hobby","trans":["n. Hobbies; Hobbies n. (Hobby) Name; (English) Hobby"],"usphone":"ˈhɒbi","ukphone":"ˈhɒbi"},{"name":"relax","trans":["vi. Relax, rest; relax, relax; become calm; recuperate vt. relax; rest; relax; ease; relax"],"usphone":"rɪˈlæks","ukphone":"rɪˈlæks"},{"name":"writing","trans":["n. Writing; Writing Skills; Writing; Writing; Writing; Writing; Writing; Handwriting v. Writing; Writing (present participle of write)"],"usphone":"ˈraɪtɪŋ","ukphone":"ˈraɪtɪŋ"},{"name":"body","trans":["n. Body; subject; mass; group; main part vt. Name a person with a physical n. (Body); (English, French, Luo) Bodie"],"usphone":"ˈbɒdi","ukphone":"ˈbɒdi"},{"name":"flippers","trans":["n. Fins (plural of flipper); fins"]},{"name":"paw","trans":["n. (animal) claws; (someone's) hands (used when displeased or angry) v. grasping, picking; touching; planing; caressing rudely; grabbing with claws; rummaging"],"usphone":"pɔː","ukphone":"pɔː"},{"name":"swim","trans":["vi. swimming; floating; dipping; vertigo vt. swim past; make it float n. Swim; float; faint adj. The one you wear while swimming"],"usphone":"swɪm","ukphone":"swɪm"},{"name":"tail","trans":["n. Tails; trails; braids; tuxedo vt. Trailing; attaching the tail vi. Track; reduce or decrease adj. coming from behind; tail"],"usphone":"teɪl","ukphone":"teɪl"},{"name":"count","trans":["v. Counting; calculating the total number; counting..., including; important; formally accepted; considered as n. total; count; count; count of quantity; matters, charges; opinions; count (of yarn) n. (count) (US) count (US) count (name of person)"],"usphone":"kaʊnt","ukphone":"kaʊnt"},{"name":"igloo","trans":["n. Dome buildings; dome huts made of snow blocks; igloo; Eskimo dome huts"],"usphone":"ˈɪɡluː","ukphone":"ˈɪɡluː"},{"name":"marshmallows","trans":["n. Marshmallow (plural of marshmallow); medicinal sunflower compote"]},{"name":"rainbow","trans":["n. Rainbow; colorful arrangement; fantasy adj. Colourful; rainbow-shaped vt. Make a rainbow; decorate like a rainbow vi. Rainbow-shaped n. (Rainbow) person's name; (English) Raynbo"],"usphone":"ˈreɪnbəʊ","ukphone":"ˈreɪnbəʊ"},{"name":"float","trans":["v. Float, float; drift; float; drift; arrange (loan) for consideration (idea or plan); issue (stock) listing; implement (currency exchange rate) free floating (currency exchange rate); spare change (used by bars, etc. to find change for customers); floats, floats; floats; drinks with ice cream; floats; drinks with ice cream; floating period; sitting in a floating box (treatment of illness, healing, or relaxation); lifebuoy n. (Float) (US, UK, Germany) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Person's name)"],"usphone":"fləʊt","ukphone":"fləʊt"},{"name":"give up","trans":["relinquish; surrender"],"usphone":"ɡɪv ʌp","ukphone":"ɡɪv ʌp"},{"name":"important","trans":["adj. important, significant; having status; having power"],"usphone":"ɪmˈpɔːtnt","ukphone":"ɪmˈpɔːtnt"},{"name":"keep","trans":["vt. Maintain; operate; comply; raise vi. Maintain; continue n. maintain; livelihood; living expenses n. (Keep) name; (English) Kip"],"usphone":"kiːp","ukphone":"kiːp"},{"name":"tie","trans":["v. (use of wire, rope, etc.) tie; tie, tie; tie; tie; tie with..., make a draw; use a cable to connect (note) n. tie; shoelaces; bow ties; rope, wire; relationships, ties; restraint; tie; tie; draw; regardless of victory or loss; (English) knockout tournament (especially soccer); sustain the sound line n. (Tie) (US, Australia, Malaysia) (name of person)"],"usphone":"taɪ","ukphone":"taɪ"},{"name":"try","trans":["vt. Attempt, effort; test; trial; test vi. Try; Try; Test n. Try; Try; Test n. (Try) Name; (English, Indonesia) Teri; () Delhi"],"usphone":"traɪ","ukphone":"traɪ"},{"name":"behind","trans":["prep. Behind...; behind...; behind (after someone passes through a house); behind...; behind...; behind...; behind; supporting; being... the cause of...; being (someone's) past adv. Far from behind; stay where you are; in arrears; fall behind; score settled; not on time (complete the task) n. (informal) butt; shooting score"],"usphone":"bɪˈhaɪnd","ukphone":"bɪˈhaɪnd"},{"name":"covers","trans":["n. Covering; cover, cover; reef, security deposit, reef group v. coverage, including (three single forms of cover)"]},{"name":"hide","trans":["vt. Concealing; concealing; whipping vi. hide n. Hide; animal hide; hiding place"],"usphone":"haɪd","ukphone":"haɪd"},{"name":"sleepy","trans":["adj. Sleepy, sleepy; (place) deserted, quiet; (business, industry, etc.) inactive"],"usphone":"ˈsliːpi","ukphone":"ˈsliːpi"},{"name":"time","trans":["n. Time; era; number of times; beat; multiples vt. Timing; measuring the time of...; the speed of arranging... adj. Regular; regular; instalment n. (Time) name; (Russian) Ji Mei; (English) time; (ro) time"],"usphone":"taɪm","ukphone":"taɪm"},{"name":"braid","trans":["n. Colored braids (for furniture and military uniforms); hair braids; braids (made of elastic material) v. braid (hair); braid (hair) into a band (or braid); (use a band, etc.); flow in a circle (river or creek) n. (Braid) (US) Braid (name of person)"],"usphone":"breɪd","ukphone":"breɪd"},{"name":"curly","trans":["adj. curly; curly; (wood) wrinkled; curled"],"usphone":"ˈkɜːli","ukphone":"ˈkɜːli"},{"name":"spike","trans":["n. Long spikes, road studs; spikes; stilettos vt. Block; secure with a big nail; use a sharp object to pierce n. (Spike)'s name; (Sweden) Speke"],"usphone":"spaɪk","ukphone":"spaɪk"},{"name":"swing","trans":["v. Swing; hang; jump; rotate; rotate (on the axis); move (boat, plane) to all positions; (abruptly) turn; walk with a big swing; hang; walk; walk; jump; throw at...; fly (cricket) sideways; change (mood or opinion); gain; have a decisive influence on...; successfully completed; strong sense of rhythm n. Swing; swing; rhythm; light action (cricket) Side flying ball; (politician) A trip with multiple stays; hitting; ups and downs adj. Strong rhythm jazz music; decisive n. (Swing) (American, Swedish, English), Swain (personal name)"],"usphone":"swɪŋ","ukphone":"swɪŋ"},{"name":"drawer","trans":["n. Drawer; Invoyer; Issuer; Drafter; Tavern Servant n. n. (de) Delavel (name of person)"],"usphone":"drɔ:(r)","ukphone":"drɔ:(r)"},{"name":"eraser","trans":["n. Eraser; eraser; [meter] eraser"],"usphone":"ɪˈreɪzə(r)","ukphone":"ɪˈreɪzə(r)"},{"name":"fix","trans":["v. (make) fix; determine (price, date, etc.); repair; arrange; (make) (paint, impact, etc.) last; (unofficial) dilemma; (informal) one dose of narcotics; something exciting and addictive; extreme feeling; (informal) hasty solution; (informal) approach; (informal) fraud n. (Fix) (US) Fix (name of person)"],"usphone":"fɪks","ukphone":"fɪks"},{"name":"found","trans":["vt. establish, establish; found v. find (past participle of find)"],"usphone":"faʊnd","ukphone":"faʊnd"},{"name":"mistake","trans":["n. Errors; Misunderstandings; Negligence vt. Mistake; misunderstanding vi. mistake; misunderstanding"],"usphone":"mɪˈsteɪk","ukphone":"mɪˈsteɪk"},{"name":"need","trans":["v. Necessity, need; (indicating that it should or must be done) necessary n. Need, must; special need, urgent need; desire; shortage (of food, money, or source of livelihood); necessities; poor (or difficult) situation"],"usphone":"niːd","ukphone":"niːd"},{"name":"crashing","trans":["adj. best; (informal) (used to emphasize) complete v. collision; (cause) crash; (cause) crash; (make) make a loud noise; (during a game) fiasco (present participle of crash)"],"usphone":"'kræʃɪŋ","ukphone":"'kræʃɪŋ"},{"name":"dive","trans":["v. Scuba diving; diving; diving; (plane or bird) dive; jump; jump, jump; jump, crash; quickly reach in; fake fall n. Dive, dive; jump; jump, jump; jump, jump; jump, jump; plunge, plunge; false fall; low level bar n. (Dive) (France, US) Diff (name of person)"],"usphone":"daɪv","ukphone":"daɪv"},{"name":"imagine","trans":["vt. Imagine; conjecture; guess vi. imagine; conjecture; imagine"],"usphone":"ɪˈmædʒɪn","ukphone":"ɪˈmædʒɪn"},{"name":"rough","trans":["adj. rough; rough; rough; tough; unprocessed vt. Make rough; rough treatment; draft n. Hard; uneven ground; unprocessed material; rough part vi. Bad manners adv. crudely; crudely; crudely n. (Rough) person's name; (English) Rough"],"usphone":"rʌf","ukphone":"rʌf"},{"name":"salty","trans":["adj. salty; salty"],"usphone":"ˈsɔːlti; ˈsɒlti","ukphone":"ˈsɔːlti; ˈsɒlti"},{"name":"sense","trans":["n. Feelings, functions; ideas; reason; reason vt. feel; detect n. (Sense) (US) sense (name of person)"],"usphone":"sens","ukphone":"sens"},{"name":"clear","trans":["adj. Clear; clear; clear; innocent vt. Pass; Clear; Clean; Skip vi. Clear; clear adv. Clear; completely n. Clear; Gap n. (Clear) person's name; (English) Clear"],"usphone":"klɪə(r)","ukphone":"klɪə(r)"},{"name":"cover","trans":["vt. Includes; interviews, reports; involvement; walking (a journey); cover; cover; cover; cover; cover; cover; cover; cover; cover, excuse vi. cover; replace; pervert; insure...; n. (Cover) name; (English) Covell; (Italian)"],"usphone":"ˈkʌvə(r)","ukphone":"ˈkʌvə(r)"},{"name":"insect","trans":["n.Insects; scumbags"],"usphone":"ˈɪnsekt","ukphone":"ˈɪnsekt"},{"name":"spotted","trans":["adj. spotted; spotted; spotted; stained v. discovered (past participle of spot); tainted; stained n. (Spotted) person's name; (English) Spotted"],"usphone":"ˈspɒtɪd","ukphone":"ˈspɒtɪd"},{"name":"wasp","trans":["n. Wasps; [Kun] Wasps; Irritable people vi. Straight hit like a wasp"],"usphone":"wɒsp","ukphone":"wɒsp"},{"name":"wing","trans":["n. Wing; wing; flight; faction; side hall, ear chamber, chamber vt. Make it fly; fly by air; increase... speed; install a wing vi. Name of person flying n. (Wing); (English, Indonesia) Wen"],"usphone":"wɪŋ","ukphone":"wɪŋ"},{"name":"fun","trans":["vi. Joking (3rd person singular of fun) (informal)"],"usphone":"fʌn","ukphone":"fʌn"},{"name":"haircut","trans":["n.Haircut; hairstyle"],"usphone":"ˈheəkʌt","ukphone":"ˈheəkʌt"},{"name":"scared","trans":["adj. Scared v. makes afraid (past participle of scare)"],"usphone":"skeəd","ukphone":"skeəd"},{"name":"shorter","trans":["adj. Shorter; shorter; shorter (shorter comparative) n. (short) name; (English) SCHOTT"],"usphone":"ʃɔːtə","ukphone":"ʃɔːtə"},{"name":"snip","trans":["n. Scissors; bargains vt. Cut vi. snips"],"usphone":"snɪp","ukphone":"snɪp"},{"name":"trim","trans":["v. Trim; remove (irregular or unwanted parts); reduce (expenses, etc.); (make) (a part of the body) strong; retouch; adjust (sail) to use wind power; adjust the load to adjust the balance (of a ship, aircraft); (make) level the aircraft; use the wind to steer; (informally) deceive (someone) n. Embellishments; car decoration; trim; scrap (after movie editing); good condition (or situation); (the plane) is in flat water (in terms of money); (the ship) is in a flat state (in terms of money) Horizontal position (in) adj. Neat; slim n. (Trim) (US) Trim (name of person)"],"usphone":"trɪm","ukphone":"trɪm"},{"name":"both","trans":["det. Both sides, both pron. Both sides, both adv. Both, both; not only... but also... conj. Both... and; and; both n. (Both) Bot (personal name)"],"usphone":"bəʊθ","ukphone":"bəʊθ"},{"name":"class","trans":["n. Class; Class; Type; Class; Level vt. Classify; rank...; assign... to a certain level, treat... as (or categorize, categorize); put... into a class adj. Excellent; very good, excellent, excellent vi. Belongs to... category (or rank) and is classified as a class (or level) n. (English, German) Klaas (personal name)"],"usphone":"klɑːs","ukphone":"klɑːs"},{"name":"idea","trans":["n. Thoughts; ideas; concepts"],"usphone":"aɪˈdɪə","ukphone":"aɪˈdɪə"},{"name":"name","trans":["n. Name, first name; name; reputation vt. Name, appoint; designate; title; nominate; call adj. Of the name; abbr from which the name was taken. (NAme) North American English (North American English) n. (Name) Naim (personal name); (Japanese) (surname)"],"usphone":"neɪm","ukphone":"neɪm"},{"name":"student","trans":["n. Student; Scholar n. (Student) name; (Germany) Student"],"usphone":"ˈstjuːdnt","ukphone":"ˈstjuːdnt"},{"name":"turn","trans":["vt. Turn to make a spin; turn; turn over; redeem vi. Turn; turn; turn n. Turn; change; act, act, act (damage or benefit others) n. (Turn) person's name; (Germany,) Thun"],"usphone":"tɜːn","ukphone":"tɜːn"},{"name":"fewer","trans":["adj. Fewer prons. Fewer intets. Fewer"],"usphone":"'fjuːə","ukphone":"'fjuːə"},{"name":"less than","trans":["less than; less than; less than"],"usphone":"les ðæn","ukphone":"les ðæn"},{"name":"total","trans":["adj. all; complete; whole vt. The total number reached vi. Total n. Total, total n. (Total) names; (France, Germany) Total"],"usphone":"ˈtəʊtl","ukphone":"ˈtəʊtl"},{"name":"birdseed","trans":["n. Bird bait, bird food"],"usphone":"ˈbɜːdsiːd","ukphone":"ˈbɜːdsiːd"},{"name":"slice","trans":["n. Flakes; parts; kitchen knife, fire spatula vt. Cut; divide... into parts; slice... into thin slices vi. incise; cut"],"usphone":"slaɪs","ukphone":"slaɪs"},{"name":"circle","trans":["n. Cycle, cycle; circle; circle; round object vi. Circling, spinning; circling vt. Draw a circle; move around..."],"usphone":"ˈsɜːkl","ukphone":"ˈsɜːkl"},{"name":"couch","trans":["n. Sleeper chair, couch; bed; daybed vi. crouching, ambush; lying vt. Lie down; express; bend down n. (Couch) name; (English) Couch"],"usphone":"kaʊtʃ","ukphone":"kaʊtʃ"},{"name":"cross","trans":["n. Cross, cross; cross, crucifix vi. cross; cross; cross vt. Hybridize; overcome; intersect adj. intersecting; opposites; cynical; angry"],"usphone":"krɒs","ukphone":"krɒs"},{"name":"curl","trans":["vt. Make... curl; roll it up vi. Curly; coiled n. Curly hair; spiral n. (Curl) name; (English) Cole"],"usphone":"kɜːl","ukphone":"kɜːl"},{"name":"jump","trans":["v. Jumping; crossing; moving fast; surging, skyrocketing; abrupt change; omitting; running a red light; raid; having sex; boosting starting (vehicle) n. Jump; skyrocket; drastic change; shock jump; obstacle (in an equestrian game); (bridge) jumping; sexual intercourse n. (Jump) (US) Jiang Pu (name of person)"],"usphone":"dʒʌmp","ukphone":"dʒʌmp"},{"name":"stroll","trans":["v. Walk, hang out; (sports competition) win easily n. Walk, hang out; win easily"],"usphone":"strəʊl","ukphone":"strəʊl"},{"name":"alone","trans":["adj. Alone; alone; alone; alone; alone; only adv. Alone; alone; alone; only, only; only...; only; alone; alone"],"usphone":"əˈləʊn","ukphone":"əˈləʊn"},{"name":"cold","trans":["adj. cold; frigid, unenthusiastic; unconscious n. cold; cold; cold adv. wholly"],"usphone":"kəʊld","ukphone":"kəʊld"},{"name":"lonely","trans":["adj. lonely; remote n. Lonely person"],"usphone":"ˈləʊnli","ukphone":"ˈləʊnli"},{"name":"loon","trans":["n. [bird] diving bird; lazy person; idiot n. (Loon) name; (English, Sweden) Long"],"usphone":"luːn","ukphone":"luːn"},{"name":"swam","trans":["v. swimming, floating; soaking; spinning, dizzy (past tense of swim)"],"usphone":"swæm","ukphone":"swæm"},{"name":"warm","trans":["adj. Warm; passionate vi. Sympathy; Excitement; Warmth vt. Excite...; make... warm; make... interested n. Warm; heat n. (Warm) person's name; (English) worm; (d) wam"],"usphone":"wɔːm","ukphone":"wɔːm"},{"name":"ghost","trans":["n. Ghost, ghost vt. Commit to work; catch a knife for...; write for people vi. Ghostwriting for someone else"],"usphone":"ɡəʊst","ukphone":"ɡəʊst"},{"name":"Halloween","trans":["n. Eve of Halloween (refers to the night of October 31)"],"usphone":"ˌhæləʊˈiːn","ukphone":"ˌhæləʊˈiːn"},{"name":"pumpkin","trans":["n.Pumpkin"],"usphone":"ˈpʌmpkɪn","ukphone":"ˈpʌmpkɪn"},{"name":"spider","trans":["n. Spiders; trap setters; tripods"],"usphone":"ˈspaɪdə(r)","ukphone":"ˈspaɪdə(r)"},{"name":"treat","trans":["vt. Treat; treat; discuss; treat as vi. Discuss; Invite; Negotiate n. Invite; Treat n. (Treat) Name; (English) Treat"],"usphone":"triːt","ukphone":"triːt"},{"name":"trick","trans":["n. Tricks; Pranks; Tricks; Tricks; Scams; Fraud vt. Deceive; deceive; decorate; dress up vi. deceiving; teasing adj. Stunt; fraudulent; deceptive n. (trick) person name; (English) trick"],"usphone":"trɪk","ukphone":"trɪk"},{"name":"bear","trans":["v. endure, bear; be unfit for something; bear responsibility; bear responsibility; bear (emotion, especially bad mood); support; display; carry; (car, boat) transport; birth (child); actually, blossom (formal); turn; take a turn; be proportionate (by name, title); perform; have (mark, characteristics); blow; have (name or title); write; have (similarity or relationship); generate (interest) n. bear; bear (interest) n. bear; sell (stock) Empty person; (informal) uneducated person; heavy man; (informal) “polar bear” (Russian nickname); ( informal) police; tricky things; grumpy n. (Bear) (US) Bell (name)"],"usphone":"beə(r)","ukphone":"beə(r)"},{"name":"rabbit","trans":["n. Bunnies, hares vt. Let's... go to hell vi. Hare hunting"],"usphone":"ˈræbɪt","ukphone":"ˈræbɪt"},{"name":"dry","trans":["adj. Dry; thirsty; boring and tasteless; prohibited vt. Dry... vi. Dry n. Dry n. (Dry) person's name; (France) Delhi"],"usphone":"draɪ","ukphone":"draɪ"},{"name":"mix","trans":["v. (Make) mix; prepare; participate; compatibility, get along peacefully; socialize; mix recording; mix; juxtapose; combine; (informal) fight n. Mix; mixed; mixed; mixed groups of people; confusion; ratio of ingredients; ingredients; mixing, mixing; music composition, concert; superposition of images n. (Mix) (US, Russia, Pakistan) Meeks (name of person)"],"usphone":"mɪks","ukphone":"mɪks"},{"name":"mud","trans":["n. Mud; slander; (informal) cheers v. Stain, paint with mud"],"usphone":"mʌd","ukphone":"mʌd"},{"name":"sand","trans":["n. Sand; sand; sandbar; beach; sand vt. Sprinkle sand on; cover with sand; use sandpaper or the like to flatten or polish something; cover the ground with sand; mix... with sand vi. Name of person blocked by sand n. (Sand); (England, Germany, Italy, Finn, Luo, Jie, No) Sander; (Sweden) Sander; (France) Sang"],"usphone":"sænd","ukphone":"sænd"},{"name":"scoop","trans":["n. Spoons, shovels; one spoon (amount); exclusive news; exaggerated slide-ups v. Use a spoon; pick up; get the first report; win; glide"],"usphone":"skuːp","ukphone":"skuːp"},{"name":"shape","trans":["n. Shape; Model; Body; Concretization vt. Form; shape, shape; conform to vi. Form; shape; grow n. (Shape) person's name; (Sweden) Sharpe"],"usphone":"ʃeɪp","ukphone":"ʃeɪp"},{"name":"act","trans":["v. Action; Performance; Function; Acting (Role); Acting; Pretending; Acting; Pretending; Act (or Routine, etc.); Act; Judgment; Meeting Minutes; Performance; Performance; Performance Group abbr. active (active); actor (actor); actual (actual)"],"usphone":"ækt","ukphone":"ækt"},{"name":"line","trans":["n. Route, route; row; rope vt. Line up; line up; mark with lines; make... wrinkle vi. Line up; stand in a row n. (Line) names; (English) Ryan; (Russian) Ligne"],"usphone":"laɪn","ukphone":"laɪn"},{"name":"nervous","trans":["adj. nervous; nervous; nervous; strong"],"usphone":"ˈnɜːvəs","ukphone":"ˈnɜːvəs"},{"name":"prop","trans":["n. Pillar, support; supporter; prop; pillar forward (in rugby); (grammatical) structural terms; sudden stop (when a horse runs fast); props (in a drama, movie); (informal) prop manager; (informal, aircraft) propeller v. support; placement; hold (something) with...; (straighten the front legs of a horse) sudden stop"],"usphone":"prɒp","ukphone":"prɒp"},{"name":"bakery","trans":["n.Bakeries"],"usphone":"ˈbeɪkəri","ukphone":"ˈbeɪkəri"},{"name":"fire station","trans":["fire station"],"usphone":"ˈfaɪə steɪʃ(ə)n","ukphone":"ˈfaɪə steɪʃ(ə)n"},{"name":"neighborhood","trans":["n. Neighborhood; Neighborhood; Proximity; Neighborhood"],"usphone":"'neɪbə,hʊd","ukphone":"'neɪbə,hʊd"},{"name":"street","trans":["n. Street adj. n. (Street) name of the street; (English, Portuguese) Street; (German) Strait"],"usphone":"striːt","ukphone":"striːt"},{"name":"freeway","trans":["n. Expressway"],"usphone":"ˈfriːweɪ","ukphone":"ˈfriːweɪ"},{"name":"move","trans":["v. Move; Change; Progress; Act; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move"],"usphone":"muːv","ukphone":"muːv"},{"name":"store","trans":["n. Stores; reserves, storage; warehouses vt. Storage, storage n. (Store) name of person; (DE) Storey"],"usphone":"stɔː(r)","ukphone":"stɔː(r)"},{"name":"learn","trans":["vt. Learn; Learn; Recognize vi. Learn; learn"],"usphone":"lɜːn","ukphone":"lɜːn"},{"name":"preschool","trans":["adj. Those under school age; those in preschool, n. kindergarten, nursery school before enrollment"],"usphone":"ˈpriːskuːl","ukphone":"ˈpriːskuːl"},{"name":"bored","trans":["adj. Boring; uninteresting; annoying v. to bore (past tense of bore); bothersome"],"usphone":"bɔːd","ukphone":"bɔːd"},{"name":"gray","trans":["adj. gray; pale; gray-haired; gloomy n. gray; dim light vi. Become grey or grey vt. Make gray or gray n. (Gray) person's name; (Italian) Gray; (English, French, Portuguese, Swedish) Grey"],"usphone":"ɡreɪ","ukphone":"ɡreɪ"},{"name":"lizard","trans":["n. Lizard; lizard-like reptile n. (Lizard) name; (France) Rizal"],"usphone":"ˈlɪzəd","ukphone":"ˈlɪzəd"},{"name":"play","trans":["vt. Game; play; play; compete with... vi. Play; play; perform; participate in contests n. Games; Contest; Screenplay n. (Play) Name of person; (France, Sweden) Play"],"usphone":"pleɪ","ukphone":"pleɪ"},{"name":"broccoli","trans":["n. Cauliflower; broccoli n. (Broccoli) (Italy, US) Broccoli (personal name)"],"usphone":"ˈbrɒkəli","ukphone":"ˈbrɒkəli"},{"name":"gorilla","trans":["n. Gorillas"],"usphone":"ɡəˈrɪlə","ukphone":"ɡəˈrɪlə"},{"name":"pirate","trans":["n. Pirate, marauders at sea; pirates, patent infringers; persons (or organizations) that illegally produce television or radio programs; corrupt persons, offenders v. piracy, misappropriation; looting (ships); looting (ships) adj. pirated"],"usphone":"ˈpaɪrət","ukphone":"ˈpaɪrət"},{"name":"vampire","trans":["n.Vampires; [spine] vampire bats"],"usphone":"ˈvæmpaɪə(r)","ukphone":"ˈvæmpaɪə(r)"},{"name":"bring","trans":["vt. bring; bring; induce; cause; put someone in a situation or situation n. (Bring) person's name; (English, Sweden) Bollin"],"usphone":"brɪŋ","ukphone":"brɪŋ"},{"name":"buddy","trans":["n. Partner, good friend; close friend; little boy vi. Make good friends and make friends n. (Buddy) name; (English) Buddy"],"usphone":"ˈbʌdi","ukphone":"ˈbʌdi"},{"name":"choose","trans":["vt. Choose and decide vi. choose, pick"],"usphone":"tʃuːz","ukphone":"tʃuːz"},{"name":"climb","trans":["v. Climbing; climbing; climbing; (plants growing along a wall or shelf); promotion; (road) inclination upward; climbing; climbing in (or climbing out) with effort n. Climbing; adding value; improving (position or social status); climbing (ranking); mountain (to be climbed in mountaineering or climbing); mountain trail; (of an airplane) climbing"],"usphone":"klaɪm","ukphone":"klaɪm"},{"name":"night","trans":["n. Night, night; dark, dark adj. At night, at night"],"usphone":"naɪt","ukphone":"naɪt"},{"name":"blackberry","trans":["n. [Horticulture] Blackberries"],"usphone":"ˈblækbəri","ukphone":"ˈblækbəri"},{"name":"cup","trans":["n. Cups; trophies; wine glasses vt. Shape it into a cup; for... a cupping pot"],"usphone":"kʌp","ukphone":"kʌp"},{"name":"pick","trans":["vi. Picking; picking; digging vt. Picking; selecting; picking; excavating n. Select; Crane Hoe; Digging; Covering n. (Pick) person's name; (English, French, German, Czech, German, Czech, Swedish, Swedish) Pique"],"usphone":"pɪk","ukphone":"pɪk"},{"name":"pie","trans":["n. Pies; pie charts; people who love to talk vt. clutter"],"usphone":"paɪ","ukphone":"paɪ"},{"name":"plenty","trans":["n. Abundant, abundant; sufficient adj. Enough, lots of advs. Enough n. (Plenty) names; (English) Plenty"],"usphone":"ˈplenti","ukphone":"ˈplenti"},{"name":"cookie","trans":["n.Cookies; small desserts"],"usphone":"ˈkʊki","ukphone":"ˈkʊki"},{"name":"know","trans":["vt. Know; know; understand vi. Understand; Familiar; Convinced"],"usphone":"nəʊ","ukphone":"nəʊ"},{"name":"password","trans":["n. Password; password"],"usphone":"ˈpɑːswɜːd","ukphone":"ˈpɑːswɜːd"},{"name":"want","trans":["vt. need; hope; should; lack n. Need; Lack; Poverty; Necessity vi. required; missing"],"usphone":"wɒnt","ukphone":"wɒnt"},{"name":"cage","trans":["n. Cage, animal cage; cell, prison vt. Put... in a cage; imprison... n. (Cage) name; (France) Kage; (English) Cage"],"usphone":"keɪdʒ","ukphone":"keɪdʒ"},{"name":"children","trans":["n. children (plural of child)"],"usphone":"ˈtʃɪldrən","ukphone":"ˈtʃɪldrən"},{"name":"flew","trans":["v. fly, fly (past tense of fly) n. (Flew) (English, American) Flu (personal name)"],"usphone":"fluː","ukphone":"fluː"},{"name":"path","trans":["n. Roads; paths; tracks"],"usphone":"pɑːθ","ukphone":"pɑːθ"},{"name":"playground","trans":["n. Playgrounds, playgrounds; playgrounds"],"usphone":"ˈpleɪɡraʊnd","ukphone":"ˈpleɪɡraʊnd"},{"name":"safe","trans":["adj. Safe; reliable; safe n. Safe; refrigerator; closet n. (Safe) name of person; (a few) Safi"],"usphone":"seɪf","ukphone":"seɪf"},{"name":"born","trans":["v. Birth; appearance (past participle of bear) adj. natural; born; gifted; created n. (Born) (beauty, virtue, love, England, Dan), Born (name of person)"],"usphone":"bɔːn","ukphone":"bɔːn"},{"name":"real","trans":["adj. Actual; real; real adv. Truly; truly n. Reality; real number n. (Real) name; (German, Spanish, Portuguese, French) real; (English) riel"],"usphone":"ˈriːəl; rɪəl","ukphone":"ˈriːəl; rɪəl"},{"name":"reindeer","trans":["n. [spine] [animal husbandry] reindeer"],"usphone":"ˈreɪndɪə(r)","ukphone":"ˈreɪndɪə(r)"},{"name":"sled","trans":["n. Sleigh vi. Ride a sleigh; use a sleigh to transport vt. Use a cotton picker to pick; use a sleigh to transport"],"usphone":"sled","ukphone":"sled"},{"name":"travel","trans":["v. Long-distance travel; passing through (a region); (informal) able to withstand travel; (object, radiation); moving (object, radiation); withstanding long-distance transportation; widely distributed; loved; walking (with ball); (informal) rapid movement of vehicles n. Travel (equipment); range of motion (or speed, mode) (of machine components)"],"usphone":"ˈtrævl","ukphone":"ˈtrævl"},{"name":"weigh","trans":["vt. Weigh; consider; weigh... vi. Weight is...; important; becomes a burden of...; anchoring n. Trade-off; weighing"],"usphone":"weɪ","ukphone":"weɪ"},{"name":"breath","trans":["n. Breathing, breath; one breath, one breath (breathing); instantaneous, instantaneous; breeze; signs; no sound, sound"],"usphone":"breθ","ukphone":"breθ"},{"name":"catching","trans":["v. Intercept (thrower, etc.); catch (falling person); catch; capture (person or animal trying to escape); catch (person in front) (present participle of catch) adj. (informal) (disease) infectious; (emotional or emotional) infectious"],"usphone":"ˈkætʃɪŋ","ukphone":"ˈkætʃɪŋ"},{"name":"swimming","trans":["n. Swimming; dizziness adj. Swimming; swimming; good at swimming; dizzy v. swimming; floating; spinning (in the form of swimming)"],"usphone":"ˈswɪmɪŋ","ukphone":"ˈswɪmɪŋ"},{"name":"hear","trans":["vt. Hear, listen; hear; hear vi. listen; hear"],"usphone":"hɪə(r)","ukphone":"hɪə(r)"},{"name":"see","trans":["vt. Seeing; understanding; understanding; observing; visiting vi. See; see; understand n. (See) names; (English) Xi; () Sai; (Germany) Ze"],"usphone":"siː","ukphone":"siː"},{"name":"senses","trans":["n. [physiology] feeling; meaning; reason; judgment (plural of sense) v. understanding; feeling; understanding (the single three forms of sense) n. (Senses) person's name; (English) sense"]},{"name":"smell","trans":["n. Smell, smell; smell v. smell, smell; have... smell; detect; emit... n. (Smell) (American, Russian, English, India, New) Smell (name of person)"],"usphone":"smel","ukphone":"smel"},{"name":"taste","trans":["n. Taste; taste; aesthetics vt. Taste; experience vi. Tastes; has the taste of... n. (Taste) person's name; (France) Taster"],"usphone":"teɪst","ukphone":"teɪst"},{"name":"touch","trans":["v. Touch; tap (button); tap (instrument); touch (instrument); touch (ball); touch (curve, surface); handle (particularly in a harmful way); cause harm (someone); use (storage); consume (food or drink); act; involve; clearly visible (quality, characteristics); reveal appearance; touch; (informal) mildly insane; (informal) reach (a certain level or amount) n. touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; Elasticity (of instrument keys, strings); Light touch (of pens, pencils, etc.); Test; Slight; Technique; Skills; (Percussion of the chimes) Middle) Less modulation of Zhong Le; retouching; (informal) asking for money n. (Touch) (card) Du (name of person)"],"usphone":"tʌtʃ","ukphone":"tʌtʃ"},{"name":"beard","trans":["n. Beard (on the chin); jaw hair; (informal) female partner in the name of a gay man; stand-in v. Confronting or opposing (powerful person); grasping...'s beard; providing a beard n. (Beard) (American, English, Canadian, French) Beard (person's name)"],"usphone":"bɪəd","ukphone":"bɪəd"},{"name":"hairy","trans":["adj. Hairy; hairy; long haired n. (Hairy) name; (French) Airy"],"usphone":"ˈheəri","ukphone":"ˈheəri"},{"name":"shave","trans":["vi. shave, shave vt. Shave, shave; trim; cut into thin slices; shave n. Shave your face; shave your face; get away by chance and survive; razor, scraper"],"usphone":"ʃeɪv","ukphone":"ʃeɪv"},{"name":"smooth","trans":["adj. Smooth; smooth; smooth vt. Smooth; remove (barriers, etc.); make elegant; ease n. Smooth part; flat ground vi. Become calm; become smooth adv. smoothly; smoothly; smoothly"],"usphone":"smuːð","ukphone":"smuːð"},{"name":"wild","trans":["adj. wild; barbaric; fanatical; desolate n. Wilderness adv. Insanely; randomly n. (Wild) name; (English) Wilder; (France, Germany, Portugal, Czech, Russian) Wild"],"usphone":"waɪld","ukphone":"waɪld"},{"name":"change","trans":["v. Change, transform, (make) different; (make) transform; replace, replace; exchange; currency exchange; exchange... for change; refund n. Change, change; substitute; change for laundry; change, change; change; transfer; new experience; emergence of a new phase of the moon"],"usphone":"tʃeɪndʒ","ukphone":"tʃeɪndʒ"},{"name":"mean","trans":["v. Intent; meaning; intention; cause; very familiar; seriously; significant; foretell adj. stingy; mean; vicious; ferocious; average; humble; humble; of humble origin; (informal) effective n. average; moderate n. (Mean) () cotton (name)"],"usphone":"miːn","ukphone":"miːn"},{"name":"silent","trans":["adj. silent; silent; unrecorded n. Silent film"],"usphone":"ˈsaɪlənt","ukphone":"ˈsaɪlənt"},{"name":"sound","trans":["n. Sound; Noise; Sound; Strait; Hearing Range; Medical Probes; Radio Broadcasting; Sound Effects v. (Make) Sound; Hear; Sound; Hear (Diagnosis); Echo; Detect; Test; Declare; (Medical) Check with a Probe; (Especially Whales) Dive into the Deep Sea adj. Reasonable; non-destructive; capable; adequate; thorough; sleeping; well-funded; (informal) excellent; strict; sound adv. thoroughly, heartily"],"usphone":"saʊnd","ukphone":"saʊnd"},{"name":"word","trans":["n. [language] words; words; messages; promises; orders vt. Use words to express n. (Word) person's name; (English) Ward"],"usphone":"wɜːd","ukphone":"wɜːd"},{"name":"bumpy","trans":["adj. bumpy; bumpy"],"usphone":"ˈbʌmpi","ukphone":"ˈbʌmpi"},{"name":"monkey","trans":["n. Monkeys; urchins vi. Bullshit; trick or treat vt. mockery"],"usphone":"ˈmʌŋki","ukphone":"ˈmʌŋki"},{"name":"mossy","trans":["adj. moss-covered, moss-covered, mossy; old-school, extremely conservative"],"usphone":"ˈmɒsi","ukphone":"ˈmɒsi"},{"name":"deer","trans":["n. Deer n. (Deer) person's name; (English) Deer"],"usphone":"dɪə(r)","ukphone":"dɪə(r)"},{"name":"mouse","trans":["n. Mouse; mouse; timid and shy person vt. Discovery vi. Mousetraking; spying"],"usphone":"maʊs","ukphone":"maʊs"},{"name":"owl","trans":["n. Owls; lords; people accustomed to night activities"],"usphone":"aʊl","ukphone":"aʊl"},{"name":"squirrel","trans":["n. Squirrel; squirrel fur vt. repositioned"],"usphone":"ˈskwɪrəl","ukphone":"ˈskwɪrəl"},{"name":"bright","trans":["adj. bright, vivid; intelligent; pleasant adv. Brightly; brightly; cheerfully n. Front lights n. (Bright) person's name; (English) Bright"],"usphone":"braɪt","ukphone":"braɪt"},{"name":"fancy","trans":["v. Want to do; love; arrogance; imagine; think; think (especially speed racing) think... to win; (showing surprise or opposition) really didn't expect n. fantasy; imagination; hobby; the most popular person or animal (in sports such as horse racing); enthusiasts (of sports such as boxing); fancy cakes or cookies; (16th and 17th century musical terms) Fantasia adj. complex; expensive; delicate, fancy; imaginative; (food) high quality; (flower) variegated; (animal) n. (Fancy) fan (name) for viewing"],"usphone":"ˈfænsi","ukphone":"ˈfænsi"},{"name":"scary","trans":["adj. (thing) scary; scary; scary; (person) fearful; alarmed; timid"],"usphone":"ˈskeəri","ukphone":"ˈskeəri"},{"name":"shiny","trans":["adj. smooth, shiny, shiny"],"usphone":"ˈʃaɪni","ukphone":"ˈʃaɪni"},{"name":"striped","trans":["adj. striped; spotted v. stripped (past participle of strip)"],"usphone":"straɪpt","ukphone":"straɪpt"},{"name":"brought","trans":["v. bring (past participle of bring)"],"usphone":"brɔːt","ukphone":"brɔːt"},{"name":"feast","trans":["n. Feasts, banquets; (sensory) enjoyment; festivals v. Indulge in, feast; feast; go to a banquet"],"usphone":"fiːst","ukphone":"fiːst"},{"name":"soup","trans":["n. Soup, soup; horsepower vt. Accelerate; increase horsepower"],"usphone":"suːp","ukphone":"suːp"},{"name":"stone","trans":["n. Stones; stones; [treasure] gemstones adj. Stone, stone vt. Throw stones; use stones to lay stones n. (Stone) names; (Czech) Storne; (Sweden) Stones; (English) Stone"],"usphone":"stəʊn","ukphone":"stəʊn"},{"name":"band","trans":["n. Band, ring; [object] band; band (playing pop music) vi. Tie with a belt; embellishment n. N. Band; team; group"],"usphone":"bænd","ukphone":"bænd"},{"name":"music","trans":["n. Music, songs"],"usphone":"ˈmjuːzɪk","ukphone":"ˈmjuːzɪk"},{"name":"quiet","trans":["adj. Quiet; stable; motionless; docile n. Quiet; peaceful vt. Calm; comfort vi. pacify"],"usphone":"ˈkwaɪət","ukphone":"ˈkwaɪət"},{"name":"swamp","trans":["n. Marshes, lowlands, puddles; wetlands; (used to highlight) the degree of flooding in a certain area; dilemmas v. unbearable, exhausting, and overwhelmed; flooded, submerged; (boats) engulfed and sunken; left in trouble"],"usphone":"swɒmp","ukphone":"swɒmp"},{"name":"whole","trans":["adj. complete; pure n. Whole; all"],"usphone":"həʊl","ukphone":"həʊl"},{"name":"clean","trans":["adj. Clean, clean; innocent vt. Make it clean vi. Clean, clean adv. Completely n. Clean n. (Clean) person's name; (English) Klein"],"usphone":"kliːn","ukphone":"kliːn"},{"name":"healthy","trans":["adj. Healthy, robust; beneficial to the body and mind; wise, reasonable; well-functioning, thriving and developed; numerous, impressive"],"usphone":"ˈhelθi","ukphone":"ˈhelθi"},{"name":"soil","trans":["n. Land; soil; country; manure; agriculture; hotbed vt. Dirty; humiliate vi. Getting dirty"],"usphone":"sɔɪl","ukphone":"sɔɪl"},{"name":"grew","trans":["v. Grow, cultivate (past tense of grow) n. (Grew) person's name; (Finn) Greve; (English, Portuguese) Guru"],"usphone":"ɡruː","ukphone":"ɡruː"},{"name":"like","trans":["prep. Like, like; in a way that conforms to...; has the characteristics of...; (used to ask) how; for example, like v. likes; wants; wants; wants; wants; wants; wishes. Seems; like; like... n. Hobbies (often plural); similar or similar person or thing adj. Similar, similar; (image) realistic adv. (informal) Possible; as if said; same as n. (Like) (US, Russian, India, English, Pakistan), Rikai (name of person)"],"usphone":"laɪk","ukphone":"laɪk"},{"name":"odd","trans":["adj. Odd; weird; leftover; temporary; scattered n. Odd; Strange; Strange thing n. (Odd) person name; (English, Western, Norwegian, Swedish) Aude"],"usphone":"ɒd","ukphone":"ɒd"},{"name":"strange","trans":["adj. Strange; strange; layman adv. Strange; strange place, callously n. (Strange) person name; (English) Strange; (Sweden, Serbia) Stranger"],"usphone":"streɪndʒ","ukphone":"streɪndʒ"},{"name":"tadpole","trans":["n. tadpole"],"usphone":"ˈtædpəʊl","ukphone":"ˈtædpəʊl"},{"name":"baseball","trans":["n. Baseball; baseball sport"],"usphone":"ˈbeɪsbɔːl","ukphone":"ˈbeɪsbɔːl"},{"name":"batter","trans":["v. Continuous punching; abusive beating; bashing; (wall) tilting backwards; forming a slope; (wind, rain, or storm, etc.) attacks, damaging n. paste (made from eggs, milk, flour, etc.); batter; inclination of the wall; (printing) wear and tear; abuse; carnival n. (Batter) (American, English, Canada) Battle (name of person)"],"usphone":"ˈbætə(r)","ukphone":"ˈbætə(r)"},{"name":"catcher","trans":["n. Catcher, catcher; receiver"],"usphone":"ˈkætʃə(r)","ukphone":"ˈkætʃə(r)"},{"name":"pitcher","trans":["n. Pitcher; big jug n. (Pitcher) name; (English) Pitcher"],"usphone":"ˈpɪtʃə(r)","ukphone":"ˈpɪtʃə(r)"},{"name":"player","trans":["n. Athletes, contestants; gamers, game makers; performers, performers; players"],"usphone":"ˈpleɪə(r)","ukphone":"ˈpleɪə(r)"},{"name":"team","trans":["n. Team; Group vt. Make cooperation vi. Cooperation n. (Team) name; ()"],"usphone":"tiːm","ukphone":"tiːm"},{"name":"birdhouse","trans":["n. Poultry house; small aviary"],"usphone":"'bɜːdhaʊs","ukphone":"'bɜːdhaʊs"},{"name":"bus stop","trans":["bus stop"],"usphone":"ˈbʌs stɒp","ukphone":"ˈbʌs stɒp"},{"name":"home","trans":["n. Home, home; place of origin; hometown; shelter adv. At home, go home; deeply adj. Domestic, domestic; effective vt. Return home, return home n. (Home) name; (De, Finn) Holme; (English, Nee) Holm"],"usphone":"həʊm","ukphone":"həʊm"},{"name":"log","trans":["n. Logs; logs (navigation or flight); (regular or systematic) observation records; ship speedometers; logarithms v. load (situation) into navigation (or flight) logs; (ship, aircraft) reach (a certain range, speed); (pilot) flight (a certain period of time); make a systematic record of...; harvest (forest area) trees"],"usphone":"lɒɡ","ukphone":"lɒɡ"},{"name":"mailbox","trans":["n. Mailboxes; mailboxes"],"usphone":"ˈmeɪlbɒks","ukphone":"ˈmeɪlbɒks"},{"name":"blunt","trans":["adj. Blunt, not sharp; blunt; blunt vt. Name of the person who sluggishly n. (Blunt); (English) Brent"],"usphone":"blʌnt","ukphone":"blʌnt"},{"name":"eyesight","trans":["n. eyesight; eyesight"],"usphone":"ˈaɪsaɪt","ukphone":"ˈaɪsaɪt"},{"name":"gills","trans":["n. Fish gills (plural of gill); bacterial pleats; [anatomy] under-cheek flesh; gill v. removal of gills and internal organs; catch with gill nets (three single forms of gill)"]},{"name":"stripes","trans":["n. Striped cloth; striped cloth (stripe plural form) v. Add stripes to... (three single forms of stripe)"],"usphone":"st'raɪps","ukphone":"st'raɪps"},{"name":"coat","trans":["n. Coat vt. Cover the surface of... n. (Coat) person's name; (France) Koa"],"usphone":"kəʊt","ukphone":"kəʊt"},{"name":"pet","trans":["n. Pets; angry; loved ones vt. Love vi. Angry; caressing adj. Favorite n. (Pet) person's name; (Russian) Pet; ()"],"usphone":"pet","ukphone":"pet"},{"name":"shoe","trans":["n. Shoes; horseshoes; outer tube vt. Put on... shoes; wear... shoes n. (Shoe) name of person; (English) Hugh"],"usphone":"ʃuː","ukphone":"ʃuː"},{"name":"toy","trans":["n. Toys; small ornaments; worthless items vi. Play; flirt; treat adj casually. As a toy; n. (Toy) (US) Toy (name of person) that looks like a toy"],"usphone":"tɔɪ","ukphone":"tɔɪ"},{"name":"bush","trans":["n. Shrubs; dwarf bushes vt. Decorate with shrubs; exhausts... vi. Overgrown; grows thickly adj. The one that grows low like a bush; the one that grows wild"],"usphone":"bʊʃ","ukphone":"bʊʃ"},{"name":"crawl","trans":["vi. crawling; walking on one's feet vt. crawling; walking slowly n. Crawling; fish pond; prostrate"],"usphone":"krɔːl","ukphone":"krɔːl"},{"name":"woods","trans":["n. (forest) woods, forest; wood v. for timber; covering with trees (3rd person singular of wood) n. (Woods) (US, Canada, English) Woods (personal name)"]},{"name":"birthday","trans":["n. Birthday, birthday; day of birth"],"usphone":"ˈbɜːθdeɪ","ukphone":"ˈbɜːθdeɪ"},{"name":"cake","trans":["n. Cake; block; total benefit vt. Make agglomerates vi. N. (Cake) name formed into a block; (English) Keck; (Sai) Chakai"],"usphone":"keɪk","ukphone":"keɪk"},{"name":"good","trans":["adj. Good; excellent; pleasant; pious n. Benefits; good deeds; acts of generosity adv. Good n. (Good) name; (English) Good; (Sweden) Gord"],"usphone":"ɡʊd","ukphone":"ɡʊd"},{"name":"make","trans":["vt. Make; carry out; arrange, prepare, organize; manufacture; think; obtain; form; arrange; cause; constitute vi. Start; advance; grow; be made n. Manufactured; structure; temperament n. (Make) person's name; (Sai, South Africa) Mark"],"usphone":"meɪk","ukphone":"meɪk"},{"name":"sweet","trans":["adj. Sweet; sweet; aromatic; kind; fun; aromatic; baby () cool name; (English) Sweet; (English) Sweet"],"usphone":"swiːt","ukphone":"swiːt"},{"name":"grub","trans":["n. Maggots (insects), larvae; small caterpillars; food v. excavate, search; excavate (from the soil); exhume (ground) roots and tree stumps; clumsy search; work hard; work hard to get n. (Grub) (American) Grub (name of person)"],"usphone":"ɡrʌb","ukphone":"ɡrʌb"},{"name":"silky","trans":["adj. silky; silky; gentle; silky"],"usphone":"ˈsɪlki","ukphone":"ˈsɪlki"},{"name":"slow","trans":["adj. Slow; decelerated; slow vi. Slowing down; becoming depressed vt. slow down; hinder adv. slowly; slowly n. (Slow) person's name; (English) Slow"],"usphone":"sləʊ","ukphone":"sləʊ"},{"name":"surprise","trans":["n. Surprise, surprise; sudden attack vt. surprise; surprise attack adj. Surprising"],"usphone":"səˈpraɪz","ukphone":"səˈpraɪz"},{"name":"wiggly","trans":["adj. Wobbling; swinging from side to side; rippling; creeping"],"usphone":"ˈwɪɡli","ukphone":"ˈwɪɡli"},{"name":"give","trans":["vt. give; produce; compromise; organize; grant n. Elasticity; Flexibility vi. Donate; Oriented; Resilient; Warming Climate n. (Give) Name; (Italy) Givet"],"usphone":"ɡɪv","ukphone":"ɡɪv"},{"name":"pile","trans":["n. Heaps; large numbers; building complexes vt. Accumulated; piling in vi. crowding; accumulation; accumulation n. (Pile) person's name; (West) Pillay; (English) Pyle"],"usphone":"paɪl","ukphone":"paɪl"},{"name":"puzzle","trans":["v. Confuse, (make) confuse; think hard (because of confusion); make... difficult n. Mysteries, intellectual games; mosaic toys; unsolved mysteries; enigmatic people or things"],"usphone":"ˈpʌzl","ukphone":"ˈpʌzl"},{"name":"bill","trans":["n. [Act] Act; Advertisements; Bills; [Financial] Notes; Banknotes; Inventory vt. Announcements; Billing; Promoting with Posters"],"usphone":"bɪl","ukphone":"bɪl"},{"name":"check","trans":["vt. Check, check; stop, suppress; check...; shipping vi. Verify, check; suspend; check; [chess] General n. Cheque; stop, suppress; test, check n. (English) check (name of person)"],"usphone":"tʃek","ukphone":"tʃek"},{"name":"menu","trans":["n. Menu meals"],"usphone":"ˈmenjuː","ukphone":"ˈmenjuː"},{"name":"order","trans":["n. Order; Order; Rules; [Trade] Order vt. Order; Organize; Order vi. Order; Order"],"usphone":"ˈɔːdə(r)","ukphone":"ˈɔːdə(r)"},{"name":"server","trans":["n. Delivery player; servant; servant; waiter; computer network server; serving utensils; butler, assistant sacrifice; computer host; serving spoon n. (Server) (US, Russian, Spanish, French) Cerwell (person name)"],"usphone":"ˈsɜːvə(r)","ukphone":"ˈsɜːvə(r)"},{"name":"egg","trans":["n.Eggs; eggs; guys; eggs vt. Inciting; instigating n. (Egg) name; (French, English) Egg"],"usphone":"eɡ","ukphone":"eɡ"},{"name":"seed","trans":["n. Seed; basis; semen; germination; offspring; origin vt. Sowing; fruiting; maturing; leaving... seeds vi. Sowing; (plant) fruiting n. (Seed) person's name; (English) seed"],"usphone":"siːd","ukphone":"siːd"},{"name":"sprout","trans":["vi. Germinate; grow shoots vt. Germinate; sprout n. Sprout; sprout; sprout; sprout n. (Sprout) person's name; (English) Sprout"],"usphone":"spraʊt","ukphone":"spraʊt"},{"name":"dock","trans":["n. Wharf; dock; dock; dock; bone and flesh of the tail vt. Let's rely on the pier; shorten vi. Dock in Dock n. (Dock) Program Dock n. (Dock) Name; (Old) Duo; (English, French, Swedish) Dock"],"usphone":"dɒk","ukphone":"dɒk"},{"name":"spot","trans":["n. Location; spot vt. Recognize; stain; illuminate with light vi. Stained; full of spots adj. Onsite; spot trading adv. accurately; exactly"],"usphone":"spɒt","ukphone":"spɒt"},{"name":"surface","trans":["n. Surface; surface; appearance adj. Superficial, superficial vi. Surfaced vt. Make it surface; make it flat n. (Surface) person's name; (English) Suffice"],"usphone":"ˈsɜːfɪs","ukphone":"ˈsɜːfɪs"},{"name":"tricky","trans":["adj. cunning; astute; tricky"],"usphone":"ˈtrɪki","ukphone":"ˈtrɪki"},{"name":"whale","trans":["n. Whales; huge things v. (informal) beating; whaling; causing fiasco n. (Whale) (love) Wheeler (name of person)"],"usphone":"weɪl","ukphone":"weɪl"},{"name":"bark","trans":["n. Bark; dark blue-brown; fur; skin; dog barking vt. Dog barking; screaming; peeling n. (Bark) person's name; (English, Spanish, German, Czech, French, Finland, Sweden) Buck; (Arabic, Russian) Bark"],"usphone":"bɑːk","ukphone":"bɑːk"},{"name":"bump","trans":["n. Lumps, protuberances; impact vi. Collision, impact; bumpy ride vt. Touch, hit; bump adv. Suddenly, violently n. (Bump) person's name; (English, Spanish) Bump"],"usphone":"bʌmp","ukphone":"bʌmp"},{"name":"fern","trans":["n. [Plant] ferns; [Plant] ferns"],"usphone":"fɜːn","ukphone":"fɜːn"},{"name":"ink","trans":["n. Ink, ink; ink; paint; text (or paper media) promotion; (squid's) ink v. Inking...; drawing with ink; applying ink to; signing (contract) n. (Ink) (US, Russian, Latvia) Ink (name of person)"],"usphone":"ɪŋk","ukphone":"ɪŋk"},{"name":"lamb","trans":["n. Lamb, lamb; lamb meat vt. Raising lambs, producing lambs vi. Lamb production, lamb production n. (Lamb) name; (English) Lamb; (German) Lamb"],"usphone":"læm","ukphone":"læm"},{"name":"piece","trans":["n. Blocks; Pieces; Articles; Coins vt. repair; join; fit"],"usphone":"piːs","ukphone":"piːs"},{"name":"closet","trans":["n. Closets; conference rooms, secret rooms; small rooms adj. Secret, private; empty talk vt. Lock... in a private room n. (Closet) person's name; (France) Clause"],"usphone":"ˈklɒzɪt","ukphone":"ˈklɒzɪt"},{"name":"clothes","trans":["n. Clothes"],"usphone":"kləʊðz; kləʊz","ukphone":"kləʊðz; kləʊz"},{"name":"style","trans":["n. Style; fashion; type; font vt. Design; title; make it trendy vi. Design style; decorative painting with a knife n. (Style) person's name; (English) Steyr"],"usphone":"staɪl","ukphone":"staɪl"},{"name":"dinner","trans":["n. Dinner, dinner; banquet; dinner n. (Dinner) name of person; (France) Diné"],"usphone":"ˈdɪnə(r)","ukphone":"ˈdɪnə(r)"},{"name":"fish","trans":["n. Fish; Fish; Pisces; Joint Board; (informal) weirdo; (informal) torpedo v. Fishing, fishing; searching; asking for news; salvage; patching n. (Fish) (American, Love) Fish (name of person) with a junction board"],"usphone":"fɪʃ","ukphone":"fɪʃ"},{"name":"lunch","trans":["n. Lunch v. Eat lunch; provide lunch vi. Eat lunch; provide lunch"],"usphone":"lʌntʃ","ukphone":"lʌntʃ"},{"name":"pizza","trans":["n. Pizza (an Italian-style pancake with filling covered with cheese and ketchup) n. (Pizza) name; (Italian) pizza"],"usphone":"ˈpiːtsə","ukphone":"ˈpiːtsə"},{"name":"snack","trans":["n. Snacks, snacks; fast food; easy to do, small things v. Eat snacks (or fast food, snacks)"],"usphone":"snæk","ukphone":"snæk"},{"name":"burrow","trans":["v. Dig a hole, dig a channel; snuggle; dig through; drill; (make)... drill below...; search (in...); search in depth n. (animal, especially a rabbit) cave, burrow n. (Burrow) (US) Burrow (US) Burrow (name of person)"],"usphone":"ˈbʌrəʊ","ukphone":"ˈbʌrəʊ"},{"name":"octopus","trans":["n.Octopus octopus meat"],"usphone":"ˈɒktəpəs","ukphone":"ˈɒktəpəs"},{"name":"woodchuck","trans":["n. Marmot"],"usphone":"ˈwʊdtʃʌk","ukphone":"ˈwʊdtʃʌk"},{"name":"air","trans":["n. Air, atmosphere; sky; appearance; tune vt. Ventilate and dry; brag vi. venting"],"usphone":"eə(r)","ukphone":"eə(r)"},{"name":"rock","trans":["n.Rock; rock; rock; reef vt. Shake; shake vi. Shake; shake n. (Rock) name; (English, German, Italian, Swedish) Rock"],"usphone":"rɒk","ukphone":"rɒk"},{"name":"sunlight","trans":["n. Sunshine n. (Sunlight) person's name; (English) Sunlight"],"usphone":"ˈsʌnlaɪt","ukphone":"ˈsʌnlaɪt"},{"name":"cheetah","trans":["n. [spine] cheetah"],"usphone":"ˈtʃiːtə","ukphone":"ˈtʃiːtə"},{"name":"run","trans":["vi. Operation; running; operation vt. Management, management; operation; participation n. Running; racing; trends; running route n. (Run) name; (Se) Rune"],"usphone":"rʌn","ukphone":"rʌn"},{"name":"tortoise","trans":["n. Turtles, [spine] turtles (equal to testudo); slow people"],"usphone":"ˈtɔːtəs","ukphone":"ˈtɔːtəs"},{"name":"aunt","trans":["n. Aunt; aunt; aunt"],"usphone":"ɑːnt","ukphone":"ɑːnt"},{"name":"basketball","trans":["n. Basketball; basketball sport"],"usphone":"ˈbɑːskɪtbɔːl","ukphone":"ˈbɑːskɪtbɔːl"},{"name":"neighbor","trans":["n. Neighbors adj. Neighboring vi. Friendly; living next to vt. Neighbor n. (Neighbor) name; (English) Naber"],"usphone":"'neɪbə","ukphone":"'neɪbə"},{"name":"schoolwork","trans":["n. Homework; school work"],"usphone":"ˈskuːlwɜːk","ukphone":"ˈskuːlwɜːk"},{"name":"dance","trans":["n. Dance; dance party; dance music vi. dance; jump; flutter vt. dance; make a jump adj. Dance; n. (Dance) person's name used for dancing; (English) Dance; (French) Dans"],"usphone":"dɑːns","ukphone":"dɑːns"},{"name":"paint","trans":["n. Paint; paint; (informal) makeup; three-second zone; painting function (especially simulating real painting effects); flower horse v. paint; apply makeup (face, skin); apply (liquid) to...; paint with a drawing program; display (aircraft, etc.) (on a radar screen); paint (picture); describe n. (Paint) (US) Pan (name of person)"],"usphone":"peɪnt","ukphone":"peɪnt"},{"name":"slide","trans":["v. Slide; walk smoothly; move quietly; gradually deteriorate; depreciate; decline; fall unwittingly; fall; slide; slide; avalanche; slide; avalanche; slide; slide; slide; avalanche; slide device (of a machine or musical instrument); hairpins; light shoes"],"usphone":"slaɪd","ukphone":"slaɪd"},{"name":"wash","trans":["v. washing; bathing; washable; scrubbing; washing; washing; slapping; soaking; (emotional) shock; washing; washing; painting; standing; eroding n. Washing; waves (left after a boat or plane has passed); sound of waves; thin coating; soap; clothes to be washed; alluvium; scum; form (unbeneficial to both parties); (the Wash) Wash Bay n. (Wash) (American) Wash (name of person)"],"usphone":"wɒʃ","ukphone":"wɒʃ"},{"name":"arms","trans":["n. Arm (plural of arm); [military] weapon; coat of arms v. Armament; equipped (three single forms of arm) n. (Arms) name; (English) Arms"],"usphone":"ɑːmz","ukphone":"ɑːmz"},{"name":"comb","trans":["n. Comb; beehive; cockerel vt. Brush your hair; brush your hair vi. (Waves) Surge"],"usphone":"kəʊm","ukphone":"kəʊm"},{"name":"eight","trans":["num. Eight; eight; eighth; eight years old; eight point adj. Eight's n. 8-person rowing team"],"usphone":"eɪt","ukphone":"eɪt"},{"name":"grocer","trans":["n. Grocery stores; food vendors"],"usphone":"ˈɡrəʊsə(r)","ukphone":"ˈɡrəʊsə(r)"},{"name":"miller","trans":["n. Mill Owner; Mill Worker; Moth n. (Miller) name; (Spanish, Portuguese) Miller; (English, Germany, France, Aisha, Finn, Roe, Sweden, Poland) Miller"],"usphone":"ˈmɪlə(r)","ukphone":"ˈmɪlə(r)"},{"name":"trucker","trans":["n. Truck drivers; those engaged in truck transportation"],"usphone":"ˈtrʌkə(r)","ukphone":"ˈtrʌkə(r)"},{"name":"worker","trans":["n. Worker; worker; worker ant n. (Worker) name; (English) Walker"],"usphone":"ˈwɜːkə(r)","ukphone":"ˈwɜːkə(r)"}]