[{"name":"act","trans":["v. Action; Performance; Function; Acting (Role); Acting; Pretending; Acting; Pretending; Act (or Routine, etc.); Act; Judgment; Meeting Minutes; Performance; Performance; Performance Group abbr. active (active); actor (actor); actual (actual)"],"usphone":"ækt","ukphone":"ækt"},{"name":"bike","trans":["n. Bicycles; bicycles vi. Cyclist (or motorcycle) n. (Bike) name; (Dukou, Sai) Bick"],"usphone":"baɪk","ukphone":"baɪk"},{"name":"dance","trans":["n. Dance; dance party; dance music vi. dance; jump; flutter vt. dance; make a jump adj. Dance; n. (Dance) person's name used for dancing; (English) Dance; (French) Dans"],"usphone":"dɑːns","ukphone":"dɑːns"},{"name":"play","trans":["vt. Game; play; play; compete with... vi. Play; play; perform; participate in contests n. Games; Contest; Screenplay n. (Play) Name of person; (France, Sweden) Play"],"usphone":"pleɪ","ukphone":"pleɪ"},{"name":"sing","trans":["vi. Singing; praising; chirping; calling vt. Sing; praise with poetry; sing to make n. sing; cry; howl n. (Sing) person's name; (old, de, tai) Sing"],"usphone":"sɪŋ","ukphone":"sɪŋ"},{"name":"study","trans":["n. Study, research; subject; study room; study vt. Study; consider; study; scrutinize vi. Research; work n. (Study) person's name; (English) study"],"usphone":"ˈstʌdi","ukphone":"ˈstʌdi"},{"name":"build","trans":["vt. Build; build vi. architecture; construction n. Structure; body shape; physique"],"usphone":"bɪld","ukphone":"bɪld"},{"name":"color","trans":["n. Color; skin tone; pigment; face color vt. Whitewash; color...; distort vi. changes color; acquires color"],"usphone":"ˈkʌlə(r)","ukphone":"ˈkʌlə(r)"},{"name":"dress","trans":["n. Dress; (specific type) clothing v. (for...) dressing; wearing formal clothing; providing clothing for...; cleaning up (wounds); decorating; processing, treating (ingredients, wood, etc.); arranging neatly '; design (hairstyle) n. (dress) (beauty, bar) dress (name of person)"],"usphone":"dres","ukphone":"dres"},{"name":"listen","trans":["vi. Listen, listen; obey, listen n. Listen, listen"],"usphone":"ˈlɪsn","ukphone":"ˈlɪsn"},{"name":"myself","trans":["pron myself; myself; my normal state of health and normal mood"],"usphone":"maɪˈself","ukphone":"maɪˈself"},{"name":"think","trans":["vt. Think; think; remember; imagine; plan vi. think; think n. think; think adj. ideological"],"usphone":"θɪŋk","ukphone":"θɪŋk"},{"name":"bright","trans":["adj. bright, vivid; intelligent; pleasant adv. Brightly; brightly; cheerfully n. Front lights n. (Bright) person's name; (English) Bright"],"usphone":"braɪt","ukphone":"braɪt"},{"name":"cave","trans":["n. Caves, caves; caverns v. collapse; surrender; cave exploration; cave digging int. (Old, school slang) Beware n. (Cave) (beauty, love) Kaif (name of person)"],"usphone":"keɪv","ukphone":"keɪv"},{"name":"crystal","trans":["n. Crystals, crystals; crystals; crystal jewelry adj. Crystalline; transparent, clear n. (Crystal) name; (English) Crystal, Christelle (female name)"],"usphone":"ˈkrɪstl","ukphone":"ˈkrɪstl"},{"name":"drawing","trans":["n. Drawing; Traction; Sketching v. Drawing; Attraction (drawing form); Towing"],"usphone":"ˈdrɔːɪŋ","ukphone":"ˈdrɔːɪŋ"},{"name":"sharp","trans":["adj. Drastic; sharp; intense; agile; harsh adv. sharply; sharply; abruptly n. pointed vt. Speed up; raise the pitch vi. Play n. (Sharp) person's name; (English) Sharp"],"usphone":"ʃɑːp","ukphone":"ʃɑːp"},{"name":"shiny","trans":["adj. smooth, shiny, shiny"],"usphone":"ˈʃaɪni","ukphone":"ˈʃaɪni"},{"name":"cattle","trans":["n. Cows; livestock (cursing words); domestic animals; worthless people n. (Cattle) name; (Italian) Cattley"],"usphone":"ˈkætl","ukphone":"ˈkætl"},{"name":"caution","trans":["n. Be careful, be careful; warn, warn vt. warns"],"usphone":"ˈkɔːʃn","ukphone":"ˈkɔːʃn"},{"name":"elephant","trans":["n. Elephant; large drawing paper"],"usphone":"ˈelɪfənt","ukphone":"ˈelɪfənt"},{"name":"kangaroo","trans":["n.Kangaroos"],"usphone":"ˌkæŋɡəˈruː","ukphone":"ˌkæŋɡəˈruː"},{"name":"turtle","trans":["n. Turtle, turtle; turtle n. (Turtle) name; (English) Turtle"],"usphone":"ˈtɜːtl","ukphone":"ˈtɜːtl"},{"name":"watch","trans":["vt. Observe; Watch; Watch; Watch; Watch; Watch; Watch; Watch; Watch; Watchman vi. Watch, watch; guard, guard"],"usphone":"wɒtʃ","ukphone":"wɒtʃ"},{"name":"armor","trans":["n. Armor; armor, bulletproof steel plate; armored forces, armored vehicles; protective outer layer (animal or plant); defense (emotional, social, etc.) v. armor for...; providing (emotional, etc.) defense for... n. (Armor) (American, English, French) Amor (personal name)"]},{"name":"feather","trans":["n. Feathers vt. Decorate with feathers vi. Long Feather n. (Feather) person's name; (English) Feather"],"usphone":"ˈfeðə(r)","ukphone":"ˈfeðə(r)"},{"name":"scale","trans":["n. Scale; scale; scale; scale; scale; numerical range vi. Measurement; climbing; peeling; scale vt. Measurement; climbing; scraping scales; determining n. (Scale) people's names according to proportion; (Italy) Scales"],"usphone":"skeɪl","ukphone":"skeɪl"},{"name":"shell","trans":["n. Shell, shell; shell; shape vi. peeling; setting the position of the command line interpreter vt. Peeling; bombardment"],"usphone":"ʃel","ukphone":"ʃel"},{"name":"skin","trans":["n. Skin; integument vt. Peeling vi. Healing; long skin"],"usphone":"skɪn","ukphone":"skɪn"},{"name":"spines","trans":["n. [anatomy] spine; spiny processes; body spines (plural of spine)"]},{"name":"big","trans":["adj. Big; important; large adv. Massive land; smooth; exaggerating n. (Big) people's names; (Earth) Big"],"usphone":"bɪɡ","ukphone":"bɪɡ"},{"name":"ear","trans":["n. Ears; ears; ears; hearing vi. () Hear; n. (Ear) name; ()"],"usphone":"ɪə(r)","ukphone":"ɪə(r)"},{"name":"long","trans":["adj. Long; long term; long term; long sound; (human) high; continuous; lengthy; long term; long term (profitable) adv. Over a long period of time; (before or after something) for a long time; (after the noun of time); far away n. Long; long sound; forward securities; long size (of clothing); long pants v. desire, hope n. (long) (US, UK, Ireland) long (name of person)"],"usphone":"lɒŋ","ukphone":"lɒŋ"},{"name":"pointed","trans":["adj. sharp; prominent; sharp; straightforward v. pointing; aiming (past tense of point)"],"usphone":"ˈpɔɪntɪd","ukphone":"ˈpɔɪntɪd"},{"name":"round","trans":["adj. round; curved; integer; perfect; approximate; obese; (sound) round; (ancient, money) large; (ancient, human, or way of speaking) straightforward adv. Spin; around; around; everywhere; in a detour; in the opposite direction; one by one; prep somewhere. Around; around; around; around...; at... stages; round; round; regular activity; circle, round object; fixed route v. (make) round; complete; round off; round off; round off; round off; progress; circumnavigate; gain weight n. (Round) (US, UK, Canada, Australia, India, Germany) Round (name of person)"],"usphone":"raʊnd","ukphone":"raʊnd"},{"name":"small","trans":["adj. Few, small; weak; almost none; unimportant; young adv. Tiny Land; Despicable n. Small Items; Short Person n. (Small) Name; (English) Small"],"usphone":"smɔːl","ukphone":"smɔːl"},{"name":"spotted","trans":["adj. spotted; spotted; spotted; stained v. discovered (past participle of spot); tainted; stained n. (Spotted) person's name; (English) Spotted"],"usphone":"ˈspɒtɪd","ukphone":"ˈspɒtɪd"},{"name":"striped","trans":["adj. striped; spotted v. stripped (past participle of strip)"],"usphone":"straɪpt","ukphone":"straɪpt"},{"name":"chirp","trans":["v. (bug, bird) squeak; speak loudly; speak (talk) easily and happily; complain; taunt n. Chirp; (bug, bird) chirping; (communication) chirping"],"usphone":"tʃɜːp","ukphone":"tʃɜːp"},{"name":"hiss","trans":["vi. Booing; booing n. Booing; hissing n. (Hiss) name; (English, German) Heath; (France) Isse"],"usphone":"hɪs","ukphone":"hɪs"},{"name":"oink","trans":["int. Huh (pig's cry) n. Pig's cry (hum)"],"usphone":"ɔɪŋk","ukphone":"ɔɪŋk"},{"name":"quack","trans":["n. Duck cries; quack; Jianghu liar v. (duck) rattling; bragging; speaking stupid things loudly (informal) adj. Deceptive; a fake doctor's n. (Quack) (German, American, French, English, Dutch) quark (name of person)"],"usphone":"kwæk","ukphone":"kwæk"},{"name":"roar","trans":["n. Roar; roar; roar vi. roar; yell; noise vt. roar; shout; make... roar n. (Roar) person's name; () Roar"],"usphone":"rɔː(r)","ukphone":"rɔː(r)"},{"name":"snore","trans":["v. snoring n. Snoring (sound); (informal) something extremely annoying"],"usphone":"snɔː(r)","ukphone":"snɔː(r)"},{"name":"crawl","trans":["vi. crawling; walking on one's feet vt. crawling; walking slowly n. Crawling; fish pond; prostrate"],"usphone":"krɔːl","ukphone":"krɔːl"},{"name":"hop","trans":["v. Jumping on one foot; jumping on two feet or on one foot; suddenly going to a place quickly; (informal) making a quick trip; (informal) leaving quickly; (changing position quickly, etc.) jumping...; exchanging; (informal) jumping on (moving vehicle); express delivery; flavoring with hops n. Short distance jumping on both legs; short trips; hops; (informal) dancing; (informal) dancing; (informal) dancing; beer (drugs) Opium in particular) n. (Hop) (American) joint (name of person)"],"usphone":"hɒp","ukphone":"hɒp"},{"name":"move","trans":["v. Move; Change; Progress; Act; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move"],"usphone":"muːv","ukphone":"muːv"},{"name":"slither","trans":["v. Gliding, snaking, crawling; stumbling (due to steep or slippery ground, etc.), stumbling n. Sliding; long flakes, debris"],"usphone":"ˈslɪðə(r)","ukphone":"ˈslɪðə(r)"},{"name":"swim","trans":["vi. swimming; floating; dipping; vertigo vt. swim past; make it float n. Swim; float; faint adj. The one you wear while swimming"],"usphone":"swɪm","ukphone":"swɪm"},{"name":"walk","trans":["v. Walking, walking; walking; walking; walking; accompanying... walking; being stolen; (ghost) infestation; (informal) release from suspicion; (baseball) free entry; (ancient) life; guide...; (informal) abandon n. walk, walk; path; (postman's) delivery route; forest area (ranger); forest area under the jurisdiction of (rangers); cockfighting farm; beagle breeding farm; leisurely pace; (baseball) free landing (n) walk (n) US) Walker (name)"],"usphone":"wɔːk","ukphone":"wɔːk"},{"name":"add","trans":["vi. add; add; add up; do addition vt. add, add; add; calculate... sum n. Addition, addition"],"usphone":"æd","ukphone":"æd"},{"name":"apple","trans":["n. An apple, an apple tree, something like an apple; [American] bombs, grenades, (baseball) balls; [American] people, guys."],"usphone":"ˈæpl","ukphone":"ˈæpl"},{"name":"applesauce","trans":["n.Applesauce, applesauce; nonsense"],"usphone":",æpl'sɔːs","ukphone":",æpl'sɔːs"},{"name":"cinnamon","trans":["n. Camphor tree, cinnamon; cinnamon color; cinnamon bark adj. Cinnamon-colored, light yellowish brown n. (Cinnamon) name; (English) Cinnamon"],"usphone":"ˈsɪnəmən","ukphone":"ˈsɪnəmən"},{"name":"green","trans":["adj. green; youthful n. green; youth vt. Make... green vi. Turn green n. (Green) person's name; (English, Italian) Greene; (Sweden, Finn) Glenn"],"usphone":"ɡriːn","ukphone":"ɡriːn"},{"name":"mash","trans":["n. Feed; paste; malt pulp vt. Smash; flirt n. (Mash) name; (English) Marsh"],"usphone":"mæʃ","ukphone":"mæʃ"},{"name":"flip","trans":["vt. Throw; tap vi. Use your finger to flick; bounce adj. rude; reckless n. bullet; muscle fighting"],"usphone":"flɪp","ukphone":"flɪp"},{"name":"float","trans":["v. Float, float; drift; float; drift; arrange (loan) for consideration (idea or plan); issue (stock) listing; implement (currency exchange rate) free floating (currency exchange rate); spare change (used by bars, etc. to find change for customers); floats, floats; floats; drinks with ice cream; floats; drinks with ice cream; floating period; sitting in a floating box (treatment of illness, healing, or relaxation); lifebuoy n. (Float) (US, UK, Germany) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Person's name)"],"usphone":"fləʊt","ukphone":"fləʊt"},{"name":"glide","trans":["vi. Glide; glide; walk quietly; disappear vt. Make glide; make slide n. Glide; glide; slide; slide"],"usphone":"ɡlaɪd","ukphone":"ɡlaɪd"},{"name":"jellyfish","trans":["n. Jellyfish; [spineless] jellyfish; weak and incompetent people"],"usphone":"ˈdʒelifɪʃ","ukphone":"ˈdʒelifɪʃ"},{"name":"otter","trans":["n. Otter; Otter skin n. (Otter) name; (English, German, French, Swedish) Ott"],"usphone":"ˈɒtə(r)","ukphone":"ˈɒtə(r)"},{"name":"tank","trans":["n. Tanks; cisterns; ponds vt. Store... in a cabinet; defeat vi. Name of person traveling in a tank n. (Tank); (Germany, Earth, Aceh, Tukou, Nou) Tonk"],"usphone":"tæŋk","ukphone":"tæŋk"},{"name":"clothes","trans":["n. Clothes"],"usphone":"kləʊðz; kləʊz","ukphone":"kləʊðz; kləʊz"},{"name":"jacket","trans":["n. Down ski shirts; short suit jackets; short blouses, jackets; potato skins; book covers; document holders, briefcases vt. Put on... a jacket; put a jacket on...; put a protective seal on...; hit the 'mouth'"],"usphone":"ˈdʒækɪt","ukphone":"ˈdʒækɪt"},{"name":"jeans","trans":["n. Jeans; cargo pants n. (Jeans) name; (English, Italian) Jones"],"usphone":"dʒiːnz","ukphone":"dʒiːnz"},{"name":"pajamas","trans":["n. Pajamas; wide pants"],"usphone":"pə'dʒɑːməz","ukphone":"pə'dʒɑːməz"},{"name":"shirt","trans":["n. Shirts; undershirts, underwear"],"usphone":"ʃɜːt","ukphone":"ʃɜːt"},{"name":"shorts","trans":["n. Shorts n. (Shorts) Name; (English) Shorts"],"usphone":"ʃɔːts","ukphone":"ʃɔːts"},{"name":"always","trans":["Adv. forever, always; always; often"],"usphone":"ˈɔːlweɪz","ukphone":"ˈɔːlweɪz"},{"name":"banana","trans":["n. Banana; comedian; Big Hawk Nose n. (Banana) name; (Portugal, Tianjin) Banana"],"usphone":"bəˈnɑːnə","ukphone":"bəˈnɑːnə"},{"name":"boat","trans":["n. Small boat; ship vi. rowing"],"usphone":"bəʊt","ukphone":"bəʊt"},{"name":"frown","trans":["vi. frowned; disagree vt. frowning, frowning n. frowning, frowning"],"usphone":"fraʊn","ukphone":"fraʊn"},{"name":"hand","trans":["n. Hands, craftsmanship; help; pointers; meddling vt. Transfer, hand over; support; help n. (Hand) name; (English, Sweden) Hand"],"usphone":"hænd","ukphone":"hænd"},{"name":"pencil","trans":["n. Pencils; pen-like objects vt. Write with a pencil; apply vi with an eyebrow pencil. In the shape of a pencil"],"usphone":"ˈpensl","ukphone":"ˈpensl"},{"name":"smile","trans":["v. Smile; express with a smile; show (some kind of smile) n. Smile, smile; happy color n. (Smile) (Russian, Indian, American) Smiley (name of person)"],"usphone":"smaɪl","ukphone":"smaɪl"},{"name":"sometimes","trans":["Adv. Sometimes, intermittently or"],"usphone":"ˈsʌmtaɪmz","ukphone":"ˈsʌmtaɪmz"},{"name":"spider","trans":["n. Spiders; trap setters; tripods"],"usphone":"ˈspaɪdə(r)","ukphone":"ˈspaɪdə(r)"},{"name":"telephone","trans":["n. (US) telephone; telephone; telephone headset vi. Call vt. Call..."],"usphone":"ˈtelɪfəʊn","ukphone":"ˈtelɪfəʊn"},{"name":"beach","trans":["n. Beaches; lakeside vt. Drag... ashore vi. Stranded; name of person who settled n. (Beach); (English) Beach"],"usphone":"biːtʃ","ukphone":"biːtʃ"},{"name":"castle","trans":["n. Castles; cars in chess vt. Place... in a castle; build a castle to defend n. (Castle) person's name; (English) Castle"],"usphone":"ˈkɑːsl","ukphone":"ˈkɑːsl"},{"name":"dig","trans":["vt. Dig, explore; explore vi. Dig n. Poke, stab; dig up n. (Dig) people's names; (Luo) Digger"],"usphone":"dɪɡ","ukphone":"dɪɡ"},{"name":"kite","trans":["n. Kite vi. Use an empty check; fly like a kite; move briskly vt. Money fraud; falsification (check) n. (Kite) name; (Sai) Kit; (English) Kate"],"usphone":"kaɪt","ukphone":"kaɪt"},{"name":"cheer","trans":["n. Cheers, cheers; happy, joyful atmosphere; reasons to be happy; cheering songs, cheering poems; wine dishes (served on festive occasions) v. cheers, cheers; comfort, encouragement; (makes) happy n. (Cheer) (US, UK, Canada, Australia) Scher (name of person)"],"usphone":"tʃɪə(r)","ukphone":"tʃɪə(r)"},{"name":"dress up","trans":["v. Dress up, decorate; dress up"],"usphone":"dres ʌp","ukphone":"dres ʌp"},{"name":"football","trans":["n. Soccer, rugby vi. Play soccer; play rugby"],"usphone":"ˈfʊtbɔːl","ukphone":"ˈfʊtbɔːl"},{"name":"friend","trans":["n. Friend; Assistant; Sponsor n. (Friend) Name; (English) Flanders"],"usphone":"frend","ukphone":"frend"},{"name":"game","trans":["n. Games; contests; prey adj. Brave vi. Gambling n. (Game) name; (English) Gam; (French) Gam; (West) Game"],"usphone":"ɡeɪm","ukphone":"ɡeɪm"},{"name":"carry","trans":["vt. Take and carry; carry; support; carry vi. Can be achieved; carried; carried n. Carried; [measured] position; range n. (Carry) name of person; (English) Kari"],"usphone":"ˈkæri","ukphone":"ˈkæri"},{"name":"log","trans":["n. Logs; logs (navigation or flight); (regular or systematic) observation records; ship speedometers; logarithms v. load (situation) into navigation (or flight) logs; (ship, aircraft) reach (a certain range, speed); (pilot) flight (a certain period of time); make a systematic record of...; harvest (forest area) trees"],"usphone":"lɒɡ","ukphone":"lɒɡ"},{"name":"plane","trans":["n. Aircraft; plane; degree, level vi. planing; traveling by plane; soaring vt. Flatten; use a grater; skim over the surface of the water adj. Flat; flat n. (Plane) person's name; (Serbia, Sweden, France) Plane"],"usphone":"pleɪn","ukphone":"pleɪn"},{"name":"police","trans":["n. Police, police; public security vt. supervision; jurisdiction; maintenance of law and order; provision of police for... adj. Of the police; relating to the police"],"usphone":"pəˈliːs","ukphone":"pəˈliːs"},{"name":"trash","trans":["n. Garbage; waste vt. Discard; prune branches"],"usphone":"træʃ","ukphone":"træʃ"},{"name":"bark","trans":["n. Bark; dark blue-brown; fur; skin; dog barking vt. Dog barking; screaming; peeling n. (Bark) person's name; (English, Spanish, German, Czech, French, Finland, Sweden) Buck; (Arabic, Russian) Bark"],"usphone":"bɑːk","ukphone":"bɑːk"},{"name":"bird","trans":["n. Birds; guys; badminton vt. Cheer for...; cheer vi. Bird hunting; observational study of wild birds n. (Bird) name; (English, Spanish) Bird"],"usphone":"bɜːd","ukphone":"bɜːd"},{"name":"kid","trans":["n. Kids; Little Goats vt. Deceive; make fun of; tease vi. deceive; make fun of; make fun of adj. Made of small goatskin; younger n. (Kid) name; (English) Kidd"],"usphone":"kɪd","ukphone":"kɪd"},{"name":"like","trans":["prep. Like, like; in a way that conforms to...; has the characteristics of...; (used to ask) how; for example, like v. likes; wants; wants; wants; wants; wants; wishes. Seems; like; like... n. Hobbies (often plural); similar or similar person or thing adj. Similar, similar; (image) realistic adv. (informal) Possible; as if said; same as n. (Like) (US, Russian, India, English, Pakistan), Rikai (name of person)"],"usphone":"laɪk","ukphone":"laɪk"},{"name":"squirrel","trans":["n. Squirrel; squirrel fur vt. repositioned"],"usphone":"ˈskwɪrəl","ukphone":"ˈskwɪrəl"},{"name":"bridge","trans":["n. Bridges; Bridges; Bridges; Ship Bridges vt. Building a bridge; crossing n. (Bridge) name; (English) Bridge"],"usphone":"brɪdʒ","ukphone":"brɪdʒ"},{"name":"made","trans":["adj. ... made, produced; made... v. manufacture; make a bed; cause; start a fire; assist score (past tense and past participle of make) n. (Made) (love) Mad (name of person)"],"usphone":"meɪd","ukphone":"meɪd"},{"name":"metal","trans":["n. Metals; alloys vt. covered with metal adj. Metal n. (Metal) names; (Czech) Mehtar; (Sweden) Metall"],"usphone":"ˈmetl","ukphone":"ˈmetl"},{"name":"rope","trans":["n. Rope, rope vt. Bundle, bind vi. Twisted in the shape of a rope n. (Rope) person's name; (English) Rope; (Finn) Lope"],"usphone":"rəʊp","ukphone":"rəʊp"},{"name":"stone","trans":["n. Stones; stones; [treasure] gemstones adj. Stone, stone vt. Throw stones; use stones to lay stones n. (Stone) names; (Czech) Storne; (Sweden) Stones; (English) Stone"],"usphone":"stəʊn","ukphone":"stəʊn"},{"name":"wood","trans":["n. Timber; wood products; woods vi. Collecting timber vt. Planted in; add firewood n. (Wood) name; (English, French, Spanish, Portuguese, Arabic) wood"],"usphone":"wʊd","ukphone":"wʊd"},{"name":"clean","trans":["adj. Clean, clean; innocent vt. Make it clean vi. Clean, clean adv. Completely n. Clean n. (Clean) person's name; (English) Klein"],"usphone":"kliːn","ukphone":"kliːn"},{"name":"paint","trans":["n. Paint; paint; (informal) makeup; three-second zone; painting function (especially simulating real painting effects); flower horse v. paint; apply makeup (face, skin); apply (liquid) to...; paint with a drawing program; display (aircraft, etc.) (on a radar screen); paint (picture); describe n. (Paint) (US) Pan (name of person)"],"usphone":"peɪnt","ukphone":"peɪnt"},{"name":"share","trans":["v. Sharing, sharing; distribution; having the same feelings (or experiences); sharing n. shares, shares; responsibility, contribution n. (Share) (US) Sharley (name of person)"],"usphone":"ʃeə(r)","ukphone":"ʃeə(r)"},{"name":"teacher","trans":["n. Teacher; tutor n. (Teacher) name; (English) teacher"],"usphone":"ˈtiːtʃə(r)","ukphone":"ˈtiːtʃə(r)"},{"name":"write","trans":["vi. Write, write; write, compose; write a letter vt. write, write; write to; write"],"usphone":"raɪt","ukphone":"raɪt"},{"name":"dirt","trans":["n. Dirt, dirt; dust, dust; dirty talk"],"usphone":"dɜːt","ukphone":"dɜːt"},{"name":"grass","trans":["n. Grass; grass, lawn vt. Graze; make... grow grass; make... eat grass vi. Long grass n. (Grass) name; (French, German, Russian, Swedish, English) Glass"],"usphone":"ɡrɑːs","ukphone":"ɡrɑːs"},{"name":"hay","trans":["n. Hay vt. Dry it in the sun vi. Mow the grass and dry it"],"usphone":"heɪ","ukphone":"heɪ"},{"name":"ketchup","trans":["n.Ketchup"],"usphone":"ˈketʃəp","ukphone":"ˈketʃəp"},{"name":"oil","trans":["n. Oil; petroleum; oil paint vt. Refuel; apply oil; melt vi. Melt; add fuel"],"usphone":"ɔɪl","ukphone":"ɔɪl"},{"name":"air","trans":["n. Air, atmosphere; sky; appearance; tune vt. Ventilate and dry; brag vi. venting"],"usphone":"eə(r)","ukphone":"eə(r)"},{"name":"car","trans":["n. Car; car n. (Car) person's name; (Earth) Jarr; (French, Western) Carl; (Se) Tsar"],"usphone":"kɑː(r)","ukphone":"kɑː(r)"},{"name":"cold","trans":["adj. cold; frigid, unenthusiastic; unconscious n. cold; cold; cold adv. wholly"],"usphone":"kəʊld","ukphone":"kəʊld"},{"name":"feel","trans":["vt. Feeling; Thinking; Touching; Testing vi. feel; explore n. feel; touch"],"usphone":"fiːl","ukphone":"fiːl"},{"name":"fence","trans":["n. Fences; fences; swordsmanship vt. Protect; use a fence; practice sword fighting vi. Fencing; forging; fencing; jumping over fences"],"usphone":"fens","ukphone":"fens"},{"name":"handle","trans":["v. Touch (with hand); touch the ball with hand (or forearm); manipulate (vehicle); respond in a specific way; handle; deal with (someone or something); have a way to handle; operate; accept (or operate) stolen goods; bear it comfortably; drive (the vehicle is easy or difficult); transport (goods) n. (door) handle; handle; feel (of fabric, etc.); (informal) name (of a person or place); (informal) name (of a person or place); (informal) total bet"],"usphone":"ˈhændl","ukphone":"ˈhændl"},{"name":"mail","trans":["n. Mail; Post, Mailing; Armor vt. Mail; wear armor to... vi. Mailing; name of person sending n. (Mail); (France) Mai"],"usphone":"meɪl","ukphone":"meɪl"},{"name":"mailbox","trans":["n. Mailboxes; mailboxes"],"usphone":"ˈmeɪlbɒks","ukphone":"ˈmeɪlbɒks"},{"name":"tree","trans":["n. Trees; lumber; tree-like objects vt. Catch up... to the tree vi. Climb up a tree; run away from a tree n. (Tree) person's name; (English) Terry"],"usphone":"triː","ukphone":"triː"},{"name":"another","trans":["det. Another, another; another, different; similar pron. Another, another; another, different; similar adj. different; another (person); similar"],"usphone":"əˈnʌðə(r)","ukphone":"əˈnʌðə(r)"},{"name":"away","trans":["Adv. leave, leave; in the distance"],"usphone":"əˈweɪ","ukphone":"əˈweɪ"},{"name":"crow","trans":["n. Crow; chirping; (informal) ugly woman; crowbar v. clapping; smug; cheering"],"usphone":"krəʊ","ukphone":"krəʊ"},{"name":"flew","trans":["v. fly, fly (past tense of fly) n. (Flew) (English, American) Flu (personal name)"],"usphone":"fluː","ukphone":"fluː"},{"name":"land","trans":["n. Land; land; ground vt. Log... in; trap...; remove... vi. Login; name of person arriving at n. (Land); (English, German, Portuguese, Sweden) Rand"],"usphone":"lænd","ukphone":"lænd"},{"name":"wire","trans":["n. Electric wire; wire; telegraph vt. Shoot a telegram; install wires for... vi. Name of person calling telegraph n. (Wire); (English) Wyre"],"usphone":"ˈwaɪə(r)","ukphone":"ˈwaɪə(r)"},{"name":"burger","trans":["n. Hamburger n. (Burger) name; (West) Bourguer; (France) Biergé; (English) Berger; (Germany, Luo, Czech, Sai, Germany) Bugle"],"usphone":"ˈbɜːɡə(r)","ukphone":"ˈbɜːɡə(r)"},{"name":"doll","trans":["n. Dolls; dolls; beautiful women without brains vt. Dress up... as a flower branch and display n. (Doll) names; (English) Doll (female educational names Dorothea and Dorothy nicknames); (West) Dolly"],"usphone":"dɒl","ukphone":"dɒl"},{"name":"drop","trans":["v. Promote; Help; Promote; Decline; Terminate n. Drop; Drop; Airdrop; Minus; Drops"],"usphone":"drɒp","ukphone":"drɒp"},{"name":"key","trans":["n. Key; key, key; key (of a keyboard instrument or computer keyboard); tone, tone, color; answer; legend; wrench; pin, wedge, bolt; wing; first layer of plaster between slats; (basketball) penalty area; low island, reef vt. Type, type with a keyboard; fix it with a pin, etc.; make it fit or relate to...; live with... and be safe; use a key to scratch the surface of the car; rough (surface); add an identification code to (advertisement); become the key to getting... adj. Key, main n. (Key) (US) base (person name)"],"usphone":"kiː","ukphone":"kiː"},{"name":"paper","trans":["n. Paper; paper; document; newspaper adj. Made of paper vt. Use paper paste; wrap with paper vi. Paste the wallpaper; issue a traffic violation summons n. (Paper) name; (Russian) Papel"],"usphone":"ˈpeɪpə(r)","ukphone":"ˈpeɪpə(r)"},{"name":"slipper","trans":["n. Slippers vt. Hit with slippers"],"usphone":"ˈslɪpə(r)","ukphone":"ˈslɪpə(r)"},{"name":"catch","trans":["vt. Catch; catch; infect; understand vi. catch; catch n. Catch; catch; window hook"],"usphone":"kætʃ","ukphone":"kætʃ"},{"name":"Friday","trans":["n. Friday; loyal servant"],"usphone":"ˈfraɪdeɪ; ˈfraɪdi","ukphone":"ˈfraɪdeɪ; ˈfraɪdi"},{"name":"Monday","trans":["n. Monday"],"usphone":"ˈmʌndeɪ; ˈmʌndi","ukphone":"ˈmʌndeɪ; ˈmʌndi"},{"name":"Saturday","trans":["n. Saturday"],"usphone":"ˈsætədeɪ; ˈsætədi","ukphone":"ˈsætədeɪ; ˈsætədi"},{"name":"Sunday","trans":["n. Sunday; Sunday"],"usphone":"ˈsʌndeɪ; ˈsʌndi","ukphone":"ˈsʌndeɪ; ˈsʌndi"},{"name":"Thursday","trans":["n. Thursday"],"usphone":"ˈθɜːzdeɪ; ˈθɜːzdi","ukphone":"ˈθɜːzdeɪ; ˈθɜːzdi"},{"name":"try","trans":["vt. Attempt, effort; test; trial; test vi. Try; Try; Test n. Try; Try; Test n. (Try) Name; (English, Indonesia) Teri; () Delhi"],"usphone":"traɪ","ukphone":"traɪ"},{"name":"Tuesday","trans":["n. Tuesday"],"usphone":"ˈtjuːzdeɪ; ˈtjuːzdi","ukphone":"ˈtjuːzdeɪ; ˈtjuːzdi"},{"name":"Wednesday","trans":["n. Wednesday"],"usphone":"ˈwenzdeɪ; ˈwenzdi","ukphone":"ˈwenzdeɪ; ˈwenzdi"},{"name":"change","trans":["v. Change, transform, (make) different; (make) transform; replace, replace; exchange; currency exchange; exchange... for change; refund n. Change, change; substitute; change for laundry; change, change; change; transfer; new experience; emergence of a new phase of the moon"],"usphone":"tʃeɪndʒ","ukphone":"tʃeɪndʒ"},{"name":"fold","trans":["v. Folding; foldable; bag; closing; closing; closing; putting... in; hugging; abruptly absent; leaving the card face down means abandoning a plate n. fold; sheepfold; crease; crease (of the rock layer of the earth's crust); hill; folded paper (or cloth)"],"usphone":"fəʊld","ukphone":"fəʊld"},{"name":"glue","trans":["n. Glue, glue v. (with glue) bonding; (informal) focus on"],"usphone":"ɡluː","ukphone":"ɡluː"},{"name":"tape","trans":["n. Tape; tape; tape; tape vt. Record; tie with tape; seal... with tape vi. Record n. (Tape) person's name on tape; (English) Taipu"],"usphone":"teɪp","ukphone":"teɪp"},{"name":"tear","trans":["v. Tear off, tear off; tear off; pull out; strain; (informal) run wild; experience... destroy; shed tears n. tears; (torn) holes or cracks, tear n. (Tear) (US) Tear (name of person)"],"usphone":"(for v.) ˈtɛː; (for n.) ˈtɪə","ukphone":"(for v.) ˈtɛː; (for n.) ˈtɪə"},{"name":"baseball","trans":["n. Baseball; baseball sport"],"usphone":"ˈbeɪsbɔːl","ukphone":"ˈbeɪsbɔːl"},{"name":"soccer","trans":["n. English football, soccer"],"usphone":"ˈsɒkə(r)","ukphone":"ˈsɒkə(r)"},{"name":"animal","trans":["n. Animals Animal's"],"usphone":"ˈænɪml","ukphone":"ˈænɪml"},{"name":"go","trans":["vi. Go; reach; run; tend to n. Go; carry on; try vt. endure; give birth; bet on..."],"usphone":"ɡəʊ","ukphone":"ɡəʊ"},{"name":"skates","trans":["n. Skates; skates (plural of skate) v. ice skating; sliding; slightly touching (three single forms of skating)"],"usphone":"skeits","ukphone":"skeits"},{"name":"train","trans":["n. Train; Queue; Long Line; Skirt v. Training; Aim n. (Train) Name; (English) Train; (France) Trane; (Italy) Traine"],"usphone":"treɪn","ukphone":"treɪn"},{"name":"camel","trans":["n. [animal husbandry] [spine] camel; salvage buoy; work style bureaucratic adj. Camel; dark brown vi. Job stereotypical and mediocre n. (Camel) name; (French) Carmel; (Arabic) Kamal"],"usphone":"ˈkæml","ukphone":"ˈkæml"},{"name":"eagle","trans":["n. Eagle; eagle logo n. (Eagle) name; (English) Eagle"],"usphone":"ˈiːɡl","ukphone":"ˈiːɡl"},{"name":"horse","trans":["n. Horses; cavalry; tripods; heroin vt. Make a horse ride; tie a horse to; tease vi. Horseback riding; making fun of person n. (Horse); (Sweden) Holser"],"usphone":"hɔːs","ukphone":"hɔːs"},{"name":"lizard","trans":["n. Lizard; lizard-like reptile n. (Lizard) name; (France) Rizal"],"usphone":"ˈlɪzəd","ukphone":"ˈlɪzəd"},{"name":"wolves","trans":["n. Wolf; greedy; pervert (plural of wolf) v. Fast eater in large bites; lupus swallowing (single triple form of wolf)"],"usphone":"wʊlvz","ukphone":"wʊlvz"},{"name":"bug","trans":["n. Bugs, bugs; malfunctions; eavesdropping devices vt. Disturb, disturb; install an eavesdropping device vi. install an eavesdropping device; disrupt"],"usphone":"bʌɡ","ukphone":"bʌɡ"},{"name":"busy","trans":["adj. Busy; lively; occupied vt. Busy n. (Busy) name; () Busy; (France) Bissey"],"usphone":"ˈbɪzi","ukphone":"ˈbɪzi"},{"name":"lunch","trans":["n. Lunch v. Eat lunch; provide lunch vi. Eat lunch; provide lunch"],"usphone":"lʌntʃ","ukphone":"lʌntʃ"},{"name":"rose","trans":["n. Roses; rosy red wine; rosy color; rosy skin tone; shower nozzle; rose-shaped crest adj. Rosy; rosy, pink v. rise; reach a higher level; stand up; rise (past tense of rise)"],"usphone":"rəʊz","ukphone":"rəʊz"},{"name":"sniff","trans":["vi. sniffing; scoffing vt. Smell; smell; breathe hard; notice n. Breathe, smell; snort; smell; inhale with your nose; sound of inhalation"],"usphone":"snɪf","ukphone":"snɪf"},{"name":"toes","trans":["n. [Anatomy] Toes (plural of toe) v. Walking with the tip of the toe (three single forms of toe)"]},{"name":"clown","trans":["n. Clowns; country people; rude and clumsy people vi. pretend to be a clown; pretend to be stupid"],"usphone":"klaʊn","ukphone":"klaʊn"},{"name":"costume","trans":["n. Costumes, costumes; costumes, theatrical costumes vt. Put on a costume for..."],"usphone":"ˈkɒstjuːm","ukphone":"ˈkɒstjuːm"},{"name":"dragon","trans":["n. Dragon; violent person, heinous person; strict and alert woman n. (Dragon) name; () Draugon; (English, French, Finn, Roe,) Dragon"],"usphone":"ˈdræɡən","ukphone":"ˈdræɡən"},{"name":"look","trans":["vt. Look; expect; pay attention; aim; look like vi. Look; look; pay attention; look at n.; look; face n. (Look) name; (Sweden) Locke; (English) Luke"],"usphone":"lʊk","ukphone":"lʊk"},{"name":"pirate","trans":["n. Pirate, marauders at sea; pirates, patent infringers; persons (or organizations) that illegally produce television or radio programs; corrupt persons, offenders v. piracy, misappropriation; looting (ships); looting (ships) adj. pirated"],"usphone":"ˈpaɪrət","ukphone":"ˈpaɪrət"},{"name":"superhero","trans":["n.Superheroes"],"usphone":"ˈsuːpəhɪərəʊ; ˈsjuːpəhɪərəʊ","ukphone":"ˈsuːpəhɪərəʊ; ˈsjuːpəhɪərəʊ"},{"name":"celery","trans":["n.Celery"],"usphone":"ˈseləri","ukphone":"ˈseləri"},{"name":"cereal","trans":["n. Cereals, grains; cereal foods; cereal plants adj. Cereals; made from cereals"],"usphone":"ˈsɪəriəl","ukphone":"ˈsɪəriəl"},{"name":"cheese","trans":["n. [Food] cheese; cheese; VIP vt. Stop adj. rebellious; timid"],"usphone":"tʃiːz","ukphone":"tʃiːz"},{"name":"healthy","trans":["adj. Healthy, robust; beneficial to the body and mind; wise, reasonable; well-functioning, thriving and developed; numerous, impressive"],"usphone":"ˈhelθi","ukphone":"ˈhelθi"},{"name":"seed","trans":["n. Seed; basis; semen; germination; offspring; origin vt. Sowing; fruiting; maturing; leaving... seeds vi. Sowing; (plant) fruiting n. (Seed) person's name; (English) seed"],"usphone":"siːd","ukphone":"siːd"},{"name":"snack","trans":["n. Snacks, snacks; fast food; easy to do, small things v. Eat snacks (or fast food, snacks)"],"usphone":"snæk","ukphone":"snæk"},{"name":"deer","trans":["n. Deer n. (Deer) person's name; (English) Deer"],"usphone":"dɪə(r)","ukphone":"dɪə(r)"},{"name":"hike","trans":["n. Hiking, hiking; sharp rise (price, etc.); sharp rise v. hiking, hiking; pulling up, lifting (clothing); drastically increasing (price, etc.) n. (Hike) (US, Russian) Hake (name of person)"],"usphone":"haɪk","ukphone":"haɪk"},{"name":"mud","trans":["n. Mud; slander; (informal) cheers v. Stain, paint with mud"],"usphone":"mʌd","ukphone":"mʌd"},{"name":"past","trans":["adj. past, past, past; past; just past, just ended; (verb) past tense; completed, ended n. Past, past; past, past; (someone) past experience (or career); (grammar) past tense, past tense (of verb) prep. Pass by; pass by; (refers to an hour), after...; further away from..., on the other side; more than, over, over adv. pass, pass, from side to side; (time) pass, pass; exceed; later, after (after a certain period of time from a known hour)"],"usphone":"pɑːst","ukphone":"pɑːst"},{"name":"pond","trans":["n. Pond; (the pond) (informal) Atlantic Ocean v. Interception (liquid such as running water) to form a small lake n. (Pond) (beauty, love) pond (name of person)"],"usphone":"pɒnd","ukphone":"pɒnd"},{"name":"trail","trans":["n. Footprints; (tracking someone's) footprints; (especially slender); long lines (of people or animals); (wilderness) paths; specific routes; ski slopes; (of gun racks); trailers (for movies, etc.) v. drag, pull; (especially plants) spread; (especially based on traces, etc.); tracking (especially based on traces, etc.); lag (in games, games) walking; (sounds, speakers, etc.) weakening; trailers (videos, programs, etc.); spray glaze (n). (Trail) (US) Terrell (name)"],"usphone":"treɪl","ukphone":"treɪl"},{"name":"balloon","trans":["n. Balloons; hot air balloons; large spherical wineglasses; white circles; (informal) idiot; extremely large payment at the end of the installment; (informal) big trouble v. surge; sudden weight gain; expansion; (kick the ball); travel in a hot air balloon adj. n. (Balloon) (US, India, Thailand, Russia, Pakistan) balon (name of person) that blows up like a balloon"],"usphone":"bəˈluːn","ukphone":"bəˈluːn"},{"name":"board","trans":["n. Board of directors; boards; decks; meals vt. Onboard (plane, car, boat, etc.); cover with a board; provide accommodation vi. Boarding n. (Board) name; (English, Spanish) Bode"],"usphone":"bɔːd","ukphone":"bɔːd"},{"name":"high","trans":["adj. High; advanced; sublime; high pitched n. High level; Sky; Pleasure caused by narcotics; High pressure zone adv. High; extravagant n. (High) person's name; (English) Hay"],"usphone":"haɪ","ukphone":"haɪ"},{"name":"hoop","trans":["n. Hoop; iron ring; cry vt. Add hoop to; surround vi. Make a call"],"usphone":"huːp","ukphone":"huːp"},{"name":"low","trans":["adj. Low, shallow; humble; vulgar; depressed adv. Low voice; humbly, low ground n. Low; Low price; Low point; Cow barking vi. Cow called n. (Low) name; (English, German) Lowe"],"usphone":"ləʊ","ukphone":"ləʊ"},{"name":"slide","trans":["v. Slide; walk smoothly; move quietly; gradually deteriorate; depreciate; decline; fall unwittingly; fall; slide; slide; avalanche; slide; avalanche; slide; slide; slide; avalanche; slide device (of a machine or musical instrument); hairpins; light shoes"],"usphone":"slaɪd","ukphone":"slaɪd"},{"name":"eight","trans":["num. Eight; eight; eighth; eight years old; eight point adj. Eight's n. 8-person rowing team"],"usphone":"eɪt","ukphone":"eɪt"},{"name":"four","trans":["num. Four, four n. A group of four people (or things); (cricket) one hit in four; (clothes, etc.) number four; four-point cards; four-bar rowing, four-person rowing team adj. Four; four n. (Four) (French, US) Faure (personal name)"],"usphone":"fɔː(r)","ukphone":"fɔː(r)"},{"name":"many","trans":["det. A lot of prons. Many; many people adj. Many n. Most people n. (Many) (US, France, Canada, India) Mani (name of person)"],"usphone":"ˈmeni","ukphone":"ˈmeni"},{"name":"six","trans":["num. Number 6; six; a group of six people (or things); six years old; six o'clock n. (six) (American, German) six (name)"],"usphone":"sɪks","ukphone":"sɪks"},{"name":"ten","trans":["num. Ten, ten n. (Ten) (American, Russian, Canada, German, Dutch, Spanish, English) (name)"],"usphone":"ten","ukphone":"ten"},{"name":"two","trans":["n. Two adj. Two nums. two"],"usphone":"tuː","ukphone":"tuː"},{"name":"ate","trans":["v. eat (past tense of eat)"],"usphone":"et; eɪt","ukphone":"et; eɪt"},{"name":"goat","trans":["n. Goats; scapegoats (beauty ghosts); color ghosts (beauty ghosts)"],"usphone":"ɡəʊt","ukphone":"ɡəʊt"},{"name":"math","trans":["n. Mathematics (equal to mathematics) n. (Math) name; (German) Matt; () Ma; (English) Maas"],"usphone":"mæθ","ukphone":"mæθ"},{"name":"problem","trans":["n. Difficulties; people causing trouble adj. problematic; difficult to deal with"],"usphone":"ˈprɒbləm","ukphone":"ˈprɒbləm"},{"name":"stinky","trans":["adj. foul-smelling n. Panoramic radar; surround view radar station"],"usphone":"ˈstɪŋki","ukphone":"ˈstɪŋki"},{"name":"doctor","trans":["n. Doctor; Doctor; Dentist (title or title) Dentist; Clinic; (informal) Adviser; Knowledgeable person; Artificial flies; Cool ocean breezes; (informal) Chef on board v. Tampering, forgery; adding harmful substances (to food or drink); castrate (animals); treat diseases for...; grant a doctorate degree; repair (machine); interfere (ball); seek medical treatment; practice medicine"],"usphone":"ˈdɒktə(r)","ukphone":"ˈdɒktə(r)"},{"name":"firefighter","trans":["n. Firefighters"],"usphone":"ˈfaɪəfaɪtə(r)","ukphone":"ˈfaɪəfaɪtə(r)"},{"name":"nurse","trans":["n. Nurse; babysitter; nursing mother; protective tree; bug care; sand cone shark v. care, nursing; being a nurse; nurturing; breastfeeding; carrying; careful care; drinking; holding; gathering n. (Nurse) (beauty, love) Nas (name of person)"],"usphone":"nɜːs","ukphone":"nɜːs"},{"name":"pilot","trans":["n. Pilots; pilots adj. Pilot v. driving; piloting; trial n. (Pilot) name; (Italian, Indian) Pilot; (France) Pilot"],"usphone":"ˈpaɪlət","ukphone":"ˈpaɪlət"},{"name":"police officer","trans":["n. Police officers; police officers"],"usphone":"pəˈliːs ɒfɪsə(r)","ukphone":"pəˈliːs ɒfɪsə(r)"},{"name":"airplane","trans":["n. Aircraft"],"usphone":"ˈeəpleɪn","ukphone":"ˈeəpleɪn"},{"name":"chain","trans":["n. Chain; bondage; shackle vt. Bound; imprisoned; locked in chains"],"usphone":"tʃeɪn","ukphone":"tʃeɪn"},{"name":"flower","trans":["n.Flowers; essences; flowering plants vi. maturity, development; flowering; prosperity vt. Make flowers bloom; decorate n. (Flower) people's names with flowers; (English) Flower"],"usphone":"ˈflaʊə(r)","ukphone":"ˈflaʊə(r)"},{"name":"hat","trans":["n. Hat vt. Put a hat on... vi. Hat supply; name of the person who made the hat n. (Hat); (Chinese) nuclear (Cantonese, Weitama)"],"usphone":"hæt","ukphone":"hæt"},{"name":"love","trans":["n. Love; Love; Preference; (nickname) Dear; Loving You; Loving Someone; Favorite Thing; Zero Score v. Love (someone); Caring; Liking (something or something); Loving n. (Love) (English, Philippines, United States) Love (name of person)"],"usphone":"lʌv","ukphone":"lʌv"},{"name":"mess","trans":["n. Confusion; cafeterias, food groups; dilemmas; messy stuff vt. Disrupt, stain; destroy; make a meal vi. Messing things up; making a mess; playing with n. (Mess) names; (German, Roman) Mess"],"usphone":"mes","ukphone":"mes"},{"name":"painting","trans":["n. Painting; oil painting; coloring v. painting (in the form of painting); painting in the name of n. (Painting); (English) Peinting"],"usphone":"ˈpeɪntɪŋ","ukphone":"ˈpeɪntɪŋ"},{"name":"desert","trans":["n. Desert, wasteland; dull and boring situation (or region), deserted place; well-deserved reward (common plural) v. abandonment; abandonment, abandonment (place); (soldier) leaving (army); escape; desertion; abandonment, abandonment; abandonment, abandonment; departure, disappointment; (sense, quality, or skill) leaving, losing (sense, quality, or skill) adj. desert; desolate; abandoned"],"usphone":"(for v.) dɪ'zɜːt; (for n.) 'dezət","ukphone":"(for v.) dɪ'zɜːt; (for n.) 'dezət"},{"name":"Earth","trans":["n. Earth; surface, land; land, soil; dust, common events; animal burrows vt. Ground (wire) [electricity]; cover (soil); chase into the cave vi. Hide in a burrow"],"usphone":"ɜːθ","ukphone":"ɜːθ"},{"name":"hill","trans":["n. Hills; Hills; Slopes; Mountain Hill n. (Hill) name; (French, Western) Eel; (German, English, German, German, German, German, German, German, English, Czech, Lo, Finland, Sweden) Hill"],"usphone":"hɪl","ukphone":"hɪl"},{"name":"lake","trans":["n.Lake; dark red pigment; carmine vt. (Make) hemolytic vi. (To) dissolve blood cells n. (Lake) name; (Germany, Serbia, Sweden) Lark; (English) Lake"],"usphone":"leɪk","ukphone":"leɪk"},{"name":"mountain","trans":["n. Mountain; Mountain n. (Mountain) person's name; (English) Mountain"],"usphone":"ˈmaʊntən","ukphone":"ˈmaʊntən"},{"name":"ocean","trans":["n. Ocean; Massive; Broad n. (Ocean) name; (Luo) Ocian"],"usphone":"ˈəʊʃn","ukphone":"ˈəʊʃn"},{"name":"river","trans":["n. River, River n. (River) person's name; (English) River"],"usphone":"ˈrɪvə(r)","ukphone":"ˈrɪvə(r)"},{"name":"blanket","trans":["n. Blanket, blanket; blanket-like object, covering layer adj. All in one; unlimited vt. cover, cover up; cover with a blanket"],"usphone":"ˈblæŋkɪt","ukphone":"ˈblæŋkɪt"},{"name":"book","trans":["n. Books; Volumes; Books of Accounts; Roster; Workbooks vt. Reservation; registration n. (Book) name; (Chinese) Bu (Cantonese, Waitama); (North); (English) Booker; (Sweden) Bock"],"usphone":"bʊk","ukphone":"bʊk"},{"name":"pick","trans":["vi. Picking; picking; digging vt. Picking; selecting; picking; excavating n. Select; Crane Hoe; Digging; Covering n. (Pick) person's name; (English, French, German, Czech, German, Czech, Swedish, Swedish) Pique"],"usphone":"pɪk","ukphone":"pɪk"},{"name":"room","trans":["n. Room; space; leeway; opportunity; everyone in the room vt. Provide accommodation for...; rent, share; stay, stay... vi. Residence; Accommodation n. (English) Rum (name); (Russian) Roma (name)"],"usphone":"ruːm; rʊm","ukphone":"ruːm; rʊm"},{"name":"shoe","trans":["n. Shoes; horseshoes; outer tube vt. Put on... shoes; wear... shoes n. (Shoe) name of person; (English) Hugh"],"usphone":"ʃuː","ukphone":"ʃuː"},{"name":"aunt","trans":["n. Aunt; aunt; aunt"],"usphone":"ɑːnt","ukphone":"ɑːnt"},{"name":"brother","trans":["n. Brothers; Colleagues; Comrades int. My dude! n. (Brother) name; (English) Blazer"],"usphone":"ˈbrʌðə(r)","ukphone":"ˈbrʌðə(r)"},{"name":"dad","trans":["n. Dad; Dad n. (Dad) name; (Meng, Baki, Afu) Dade; (Tai) Da"],"usphone":"dæd","ukphone":"dæd"},{"name":"dog","trans":["n. Dogs; scumbags; () friends vt. tracking; trailing"],"usphone":"dɒɡ","ukphone":"dɒɡ"},{"name":"grandma","trans":["n. Grandma; grandmother"],"usphone":"ˈɡrænmɑː","ukphone":"ˈɡrænmɑː"},{"name":"grandpa","trans":["n. Grandpa; grandfather"],"usphone":"ˈɡrænpɑː","ukphone":"ˈɡrænpɑː"},{"name":"mom","trans":["n. Mother n. (Mom) name; () Mongolian"],"usphone":"mɒm","ukphone":"mɒm"},{"name":"read","trans":["vt. Read; read, understand vi. Read; read it up n. Read; book adj. An educated n. (Read) name; (English) Reed"],"usphone":"riːd","ukphone":"riːd"},{"name":"sister","trans":["n. Sisters; (called like-minded people) sisters; nuns; nurses adj. sisterly; same type"],"usphone":"ˈsɪstə(r)","ukphone":"ˈsɪstə(r)"},{"name":"breakfast","trans":["n. Breakfast; breakfast vi. Have breakfast vt. Serves breakfast for..."],"usphone":"ˈbrekfəst","ukphone":"ˈbrekfəst"},{"name":"reading","trans":["n. Reading, reading aloud; reading material; reading adj. Reading v. reading (reading form)"],"usphone":"ˈriːdɪŋ","ukphone":"ˈriːdɪŋ"},{"name":"recess","trans":["n. Rest; adjournment; recess vt. Make a recess; place... in a hidden place vi. Rest; vacation"],"usphone":"ˈriːses; rɪˈses","ukphone":"ˈriːses; rɪˈses"},{"name":"school","trans":["n. School; college; school; fish group vt. education"],"usphone":"skuːl","ukphone":"skuːl"},{"name":"science","trans":["n. Science; Technology; Discipline; Science n. (Science) Name; (English) Sainz"],"usphone":"ˈsaɪəns","ukphone":"ˈsaɪəns"},{"name":"time","trans":["n. Time; era; number of times; beat; multiples vt. Timing; measuring the time of...; the speed of arranging... adj. Regular; regular; instalment n. (Time) name; (Russian) Ji Mei; (English) time; (ro) time"],"usphone":"taɪm","ukphone":"taɪm"},{"name":"everywhere","trans":["Adv. everywhere n. Everywhere"],"usphone":"ˈevriweə(r)","ukphone":"ˈevriweə(r)"},{"name":"leaves","trans":["n. Leaves, leaves; petals; (paper) pages, sheets; thin sheet of metal; movable table, folding table; fan (window, door, etc.); inside (or outside) of a hollow wall (plural of leaf) v. leave; let... leave (3rd person singular of leave)"],"usphone":"liːvz","ukphone":"liːvz"},{"name":"plant","trans":["n. Factories, workshops; plants; equipment; crops vt. Plant; cultivate; cultivate; place vi. Name of the person who planted n. (Plant); (English, Spanish, Italian) Plant; (France) Prand"],"usphone":"plɑːnt","ukphone":"plɑːnt"},{"name":"pop","trans":["n. Pop music; pop culture; (especially used as a title) dad, dad; soda; bang; shooting; (quick hit) sign; criticism; popular classical music v. Sudden appearance; act suddenly; explode; shoot; stare; (make) make a burst sound; place quickly; leave quickly; change in ear pressure; (excessive) medication; adj. Popular; popular, popular adv. Suddenly; pops; bursts int. A bang of explosions abbr. Post office protocol (post office protocol); population (population) n. (Pop) (name of person)"],"usphone":"pɒp","ukphone":"pɒp"},{"name":"spring","trans":["n. Spring; springs; springs; vitality; jumping adj. Spring vi. Grow; erupt; leap; crack vt. Make it jump; make it explode; suddenly propose; make it pop n. (Spring) name; (Germany) Sprin; (England, Finland, Sweden) Spring"],"usphone":"sprɪŋ","ukphone":"sprɪŋ"},{"name":"built","trans":["v. Build, build; gradually enhance; embed (wall, object, etc.) (past tense and past participle of build) adj. Those with... physique; those with a beautiful body;... built"],"usphone":"bɪlt","ukphone":"bɪlt"},{"name":"city","trans":["n. City, city adj. urban; metropolitan"],"usphone":"ˈsɪti","ukphone":"ˈsɪti"},{"name":"house","trans":["n. Homes; households; institutions; parliaments; buildings for a certain purpose vt. Cover; live in... the house; store... in the room vi. Name of person staying in n. (House); (English) House"],"usphone":"haʊs","ukphone":"haʊs"},{"name":"park","trans":["n. Park; [Interchange] Parking lot vt. Parking; placement; storage vi. n. (Park) name of the person who parked the vehicle; (English, Finland, Sweden) Park"],"usphone":"pɑːk","ukphone":"pɑːk"},{"name":"road","trans":["n. Highways, roads; means vt. (Dog) chases (prey) along the smell adj. (US) Tour N. (Road) name; (English) Lord"],"usphone":"rəʊd","ukphone":"rəʊd"},{"name":"store","trans":["n. Stores; reserves, storage; warehouses vt. Storage, storage n. (Store) name of person; (DE) Storey"],"usphone":"stɔː(r)","ukphone":"stɔː(r)"},{"name":"blow","trans":["v. (wind) blow; blow; blow; blow; blow; blow; blow (nose); melt, burn; explode; leak; leave abruptly; waste (money, opportunity); (ancient) bloom; (flies) lay eggs in; (whales) spray water; mess up...; chirp (car horn); blow (glass); blow (glass); blow egg yolk and egg whites out of the eggshell n. blow; blow; blow your nose; (informal jazz) Performance; (informal) cannabis; (steelmaking term) blowing; (ancient) flowering, flowering period int. Oops (indicates boredom)"],"usphone":"bləʊ","ukphone":"bləʊ"},{"name":"fly","trans":["vi. fly; fly; fly vt. flight; overflight; make it fly n. Fly; fly; two-winged insect adj. An agile n. (Fly) name; (French) Foley; (English) Fry"],"usphone":"flaɪ","ukphone":"flaɪ"},{"name":"lazy","trans":["adj. Lazy; lazy; lazy; slow to swallow n. (Lazy) name; (de) Lazy"],"usphone":"ˈleɪzi","ukphone":"ˈleɪzi"},{"name":"leaf","trans":["n. A leaf; a sheet (of a book, etc.); fan page vi. Fresh leaves; turning book pages vt. Turn the page of... and hurriedly read n. (Leaf) person's name; (English) Leaf"],"usphone":"liːf","ukphone":"liːf"},{"name":"heavy","trans":["adj. heavy; heavy, huge; overcrowded; gloomy n. Heavy; serious character adv. massively; bulkily"],"usphone":"ˈhevi","ukphone":"ˈhevi"},{"name":"lift","trans":["v. Lift; lift; raise (voice) volume; raise (voice) volume; lift (price); air transport; be lifted; spread; perform cosmetic surgery; dig; pick up and place; get rid of an unhappy mood; advance; win; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; (cricket) fly high; free lift; (cricket) fly high; free lift; (cricket) lift; free lift; free lift; (cricket)"],"usphone":"lɪft","ukphone":"lɪft"},{"name":"light","trans":["n. Light; light; lamp; lighter; understanding; light color; sunroof adj. Light; light-colored; bright; relaxed; easy; light vi. Light; brighten; ignite vt. Illuminate; ignite; ignite adv. Lightly; clearly; lightly n. (Light) (English) Wright (personal name)"],"usphone":"laɪt","ukphone":"laɪt"},{"name":"rock","trans":["n.Rock; rock; rock; reef vt. Shake; shake vi. Shake; shake n. (Rock) name; (English, German, Italian, Swedish) Rock"],"usphone":"rɒk","ukphone":"rɒk"},{"name":"stick","trans":["vt. Stab; poke; stick; paste vi. insist; stick out; stick to n. stick; walking stick; dumb person n. (Stick) (Finn) stick (name of person)"],"usphone":"stɪk","ukphone":"stɪk"},{"name":"cape","trans":["n. [Geography] Cape, cape; cape n. (Cape) name; (Cape) name; (English) Cape"],"usphone":"keɪp","ukphone":"keɪp"},{"name":"mask","trans":["n. Mask; mask; disguise vi. Disguise; wear a mask; dress up vt. disguise; wear a mask; blur"],"usphone":"mɑːsk","ukphone":"mɑːsk"},{"name":"muscle","trans":["n. Muscles; strength vt. Strengthen; move hard; squeeze hard vi. Move hard"],"usphone":"ˈmʌsl","ukphone":"ˈmʌsl"},{"name":"power","trans":["n. Power, ability; electricity, power, performance; regime, power; [number] power vt. Motivate; motivate; empower... vi. Move fast adj. N. (Power) name of a person who manipulates power by influencing powerful people; (English, Portuguese) Bauer"],"usphone":"ˈpaʊə(r)","ukphone":"ˈpaʊə(r)"},{"name":"save","trans":["vt. Save; Save; Save; Rescue vi. Save; save prep. Other than... n. Rescue n. (Save) person's name; (France) Saf; (Italy, Poland, West, Russia, Sweden) Savey (female name), Savey (female name)"],"usphone":"seɪv","ukphone":"seɪv"},{"name":"talk","trans":["v. Speaking; talking; talking; talking; negotiating; speaking (in a language); persuading; divulging secrets; arguing; talking; gossiping; confessing information n. Talking; negotiating; (informal) speaking; reporting; empty talk; rumor; topic; manner of speaking"],"usphone":"tɔːk","ukphone":"tɔːk"},{"name":"brown","trans":["adj. Brown, brown; sun-tanned vi. Turns brown n. Brown, brown vt. Turn brown n. (Brown) name; (English, Italian, Finnish, Czech, German, French, Spanish, Portuguese) Brown"],"usphone":"braʊn","ukphone":"braʊn"},{"name":"mix","trans":["v. (Make) mix; prepare; participate; compatibility, get along peacefully; socialize; mix recording; mix; juxtapose; combine; (informal) fight n. Mix; mixed; mixed; mixed groups of people; confusion; ratio of ingredients; ingredients; mixing, mixing; music composition, concert; superposition of images n. (Mix) (US, Russia, Pakistan) Meeks (name of person)"],"usphone":"mɪks","ukphone":"mɪks"},{"name":"orange","trans":["n. Orange, tangerine; orange juice, tangerine drink; orange tree, orange tree; orange, orange; orange yellow butterfly adj. Orange-red, orange-yellow; n. (Orange) (American, French, Russian, English) of the Orange Party or Society; Olinch (personal name)"],"usphone":"ˈɒrɪndʒ","ukphone":"ˈɒrɪndʒ"},{"name":"purple","trans":["adj. purple; imperial; flashy n. purple; purple robe vi. Turned purple vt. Make purple"],"usphone":"ˈpɜːpl","ukphone":"ˈpɜːpl"},{"name":"turn","trans":["vt. Turn to make a spin; turn; turn over; redeem vi. Turn; turn; turn n. Turn; change; act, act, act (damage or benefit others) n. (Turn) person's name; (Germany,) Thun"],"usphone":"tɜːn","ukphone":"tɜːn"},{"name":"climb","trans":["v. Climbing; climbing; climbing; (plants growing along a wall or shelf); promotion; (road) inclination upward; climbing; climbing in (or climbing out) with effort n. Climbing; adding value; improving (position or social status); climbing (ranking); mountain (to be climbed in mountaineering or climbing); mountain trail; (of an airplane) climbing"],"usphone":"klaɪm","ukphone":"klaɪm"},{"name":"hide","trans":["vt. Concealing; concealing; whipping vi. hide n. Hide; animal hide; hiding place"],"usphone":"haɪd","ukphone":"haɪd"},{"name":"lucky","trans":["adj. lucky; lucky"],"usphone":"ˈlʌki","ukphone":"ˈlʌki"},{"name":"nibble","trans":["vi. Bite carefully; bite little by little; blow your hair and ask for flaws vt. Bite little by little; bite little by little; blow your hair for blemishes n. Bite lightly; nibble"],"usphone":"ˈnɪbl","ukphone":"ˈnɪbl"},{"name":"smell","trans":["n. Smell, smell; smell v. smell, smell; have... smell; detect; emit... n. (Smell) (American, Russian, English, India, New) Smell (name of person)"],"usphone":"smel","ukphone":"smel"},{"name":"brain","trans":["n. Mind, intelligence; head vt. The name of the person who punched... on the head n. (Brain); (English) Blaine"],"usphone":"breɪn","ukphone":"breɪn"},{"name":"everything","trans":["pron Everything, everything (related), everything; situation, situation; most important thing n. (Everything) (India, US, Australia) Avesin (name of person)"],"usphone":"ˈevriθɪŋ","ukphone":"ˈevriθɪŋ"},{"name":"use","trans":["n. Use; Use; Play vt. Use; cost vi. Use, use n. (Use) person's name; (Germany) Uze"],"usphone":"juːz","ukphone":"juːz"},{"name":"beg","trans":["vt. Begging; pleading; avoiding the topic vi. Begging; requesting n. (Beg) person's name; (German, Sai, Baki) Berg"],"usphone":"beɡ","ukphone":"beɡ"},{"name":"dinosaur","trans":["n. Dinosaurs; people or things that are out of date or outdated"],"usphone":"ˈdaɪnəsɔː(r)","ukphone":"ˈdaɪnəsɔː(r)"},{"name":"fetch","trans":["vt. Take; Receive; Arrive; Attract vi. Take; take; sell n. Acquire; trick"],"usphone":"fetʃ","ukphone":"fetʃ"},{"name":"pet","trans":["n. Pets; angry; loved ones vt. Love vi. Angry; caressing adj. Favorite n. (Pet) person's name; (Russian) Pet; ()"],"usphone":"pet","ukphone":"pet"},{"name":"shake hands","trans":["handshake"],"usphone":",ʃeik'hændz","ukphone":",ʃeik'hændz"},{"name":"far","trans":["Adv. Very; far away; long distance; to a very long distance; to a very deep extent adj. Distant; long-standing n. Faraway n. (Far) person name; (Germany, West, Serbia) Farr"],"usphone":"fɑː(r)","ukphone":"fɑː(r)"},{"name":"lion","trans":["n. Lions; celebrities; brave people; social celebrities n. (Lion) names; (Western, Portuguese) Leon; (Germany, France, Italy, Czech, Sweden) Leon; (English) Leon"],"usphone":"ˈlaɪən","ukphone":"ˈlaɪən"},{"name":"near","trans":["Adv. Close (ground), close (ground), very close (ground) to...; soon, very soon; almost; almost prep. Near..., close; close; close, just; similar to..., similar to adj. (Distance) Close, close; close; approximate; near; close relative; stingy vt. Approaching; fast to (a stage or time) vi. (Important moment or event, etc.) Approaching"],"usphone":"nɪə(r)","ukphone":"nɪə(r)"},{"name":"owl","trans":["n. Owls; lords; people accustomed to night activities"],"usphone":"aʊl","ukphone":"aʊl"},{"name":"wolf","trans":["n. Wolves; perverts; cruel and greedy people vt. Eat a lot; eat n. (Wolf) by the name of a person; (after, Jie, Fen, Sweden, Germany, France, Romania, Netherlands, England) Wolf"],"usphone":"wʊlf","ukphone":"wʊlf"},{"name":"forest","trans":["n. Forest, wooded area; a thicket (similar to a forest); royal woodland, hunting grounds v. planted in; covered by forest n. (Forest) Forest (name of person)"],"usphone":"ˈfɒrɪst","ukphone":"ˈfɒrɪst"},{"name":"moss","trans":["n. Moss; quagmire vt. Name of the person who made moss n. (Moss); (English, German, Italian, Spanish, Portuguese, Poland, Norway, Sweden) Moss"],"usphone":"mɒs","ukphone":"mɒs"},{"name":"path","trans":["n. Roads; paths; tracks"],"usphone":"pɑːθ","ukphone":"pɑːθ"},{"name":"new","trans":["adj. New, fresh; updated; first-time adv. Recent n. (New) person's name; (English) New Zealand"],"usphone":"njuː","ukphone":"njuː"},{"name":"old","trans":["adj. Obsolete, ancient; old n. Ancient n. (Old) names; (English) Old"],"usphone":"əʊld","ukphone":"əʊld"},{"name":"cook","trans":["v. Cooking, cooking; (food) being cooked; (informal) tampering, falsification; conspiracy; able to work well n. Chef n. (Cook) (US) Cook (name of person)"],"usphone":"kʊk","ukphone":"kʊk"},{"name":"drive","trans":["v. Driving; (motor vehicle) being driven; owning... a car; driving someone; driving; driving; driving; driving; driving; driving; driving; driving; driving (organized); driving; driving (organized); driving; driving (organized); driving; driving (an organized); driving (an organized); driving (an organized); driving (an organized) activity; driving (a fast lane); pumping; driving (aggressive); driving (aggressive) Attack, mass attack; party to play cards"],"usphone":"draɪv","ukphone":"draɪv"},{"name":"Thanksgiving","trans":["n. Gratitude"],"usphone":"ˌθæŋksˈɡɪvɪŋ","ukphone":"ˌθæŋksˈɡɪvɪŋ"},{"name":"visit","trans":["v. Visit, visit; browse (web page); inspect; stay; consult; chat; (mostly used in the Bible); experience n. Visit, visit; browse (to the website); stay; consult; meet, chat n. (Visit) (Thailand) Weishi (name of person)"],"usphone":"ˈvɪzɪt","ukphone":"ˈvɪzɪt"},{"name":"barn","trans":["n. Barn; barn; garage; target (nuclear reaction cross-section unit) vt. Store... in the warehouse"],"usphone":"bɑːn","ukphone":"bɑːn"},{"name":"farm","trans":["n. Farms; farmhouses; farms, feedlots; production (or processing) enterprises v. farming, farming, animal husbandry; outsourcing...; putting (someone) in foster care; (temporarily) transfer, rent out; subcontract (taxation)"],"usphone":"fɑːm","ukphone":"fɑːm"},{"name":"field","trans":["n. Field; Pasture; Wilderness; Battlefield; Stadium; Field vi. As a field player adj. Scanning field; field game; wild vt. Expose yourself on the field; put on the field n. (Field) name; (English, French, German, Portuguese) field"],"usphone":"fiːld","ukphone":"fiːld"},{"name":"bow","trans":["n. Bow; bow; bow; bow; bow v. bow, nod; lower (head); submit; (make) bend; pull (string instrument) with a bow n. (Bow) (American, English, Ireland) Bow (name of person)"],"usphone":"baʊ","ukphone":"baʊ"},{"name":"juggle","trans":["vi. Juggling; deception; misrepresentation vt. misrepresentation; deception n. Playing tricks; deception"],"usphone":"ˈdʒʌɡl","ukphone":"ˈdʒʌɡl"},{"name":"star","trans":["n. Stars, stars; stars; star-shaped objects vt. Marked with an asterisk; starred by..., with... in the lead role vi. Acting as the lead adj. Star's, protagonist's; star-shaped n. (Star) person's name; (Sweden) Stahl; (German) Stahl"],"usphone":"stɑː(r)","ukphone":"stɑː(r)"},{"name":"door","trans":["n. Door; home, door; doorway; channel n. (Door) person's name; (English) Dole"],"usphone":"dɔː(r)","ukphone":"dɔː(r)"},{"name":"hose","trans":["n. Hoses; stockings; leggings worn by men vt. Use a hose to water; hit"],"usphone":"həʊz","ukphone":"həʊz"},{"name":"swing","trans":["v. Swing; hang; jump; rotate; rotate (on the axis); move (boat, plane) to all positions; (abruptly) turn; walk with a big swing; hang; walk; walk; jump; throw at...; fly (cricket) sideways; change (mood or opinion); gain; have a decisive influence on...; successfully completed; strong sense of rhythm n. Swing; swing; rhythm; light action (cricket) Side flying ball; (politician) A trip with multiple stays; hitting; ups and downs adj. Strong rhythm jazz music; decisive n. (Swing) (American, Swedish, English), Swain (personal name)"],"usphone":"swɪŋ","ukphone":"swɪŋ"},{"name":"chew","trans":["v. Chewing; biting (due to annoyance or anxiety); thinking; reflecting; (informal) small talk n. Chewing; chewing; chewing, chewing gum, tobacco for chewing n. (Chew) (American, New Zealand, Ma, English, Canada) (name of person)"],"usphone":"tʃuː","ukphone":"tʃuː"},{"name":"class","trans":["n. Class; Class; Type; Class; Level vt. Classify; rank...; assign... to a certain level, treat... as (or categorize, categorize); put... into a class adj. Excellent; very good, excellent, excellent vi. Belongs to... category (or rank) and is classified as a class (or level) n. (English, German) Klaas (personal name)"],"usphone":"klɑːs","ukphone":"klɑːs"},{"name":"drink","trans":["v. Drink, drink; drink; after drinking..., cheers; (metaphor) revel in; (informally) absorb (moisture); drink (alcohol) to have a certain flavor; raise a glass to celebrate n. Wine; drink (drink or wine); drink, drink, be greedy, abuse alcohol"],"usphone":"drɪŋk","ukphone":"drɪŋk"},{"name":"sleep","trans":["vi. Sleep n. Sleep n. Sleep n. (Sleep) person's name; (English) Sleep"],"usphone":"sliːp","ukphone":"sliːp"},{"name":"basket","trans":["n. Basket; score (in a basketball game); amount of basket; basket vt. Load into basket"],"usphone":"ˈbɑːskɪt","ukphone":"ˈbɑːskɪt"},{"name":"chips","trans":["n. [Food] Fried potato sticks; small wooden chips; round chips (used for betting); gaps (plural form of chips)"],"usphone":"tʃɪps","ukphone":"tʃɪps"},{"name":"cookie","trans":["n.Cookies; small desserts"],"usphone":"ˈkʊki","ukphone":"ˈkʊki"},{"name":"picnic","trans":["n. Picnic vi. Go on a picnic"],"usphone":"ˈpɪknɪk","ukphone":"ˈpɪknɪk"},{"name":"put","trans":["vt. Place; express; move; place; grant vi. start; hit; sail; sprout n. throw; idiot; throw; monster adj. A fixed n. (Put) person's name; (Thai, Myanmar) Bu"],"usphone":"pʊt","ukphone":"pʊt"},{"name":"sandwich","trans":["n. Sandwich (shape); sandwich bread slice; (cream) sandwich cake; teaching and internship alternating training course v. Insert (or squeeze)... in the middle; glue; put.. ... make a sandwich"],"usphone":"ˈsænwɪtʃ; ˈsænwɪdʒ","ukphone":"ˈsænwɪtʃ; ˈsænwɪdʒ"},{"name":"ball","trans":["n. Ball; prom vi. Clumps vt. Form a ball n. (Ball) name; (Earth) Baler; (English, Spanish) Ball; (French, German, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Czech)"],"usphone":"bɔːl","ukphone":"bɔːl"},{"name":"be","trans":["vt. Yes; have, exist; do, become; occur n. (Be) name; (Myanmar) Bai; (Japanese) Ministry (surname); (North Korea) Pei; (Central Africa) Bei"],"usphone":"bi; biː","ukphone":"bi; biː"},{"name":"frog","trans":["n. Frog; [Railway] fork; buckle vi. Frog catcher n. (Frog) name; (Russian) Frog"],"usphone":"frɒɡ","ukphone":"frɒɡ"},{"name":"get","trans":["vt. make; obtain; receive; become n. Reproduce; young vi. become; become; arrive"],"usphone":"ɡet","ukphone":"ɡet"},{"name":"let","trans":["vt. Permit, Transfer; Rent; Assume; Obstruct vi. Rental; contracted n. Barrier; Rental house n. (Let) person's name; (Myanmar) Lai; (Russian) Wright"],"usphone":"let","ukphone":"let"},{"name":"little","trans":["adj. Small; few; short; small and cute adv. Not at all n. Few; not many; short term n. (Little) person's name; (English) Little"],"usphone":"ˈlɪtl","ukphone":"ˈlɪtl"},{"name":"mouse","trans":["n. Mouse; mouse; timid and shy person vt. Discovery vi. Mousetraking; spying"],"usphone":"maʊs","ukphone":"maʊs"},{"name":"puppy","trans":["n.Puppies, puppies"],"usphone":"ˈpʌpi","ukphone":"ˈpʌpi"},{"name":"see","trans":["vt. Seeing; understanding; understanding; observing; visiting vi. See; see; understand n. (See) names; (English) Xi; () Sai; (Germany) Ze"],"usphone":"siː","ukphone":"siː"},{"name":"beaver","trans":["n. Beaver; Beaver fur n. (Beaver) name; (English) Beaver"],"usphone":"ˈbiːvə(r)","ukphone":"ˈbiːvə(r)"},{"name":"duck","trans":["n. Duck; duck meat; (English) baby; zero point vi. Evade; submerge in water vt. Dodge; press... to enter the water n. (Duck) name; (German, Portuguese,) Duke"],"usphone":"dʌk","ukphone":"dʌk"},{"name":"snail","trans":["n. Snails; sluggish people vi. Move slowly vt. trundle"],"usphone":"sneɪl","ukphone":"sneɪl"},{"name":"cloud","trans":["n. Clouds; cloudy clouds; cloud-like objects; a large group; dark spots vt. Confuse; obscure by clouds; make melancholy; tarnish vi. Overcast; dark clouds n. (Cloud) Claude (name)"],"usphone":"klaʊd","ukphone":"klaʊd"},{"name":"drain","trans":["v. Drain; Dry; Drink; (Feeling) Weakened; Exhausted; (Informal) Tap (Ball) into a Hole n. Gutter; Sewer; Burden; Consumption n. (Drain) (US, English, France, Canada) Derain (name of person)"],"usphone":"dreɪn","ukphone":"dreɪn"},{"name":"lightning","trans":["n. Lightning; Sudden; (informal) sudden good luck adj. Lightning-fast, fast-paced; sudden v. lightning"],"usphone":"ˈlaɪtnɪŋ","ukphone":"ˈlaɪtnɪŋ"},{"name":"puddle","trans":["n. Puddle, quagmire; glue (made of clay and water, impermeable to water) vt. Muddy, muddy; mash... into glue; stir; fill with glue vi. Stir the mud; play in puddles"],"usphone":"ˈpʌdl","ukphone":"ˈpʌdl"},{"name":"rain","trans":["n. Rain; rain; rainy day; rainy season vi. Rain; rainfall vt. Give in large quantities; leave behind n. (Rain) names; (France) Lan; (English) Rain; (Luo, Jie) Ryan"],"usphone":"reɪn","ukphone":"reɪn"},{"name":"rainbow","trans":["n. Rainbow; colorful arrangement; fantasy adj. Colourful; rainbow-shaped vt. Make a rainbow; decorate like a rainbow vi. Rainbow-shaped n. (Rainbow) person's name; (English) Raynbo"],"usphone":"ˈreɪnbəʊ","ukphone":"ˈreɪnbəʊ"},{"name":"Sun","trans":["n. Sun vt. Sunlight vi. Sun basking n. (Sun) name; (Chinese) Sun (Mandarin, Witma); () Sun; (Myanmar) Su; (Tu) Song"],"usphone":"sʌn","ukphone":"sʌn"},{"name":"umbrella","trans":["n. Umbrellas; umbrellas; shelters; umbrella-shaped structures"],"usphone":"ʌmˈbrelə","ukphone":"ʌmˈbrelə"},{"name":"fruit","trans":["n. Fruit; Product vi. The results are real vt. Make... result n. (Fruit) person's name; (French) Freud; (English) Fruitt"],"usphone":"fruːt","ukphone":"fruːt"},{"name":"meat","trans":["n.Meat, meat (edible)"],"usphone":"miːt","ukphone":"miːt"},{"name":"sell","trans":["vt. Sale; Promotion; Betrayal; Deception vi. Selling; Selling; Popular; Selling; Selling; Disappointment; Selling Skills n. (Sell) Name; (Germany) Zell; (England, Finland, Sweden) Sale"],"usphone":"sel","ukphone":"sel"},{"name":"shop","trans":["n. Store; store vt. Shopping vi. Shopping; shopping"],"usphone":"ʃɒp","ukphone":"ʃɒp"},{"name":"vegetable","trans":["n. Vegetables; plants; plant people adj. vegetable; vegetable"],"usphone":"ˈvedʒtəbl","ukphone":"ˈvedʒtəbl"},{"name":"fresh","trans":["adj. fresh; fresh; fresh water; inexperienced n. Start; new; flood adv. Just now; latest"],"usphone":"freʃ","ukphone":"freʃ"},{"name":"jumpy","trans":["adj. (Human) anxious, nervous; jumping, throbbing"],"usphone":"ˈdʒʌmpi","ukphone":"ˈdʒʌmpi"},{"name":"leash","trans":["n. Belt; restraint vt. Restraint; use a belt to tie"],"usphone":"liːʃ","ukphone":"liːʃ"},{"name":"mailman","trans":["n. Postman, postman"],"usphone":"ˈmeɪlmæn","ukphone":"ˈmeɪlmæn"},{"name":"steak","trans":["n.Beef steak; meat steak; fish steak"],"usphone":"steɪk","ukphone":"steɪk"},{"name":"nap","trans":["n. Take a nap, take a nap; fine hair; do whatever you want vt. Pull hair vi. Take a nap; omission n. (Nap) name; (North Korea, Vietnam) Na"],"usphone":"næp","ukphone":"næp"},{"name":"yard","trans":["n. Yard; yard (unit of measurement in the imperial system, 1 yard = 3 feet); courtyard; sail girder vt. Put... in or put in a corral n. (Yard) name; (English) Yard"],"usphone":"jɑːd","ukphone":"jɑːd"},{"name":"zoom","trans":["v. (In particular, cars, airplanes, etc.) rapid growth; (price, cost, etc.) rapid increase; (making the lens or camera) move closer or farther away n. (vehicle, etc.) speeding sound, hum; zoom photography; rapid rise int. (Used to indicate sudden rapid movement) Whistling"],"usphone":"zuːm","ukphone":"zuːm"},{"name":"beside","trans":["prep. Next to; compared to...; close; other than (yet); other than (no longer) adv. nearby; moreover, in addition"],"usphone":"bɪˈsaɪd","ukphone":"bɪˈsaɪd"},{"name":"between","trans":["prep. (space, time, quantity, etc.) between...; round trip; (table relationship) between two...; shared; adv together. (time or space) between...; during"],"usphone":"bɪˈtwiːn","ukphone":"bɪˈtwiːn"},{"name":"chicken","trans":["n. Chicken; chick; coward, coward adj. Chicken's; timid; young"],"usphone":"ˈtʃɪkɪn","ukphone":"ˈtʃɪkɪn"},{"name":"nest","trans":["n. Nest, nest; comfort nest; hotbed vt. Nesting; nesting vi. Build a nest; find a bird's nest n. (Nest) name; (German) Nester; (English) Nester (female teacher name Agnes, Welsh nickname)"],"usphone":"nest","ukphone":"nest"},{"name":"brush","trans":["n. Brushes; Brushes; Brushes; Quarrels; Conflicts; Bushland; Short Trees; Fox Tails vt. brush; painting; vi. brush; wipe; skim; touch (as you pass by)"],"usphone":"brʌʃ","ukphone":"brʌʃ"},{"name":"dry","trans":["adj. Dry; thirsty; boring and tasteless; prohibited vt. Dry... vi. Dry n. Dry n. (Dry) person's name; (France) Delhi"],"usphone":"draɪ","ukphone":"draɪ"},{"name":"feed","trans":["v. Feed; feed; provide enough food for...; fertilize; fuel (fire); provide raw materials or power for (a machine); provide (someone) (information, ideas, etc.); supply water (body of water); (ball sports terms) feed (ball), pass the ball to (teammates); move (slowly and smoothly); move (slowly and smoothly); pass (slowly and smoothly) through (limited space); promote; graze; raise (family, etc.) (informal) feed; Feeding (especially to animals or infants); eating; a meal (of an animal or baby); a feeding device (of a machine); (machinery, equipment) Raw material supply; (satellite or network) transmission; (computer) subscription source"],"usphone":"fiːd","ukphone":"fiːd"},{"name":"wash","trans":["v. washing; bathing; washable; scrubbing; washing; washing; slapping; soaking; (emotional) shock; washing; washing; painting; standing; eroding n. Washing; waves (left after a boat or plane has passed); sound of waves; thin coating; soap; clothes to be washed; alluvium; scum; form (unbeneficial to both parties); (the Wash) Wash Bay n. (Wash) (American) Wash (name of person)"],"usphone":"wɒʃ","ukphone":"wɒʃ"},{"name":"bus","trans":["n. Bus by bus"],"usphone":"bʌs","ukphone":"bʌs"},{"name":"pay","trans":["vt. pay, pay; reimburse, indemnify; give vi. payment; repayment n. Wages, salaries; payment; reward adj. Chargeable; payable"],"usphone":"peɪ","ukphone":"peɪ"},{"name":"ride","trans":["v. Ride, ride (bike, motorcycle, or horse, etc.), ride (subway, train, etc.); drive, control, try to control (someone) and force it to work; float; cross, overturn; depend on; count, mock; be carried away (with great impulse), thanks to n. (in a horse, bike, or vehicle) travel, itinerary; ride a free car; a person who makes it easy for people to ride; (someone's) car; (in an amusement park) an amusement device (n) for people to ride. Ride) (English, US, France) Ryder (person name)"],"usphone":"raɪd","ukphone":"raɪd"},{"name":"wait","trans":["vt. Wait; delay; delay vi. wait; delay; serve food n. Wait; wait n. (Wait) name; (English) Weite; (Czech) Weite"],"usphone":"weɪt","ukphone":"weɪt"},{"name":"jug","trans":["n. [light] water bottle; prison vt. Imprison; put in a pot vi. Imitate the name of a nightingale named n. (Jug); (Se) Jug"],"usphone":"dʒʌɡ","ukphone":"dʒʌɡ"},{"name":"mug","trans":["n. Cups; Faces; Hard Readers vi. Make a funny face and act weird vt. mugging"],"usphone":"mʌɡ","ukphone":"mʌɡ"},{"name":"chair","trans":["n. Chairs; lectures; presidency (of conferences); positions of university professors vt. Acting as chairman (of a conference); seating...; name of person taking office n. (Chair); (France) Schell"],"usphone":"tʃeə(r)","ukphone":"tʃeə(r)"},{"name":"puzzle","trans":["v. Confuse, (make) confuse; think hard (because of confusion); make... difficult n. Mysteries, intellectual games; mosaic toys; unsolved mysteries; enigmatic people or things"],"usphone":"ˈpʌzl","ukphone":"ˈpʌzl"},{"name":"baby","trans":["n. Babies, babies; childish people vt. Indulge, treat... like a baby adj. Baby's; baby's n. (Baby) name; (French, Portuguese) Bobby; (English) Bobby, Barbie (female name); (Russian) Babi"],"usphone":"ˈbeɪbi","ukphone":"ˈbeɪbi"},{"name":"grew","trans":["v. Grow, cultivate (past tense of grow) n. (Grew) person's name; (Finn) Greve; (English, Portuguese) Guru"],"usphone":"ɡruː","ukphone":"ɡruː"},{"name":"last","trans":["adj. The last; most recent; last; ultimate; least likely; worst; the only remaining adv. Recently, last time; last pron. Last person or thing; recent event; ultimate v. continuation; continuation of service; survival; (supply, resources) sufficient (someone) for a period of time n. Shoe support; end n. (Last) (US, Germany) Rust (name of person)"],"usphone":"lɑːst","ukphone":"lɑːst"},{"name":"mama","trans":["n. Mother (colloquial language) n. (Mama) name; (Togo, Zane, Benin) Mama"],"usphone":"ˈmæmə","ukphone":"ˈmæmə"},{"name":"rest","trans":["v. (to) rest; (to) temporarily leave the team; (to) rest; (to) rest; to be shelved; to bury (the body or corpse); to rest; to allow (the plaintiff or defendant) to complete the submission of evidence (or arguments) to the court; to belong; to remain the same n. Rest; to sleep; to rest; to rest; to rest; to rest of the person (or object); a small fragment (of an organ or tissue); a small fragment (of an organ or tissue); Ball) vs. n. (Rest) (US) Rest (person name)"],"usphone":"rest","ukphone":"rest"},{"name":"cleats","trans":["n. Wedge; tether pillow; anti-slip nail (plural form of cleat) v. Attach the bolt; attach the cable to the bolt (three single forms of cleat)"]},{"name":"goal","trans":["n. Goals; goals, points scored; end point vi. Strike, score a goal"],"usphone":"ɡəʊl","ukphone":"ɡəʊl"},{"name":"greet","trans":["vt. Welcome, greet; salute, greet; catch your eye n. (Greet) name; (English) Greet"],"usphone":"ɡriːt","ukphone":"ɡriːt"},{"name":"pass","trans":["v. Pass, pass; advance in a direction; achieve (a certain position); pass; pass; pass; pass; pass; pass; pass; pass by vote (law, etc.); pass; discharge; circulation; abandon n. Pass; pass; pass; pass; pass; pass; leap; stage; fishway; (bridge) doesn't call; stabbing (in fencing); trick; (computer) browsing n. (Germany) Pass (in fencing) English) Paz (personal name)"],"usphone":"pɑːs","ukphone":"pɑːs"},{"name":"score","trans":["n. Score; twenty; soundtrack; etching vt. Obtain; evaluate; draw, draw; write down... vi. Score; score; engraved n. (Score) person's name; (English) Scott"],"usphone":"skɔː(r)","ukphone":"skɔː(r)"},{"name":"uniform","trans":["adj. Uniform; consistent; identical; balanced; consistent n. Uniform vt. make uniform; make the same"],"usphone":"ˈjuːnɪfɔːm","ukphone":"ˈjuːnɪfɔːm"},{"name":"hook","trans":["n. Hook, hook vt. Hook; lead to hook vi. Hooked; bent into a hook n. (Hook) name; (German, Dutch) Hawke; (English) Hook"],"usphone":"hʊk","ukphone":"hʊk"},{"name":"roof","trans":["n. Roof; highest point, top; maximum vt. Build a roof for... and cover n. (Roof) person's name; (English) Ruff"],"usphone":"ruːf","ukphone":"ruːf"},{"name":"shelf","trans":["n. Shelves; shelves; shelf-like objects; reefs"],"usphone":"ʃelf","ukphone":"ʃelf"},{"name":"sink","trans":["v. sink (in water or mud); sink (ship); fall; infiltrate; be fully understood; make sharp objects penetrate the surface; settle (object); disappear; reduce; make (sound) quieter; excavate; bury; sink, suppress; close to death; hide; hit the ball into a hole; (informally) drink n. sink, sink; sink; sink; (technical) sink, valley; school (or property) in poor areas; nest, place to hide dirt adj. n. (Sink) (American, English, Romania) sink (name) of a slum located in a poor area with poor social conditions"],"usphone":"sɪŋk","ukphone":"sɪŋk"},{"name":"gold","trans":["n. Gold, gold; gold; gold coins adj. Gold, gold; golden n. (Gold) names; (English, French, German, Western, Russian, Czech, Swedish) Gold"],"usphone":"ɡəʊld","ukphone":"ɡəʊld"},{"name":"rake","trans":["n. Rake, target; prodigal; inclination (especially of a theater stage); front blade surface (of a cutting tool); bus cabin v. raking with a rake; shooting; searching; scratching (with branches or fingernails); (with a rake) to slant (the mast or chimney) towards the stern of the stern; determining the degree of inclination (especially of the stage) n. (Rake) (American, Indian) Lake (name of person)"],"usphone":"reɪk","ukphone":"reɪk"},{"name":"red","trans":["adj. Red, red; (hair) reddish brown; (face) reddish; (eyes) red; (eyes) red; revolutionary, aggressive; (human) red; red (wine) red; (wine) red; (indicating stop) red (light), red (flag); prohibited, dangerous; (indicated by red signs on ski trails) second most difficult; (physical) red, one of the three colors of quark; red (especially when used in the Cold War); stained with blood; (ancient or poetry/literature) bleeding; (Xhosa) n. red, red pigment from traditional tribal culture ; red coat; red wine; red thing (or person); deficit, deficit; activist n. (Red) Red (person name)"],"usphone":"red","ukphone":"red"},{"name":"cement","trans":["n. Cement; adhesives; bonds; factors that unite people; adhesive powder; dental bone; sedimentary rock matrix v. Adhesion, consolidation, determination; application of cement on...; (substance) adhesion (particles) to sedimentary rock"],"usphone":"sɪˈment","ukphone":"sɪˈment"},{"name":"garbage","trans":["n. Garbage; waste n. (Garbage) person's name; (France) Gal Ba fever"],"usphone":"ˈɡɑːbɪdʒ","ukphone":"ˈɡɑːbɪdʒ"},{"name":"truck","trans":["n. Trucks; Deals; Trolleys vi. Driving a truck; bartering vt. transaction; transportation by truck adj. (US) truck's n. (Truck) name; (German) Truk"],"usphone":"trʌk","ukphone":"trʌk"},{"name":"back","trans":["n. Back; backbone; rear; back; tail; (chair) backrest; defender; hull; (aircraft) fuselage; (human) trunk; adj. What is behind; what is behind; what is in the past; what is in arrears; what is behind the tongue adv. Backwards; backwards; on the back; on the back; on the back; behind n. (Back) (US) Buck (name); behind n. (Back) (US); Back; Back; Back; Back; Back; Back (name of person); Bets; Approval; Reinforcements; Accompaniment; Accompaniment; Attached to...; Steer counterclockwise; Seek back; behind... n. (Back) (US) Buck (name of person)"],"usphone":"bæk","ukphone":"bæk"},{"name":"met","trans":["v. meet (past tense and past participle of meet) n. (Met) name; (Sweden) Met"],"usphone":"met","ukphone":"met"},{"name":"bat","trans":["n. Bats; bats; rackets; batch file extensions vt. Hit the ball with a bat; the batting rate reached... vi. It's your turn to hit the ball; hit the ball with a bat n. (Bat) name; (Mongolian, English) Bart"],"usphone":"bæt","ukphone":"bæt"},{"name":"bed","trans":["n. Bed; foundation; river bottom, seabed vt. Make it sleep; place it; embed it; plant vi. Going to bed; layering"],"usphone":"bed","ukphone":"bed"},{"name":"block","trans":["n. Blocks; blocks; buildings; obstacles vt. block; block; limit; block adj. Batch, large; n. (Block) names of people in traffic jams; (English, French, German, Spanish, Portuguese, Finnish, Russian) Brock"],"usphone":"blɒk","ukphone":"blɒk"},{"name":"sock","trans":["n. Short socks; one-hit vt. Hit hard; put on... socks adv. On the ground; unbiased adj. A very successful n. (Sock) name; (German) Zock"],"usphone":"sɒk","ukphone":"sɒk"},{"name":"under","trans":["prep. Below...; below the surface; behind...; (position, rank) below; younger than...; controlled by; according to; in the process; influenced by; endured; under (a word); under...; under (a system); during...; under... living conditions; planted; during...; under... living conditions; planted; during...; while in power; working under... adv. below; under water; less than; younger; in a coma; adj. lower; below"],"usphone":"ˈʌndə(r)","ukphone":"ˈʌndə(r)"},{"name":"granny","trans":["n. Grandma; grandmother; mother in law's person"],"usphone":"ˈɡræni","ukphone":"ˈɡræni"},{"name":"one","trans":["num. One; one; one year old; one hour pron. A person; any person, people (general term); that person; that kind of person (specified) det. one (emphasizes someone or something); one (for a more similar person or thing); some (before the name of someone you don't know) adj. unique; one n. 1; one dollar note n. (One) (India, Malaysia, US) Wen (name of person)"],"usphone":"wʌn","ukphone":"wʌn"},{"name":"pappy","trans":["n. Dad, father adj. pasty; semi-liquid; slurry"],"usphone":"'pæpɪ","ukphone":"'pæpɪ"},{"name":"you","trans":["pron You; your n. (You) name; () You; (Chinese in Southeast Asian countries) You"],"usphone":"ju; juː","ukphone":"ju; juː"},{"name":"farmer","trans":["n. Farmer, farmer n. (Farmer) name; (English) Farmer; (French) Farmer; (West) Farmer"],"usphone":"ˈfɑːmə(r)","ukphone":"ˈfɑːmə(r)"},{"name":"rooster","trans":["n. Rooster; arrogant and conceited person"],"usphone":"ˈruːstə(r)","ukphone":"ˈruːstə(r)"},{"name":"slept","trans":["vi. sleep (past tense and past participle of sleep)"],"usphone":"slept","ukphone":"slept"},{"name":"woke","trans":["v. Awaken; inspire; revive... (past tense of wake) adj. (US) alert"],"usphone":"wəʊk","ukphone":"wəʊk"},{"name":"answer","trans":["n. Reply, answer; answer, solution; equivalent person or thing; reply to a letter; answer (a call); respond to a question v. answer, answer; be appropriate, conform; answer (question); respond (to an accusation or criticism); respond (to an accusation or criticism); respond (to a letter, etc.); resolve (issue)"],"usphone":"ˈɑːnsə(r)","ukphone":"ˈɑːnsə(r)"},{"name":"hairbrush","trans":["n.Hair brush; hair brush"],"usphone":"ˈheəbrʌʃ","ukphone":"ˈheəbrʌʃ"},{"name":"secret","trans":["adj. Secret, confidential; undisclosed; good at concealing one's own n. secrets, secrets; mysteries; silent prayer n. (Secret) (French) secret (name of person)"],"usphone":"ˈsiːkrət","ukphone":"ˈsiːkrət"},{"name":"tissue","trans":["n. Tissue; tissue; tulle; a set of vt. Decorate with tulle; wipe off with cosmetic paper"],"usphone":"ˈtɪʃuː; ˈtɪsjuː","ukphone":"ˈtɪʃuː; ˈtɪsjuː"},{"name":"toothbrush","trans":["n.Toothbrush"],"usphone":"ˈtuːθbrʌʃ","ukphone":"ˈtuːθbrʌʃ"},{"name":"butter","trans":["n. Butter, cream; butter-like foods; flattering v. Butter; please"],"usphone":"ˈbʌtə(r)","ukphone":"ˈbʌtə(r)"},{"name":"egg","trans":["n.Eggs; eggs; guys; eggs vt. Inciting; instigating n. (Egg) name; (French, English) Egg"],"usphone":"eɡ","ukphone":"eɡ"},{"name":"flour","trans":["n. Flour; powdery substance vt. Sprinkle powder on; grind... into powder n. (Flour) person's name; (France) Fleur"],"usphone":"ˈflaʊə(r)","ukphone":"ˈflaʊə(r)"},{"name":"milk","trans":["n. Milk; emulsion vt. Extracting; squeezing the milk of... vi. Milking n. (Milk) name; (English) Milk"],"usphone":"mɪlk","ukphone":"mɪlk"},{"name":"salt","trans":["n. Salt; fun, stimulating adj. Saltwater; salty, salty; salted; obscene vt. Use salt; add salt to...; spread salt on the road to melt ice or snow n. (Salt) name; (West) Salt; (English) Salt"],"usphone":"sɔːlt; sɒlt","ukphone":"sɔːlt; sɒlt"},{"name":"sugar","trans":["n. Sugar; table sugar; sweet words vt. Add sugar to; whitewash vi. Name of person forming sugar n. (Sugar); (English) Hugh"],"usphone":"ˈʃʊɡə(r)","ukphone":"ˈʃʊɡə(r)"},{"name":"carrot","trans":["n.Carrot bait"],"usphone":"ˈkærət","ukphone":"ˈkærət"},{"name":"crackers","trans":["adj. insane; insane n. Salty cookies"],"usphone":"ˈkrækəz","ukphone":"ˈkrækəz"},{"name":"grapes","trans":["n. [gardening] grapes (plural of grape)"],"usphone":"ɡreɪps","ukphone":"ɡreɪps"},{"name":"pack","trans":["n. Package; group; backpack; package; a pair of vt. Packing; pressing; bundling; picking; stuffing vi. Crowded; packaged goods; packaged; cluster n. (Pack) person's name; (English, German) Parker"],"usphone":"pæk","ukphone":"pæk"},{"name":"phone","trans":["n. Telephone; headphone, handset vt. Call vi. Name of person calling n. (Phone); (Lao, Mian) Pong"],"usphone":"fəʊn","ukphone":"fəʊn"},{"name":"tie","trans":["v. (use of wire, rope, etc.) tie; tie, tie; tie; tie; tie with..., make a draw; use a cable to connect (note) n. tie; shoelaces; bow ties; rope, wire; relationships, ties; restraint; tie; tie; draw; regardless of victory or loss; (English) knockout tournament (especially soccer); sustain the sound line n. (Tie) (US, Australia, Malaysia) (name of person)"],"usphone":"taɪ","ukphone":"taɪ"},{"name":"wet","trans":["adj. [Meteorology] [Object] Humid; rainy n. Rainy days; humidity vt. Get wet vi. Wet n. (Wet) person's name; (English, Nano, South Africa) Wete"],"usphone":"wet","ukphone":"wet"},{"name":"bee","trans":["n. Honeybee, bee; hardworking person n. (Bee) name; (); (Chinese in Southeast Asian countries) US; (English) bee (female educational names Beatrix and Beatrice)"],"usphone":"biː","ukphone":"biː"},{"name":"rocket","trans":["n. Rockets; rocket weapons; fireworks; arugula; (informal) severe reprimand v. Rapid increase; rapid movement; rapid success; attack with rocket weapons; delivery with rockets"],"usphone":"ˈrɒkɪt","ukphone":"ˈrɒkɪt"},{"name":"sky","trans":["n. Sky; vertex vt. Throw... into the air; hang... too high vi. Kick or hit a high-altitude ball; tilt the paddle too high; soar n. (Sky) person's name; (English) Sky"],"usphone":"skaɪ","ukphone":"skaɪ"},{"name":"cover","trans":["vt. Includes; interviews, reports; involvement; walking (a journey); cover; cover; cover; cover; cover; cover; cover; cover; cover, excuse vi. cover; replace; pervert; insure...; n. (Cover) name; (English) Covell; (Italian)"],"usphone":"ˈkʌvə(r)","ukphone":"ˈkʌvə(r)"},{"name":"mushroom","trans":["n. Mushrooms, condylus; mushroom-shaped objects; upstart adj. Mushrooms; mushroom-shaped; rapidly growing vi. Rapid growth; mushroom picking; rapid growth"],"usphone":"ˈmʌʃrʊm; ˈmʌʃruːm","ukphone":"ˈmʌʃrʊm; ˈmʌʃruːm"},{"name":"tent","trans":["n. Tents; residences; curtains vt. Cover it with a tent; make it possible to stay in a tent vi. Living in a tent; name of a person temporarily residing n. (Tent); (Russia, Sweden) tent"],"usphone":"tent","ukphone":"tent"},{"name":"feet","trans":["n. Foot (plural form of foot); foot; rhyme"],"usphone":"fiːt","ukphone":"fiːt"},{"name":"shark","trans":["n. Sharks; crooks vi. Fraud vt. extortion"],"usphone":"ʃɑːk","ukphone":"ʃɑːk"},{"name":"soft","trans":["adj. Soft, soft; gentle, gentle; weak; stupid adv. softly; gently n. Flexibility; soft things; soft parts"],"usphone":"sɒft","ukphone":"sɒft"},{"name":"tiger","trans":["n. Tiger; Violent person n. (Tiger) name; (English) Tiger; (French) Tigre; (Sweden) Teague"],"usphone":"ˈtaɪɡə(r)","ukphone":"ˈtaɪɡə(r)"},{"name":"cheetah","trans":["n. [spine] cheetah"],"usphone":"ˈtʃiːtə","ukphone":"ˈtʃiːtə"},{"name":"fawn","trans":["n. Young deer (under one year old); light yellowish brown v. Pleasure; (deer) give birth to a fawn; (especially dogs) wag their tail and beg for pity adj. Light yellowish brown n. (Fawn) (US) Fawn (personal name)"],"usphone":"fɔːn","ukphone":"fɔːn"},{"name":"spots","trans":["n. Spots (plural of spots); broadcast advertisements; flower dot cloth, patterned cotton cloth; ball point"],"usphone":"spɒts","ukphone":"spɒts"},{"name":"smooth","trans":["adj. Smooth; smooth; smooth vt. Smooth; remove (barriers, etc.); make elegant; ease n. Smooth part; flat ground vi. Become calm; become smooth adv. smoothly; smoothly; smoothly"],"usphone":"smuːð","ukphone":"smuːð"},{"name":"snake","trans":["n. Snakes; insidious people vi. Take a detour vt. Pull (timber, etc.); take a detour"],"usphone":"sneɪk","ukphone":"sneɪk"},{"name":"stripes","trans":["n. Striped cloth; striped cloth (stripe plural form) v. Add stripes to... (three single forms of stripe)"],"usphone":"st'raɪps","ukphone":"st'raɪps"},{"name":"thin","trans":["adj. Thin; skinny; thin; weak vt. Make thin; make thin; make thin vi. Get thinner; get thinner; become thinner adv. sparsely; faintly n. Small part n. (Thin) person's name; (Yue) Chen; () Ting"],"usphone":"θɪn","ukphone":"θɪn"},{"name":"curly","trans":["adj. curly; curly; (wood) wrinkled; curled"],"usphone":"ˈkɜːli","ukphone":"ˈkɜːli"},{"name":"person","trans":["n. Person; body; appearance, appearance; personal name n. (Person); (French, Russian, German) Persson; (Sweden) Persson; (English) Persson"],"usphone":"ˈpɜːsn","ukphone":"ˈpɜːsn"},{"name":"short","trans":["adj. short; insufficient; short, low n. short; lack; short circuit; shorts adv. Insufficient; suddenly; suddenly n. (Short) (English) Short (name)"],"usphone":"ʃɔːt","ukphone":"ʃɔːt"},{"name":"tail","trans":["n. Tails; trails; braids; tuxedo vt. Trailing; attaching the tail vi. Track; reduce or decrease adj. coming from behind; tail"],"usphone":"teɪl","ukphone":"teɪl"},{"name":"ground","trans":["n. Ground; Land; Scope; Battlefield; According to vt. Touch the ground; lay the foundation; run aground vi. landing; stranded adj. Of the land; on the ground; ground; ground; polished v. polish (past participle of grind); oppression"],"usphone":"ɡraʊnd","ukphone":"ɡraʊnd"},{"name":"water","trans":["n. Water; seawater; rainwater; ocean, large areas of water vt. Moisten; supply water; water... vi. Adding water; crying; drooling n. (Water) person's name; (English) Water"],"usphone":"ˈwɔːtə(r)","ukphone":"ˈwɔːtə(r)"},{"name":"bear","trans":["v. endure, bear; be unfit for something; bear responsibility; bear responsibility; bear (emotion, especially bad mood); support; display; carry; (car, boat) transport; birth (child); actually, blossom (formal); turn; take a turn; be proportionate (by name, title); perform; have (mark, characteristics); blow; have (name or title); write; have (similarity or relationship); generate (interest) n. bear; bear (interest) n. bear; sell (stock) Empty person; (informal) uneducated person; heavy man; (informal) “polar bear” (Russian nickname); ( informal) police; tricky things; grumpy n. (Bear) (US) Bell (name)"],"usphone":"beə(r)","ukphone":"beə(r)"},{"name":"father","trans":["n. Father, father; priest; ancestor; senior vt. Invented, founded; being the father of..."],"usphone":"ˈfɑːðə(r)","ukphone":"ˈfɑːðə(r)"},{"name":"honey","trans":["n. Honey; baby; sweet adj. Luscious; honey-like vt. Sweet talk about right...; add honey to make it sweet vi. Flattering; saying sweet words n. (Honey) person's name; (English) Honey"],"usphone":"ˈhʌni","ukphone":"ˈhʌni"},{"name":"mother","trans":["n. Mother; Maiden; abbot vt. Give birth; nurture; care or care like a mother adj. Mother's; birthplace"],"usphone":"ˈmʌðə(r)","ukphone":"ˈmʌðə(r)"},{"name":"across","trans":["Adv. From one side of... to the other, through, over; across; across; across; in direction; (crossword puzzle) horizontal anagram answers prep. From one side of... to the other, through; across from..., the other side; on...; everywhere, everywhere; in..."],"usphone":"əˈkrɒs","ukphone":"əˈkrɒs"},{"name":"against","trans":["prep. Opposition, violation; adverse to...; close contact, collision; target; prevention, defense; (sports competition) match; use... as a background; reference, comparison with...; (gambling) anticipate the failure of..."],"usphone":"əˈɡenst; əˈɡeɪnst","ukphone":"əˈɡenst; əˈɡeɪnst"},{"name":"sand","trans":["n. Sand; sand; sandbar; beach; sand vt. Sprinkle sand on; cover with sand; use sandpaper or the like to flatten or polish something; cover the ground with sand; mix... with sand vi. Name of person blocked by sand n. (Sand); (England, Germany, Italy, Finn, Luo, Jie, No) Sander; (Sweden) Sander; (France) Sang"],"usphone":"sænd","ukphone":"sænd"},{"name":"wind","trans":["n. Wind; Breathing; Odor; Circumference vt. Winding; twisting; bending; blowing a horn; wrapping or entangling someone vi. Winding; Clockwork; Blowing the horn n. (Wind) name; (English, Germany, Sweden) Wind"],"usphone":"wɪnd","ukphone":"wɪnd"},{"name":"coat","trans":["n. Coat vt. Cover the surface of... n. (Coat) person's name; (France) Koa"],"usphone":"kəʊt","ukphone":"kəʊt"},{"name":"mittens","trans":["n. Baseball gloves, boxing gloves; gloves; mittens (plural of mitten, common plural)"],"usphone":"'mɪt(ə)nz","ukphone":"'mɪt(ə)nz"},{"name":"pants","trans":["n.Pants"],"usphone":"pænts","ukphone":"pænts"},{"name":"scarf","trans":["n. Scarves; inlays, joints; headscarves, scarves vt. inlay; use a scarf to surround n. (scarf) person's name; (English) scarf [plural scarves or scarves]"],"usphone":"skɑːf","ukphone":"skɑːf"},{"name":"sled","trans":["n. Sleigh vi. Ride a sleigh; use a sleigh to transport vt. Use a cotton picker to pick; use a sleigh to transport"],"usphone":"sled","ukphone":"sled"},{"name":"winter","trans":["n. Winter; age; depression period vi. Winter adj. Winter's; n. (Winter) person's name for wintering; (English, German, German, German, Russian, Czech, West, Finland, Sweden, France) Winter"],"usphone":"ˈwɪntə(r)","ukphone":"ˈwɪntə(r)"},{"name":"fun","trans":["vi. Joking (3rd person singular of fun) (informal)"],"usphone":"fʌn","ukphone":"fʌn"},{"name":"around","trans":["Adv. Around; facing the opposite side; everywhere; aimlessly; nearby; approximately; around; calculated in a circle; existing; turning prep. Surrounding; over there; around; consistent with...; everywhere; centered around (the object mentioned); detour"],"usphone":"əˈraʊnd","ukphone":"əˈraʊnd"},{"name":"backward","trans":["adj. Backward; regressive; (human) intellectually retarded; backward; (site location) adv behind the line. Backwards; backwards; backwards (past); worse and worse; backwards backwards (equal to backwards) n. The back (or past) part n. (Backward) (US, Russian) Buckwalder (person name)"],"usphone":"ˈbækwəd","ukphone":"ˈbækwəd"},{"name":"forward","trans":["Adv. Moving forward; sequentially; moving towards success; entering a prominent position; towards the future; ahead of time; at (or) the bow of the boat adj. Forward; (vehicle) in front; early; quick; future-related; reckless; advance v. delivery; forwarding; promotion; transportation n. (monetary) futures agreement n. (Forward) (US, Canada, UK, Australia) Forward (person name)"],"usphone":"ˈfɔːwəd","ukphone":"ˈfɔːwəd"},{"name":"over","trans":["Adv. fall; flip; pass through; fully covered; above; greater than; again; end; change; finish; carefully prep. Above...; above...; crossing; on the other side of...; at the far end of...; falling from...; all over; more than; during; passing; passing; over; because; about; using; passing; sound greater than; above; above...; priority; over; over n. (cricket) of pitching in a round adj. Fallen; folded; finished; remaining v. crossing n. (Over) (American, English, German) Orwell (name of person)"],"usphone":"ˈəʊvə(r)","ukphone":"ˈəʊvə(r)"},{"name":"through","trans":["prep. Pass through, end to end; break through; break through; pass through; see through...; hear through...; hear from beginning to end; inspect from beginning to end; pass (obstacle, stage, or test); until; through; through adv. From one end to the other; through; from beginning to end; through; directly; straight; (telephone) connected; completely adj. Direct; intermodal transportation, full process; direct; penetrating, transit; opposite, two-way; penetrating from two sides of a building; entering the next round; completed; (use) completed; (relationship) terminated, terminated"],"usphone":"θruː","ukphone":"θruː"},{"name":"food","trans":["n. Food; nutrients"],"usphone":"fuːd","ukphone":"fuːd"},{"name":"my","trans":["pron My int. Oops (indicates surprise, etc.); Uh-huh n. (My) name; (Yue) beauty; (Lao, Kan) Mi"],"usphone":"maɪ","ukphone":"maɪ"},{"name":"your","trans":["pron Yours, yours"],"usphone":"jɔː(r); jə(r)","ukphone":"jɔː(r); jə(r)"}]