[{"name":"button","trans":["n. Buttons; buttons vt. Buckle; fasten; attach buttons to... vi. Clasp; with button; button on n. (Button) name; (English) Button"],"usphone":"ˈbʌtn","ukphone":"ˈbʌtn"},{"name":"dark","trans":["adj. Dark, dark; fuzzy; ignorant; melancholy n. darkness; night; dusk; blurry n. (Dark) names; (English) Dark n. (Dark) “Dark” (Dark) (Dark) “Dark” (a German thriller series produced by Netflix in 2017)"],"usphone":"dɑːk","ukphone":"dɑːk"},{"name":"large","trans":["adj. Big; majority; broad adv. Big Earth; Exaggerated n. Big n. (Large) person's name; (English) Lachey; (France) Larger"],"usphone":"lɑːdʒ","ukphone":"lɑːdʒ"},{"name":"metal","trans":["n. Metals; alloys vt. covered with metal adj. Metal n. (Metal) names; (Czech) Mehtar; (Sweden) Metall"],"usphone":"ˈmetl","ukphone":"ˈmetl"},{"name":"round","trans":["adj. round; curved; integer; perfect; approximate; obese; (sound) round; (ancient, money) large; (ancient, human, or way of speaking) straightforward adv. Spin; around; around; everywhere; in a detour; in the opposite direction; one by one; prep somewhere. Around; around; around; around...; at... stages; round; round; regular activity; circle, round object; fixed route v. (make) round; complete; round off; round off; round off; round off; progress; circumnavigate; gain weight n. (Round) (US, UK, Canada, Australia, India, Germany) Round (name of person)"],"usphone":"raʊnd","ukphone":"raʊnd"},{"name":"shiny","trans":["adj. smooth, shiny, shiny"],"usphone":"ˈʃaɪni","ukphone":"ˈʃaɪni"},{"name":"small","trans":["adj. Few, small; weak; almost none; unimportant; young adv. Tiny Land; Despicable n. Small Items; Short Person n. (Small) Name; (English) Small"],"usphone":"smɔːl","ukphone":"smɔːl"},{"name":"square","trans":["adj. square; square; right angle; straight vt. Make a square; consistent with... vi. Consistent; square n. Square; Square; square adv. Narukaigakuji"],"usphone":"skweə(r)","ukphone":"skweə(r)"},{"name":"wooden","trans":["adj. wooden; stiff, rigid"],"usphone":"ˈwʊdn","ukphone":"ˈwʊdn"},{"name":"excited","trans":["adj. excited; excited; active v. excited; aroused (past participle of excite)"],"usphone":"ɪkˈsaɪtɪd","ukphone":"ɪkˈsaɪtɪd"},{"name":"face","trans":["n. Face; Face; Face; Face; Appearance; Prestige vi. Toward; morning vt. face; face; acknowledge; erase n. (Face) person's name; (France) Faith; (Italy) Fache"],"usphone":"feɪs","ukphone":"feɪs"},{"name":"happy","trans":["adj. Happy; happy; clever n. (Happy) names; (English, Swedish, Ka) Happy"],"usphone":"ˈhæpi","ukphone":"ˈhæpi"},{"name":"mad","trans":["adj. crazy; crazy; stupid; fascinated n. Furious"],"usphone":"mæd","ukphone":"mæd"},{"name":"sad","trans":["adj. sad; sad, sad; miserable, gloomy (describe color)"],"usphone":"sæd","ukphone":"sæd"},{"name":"scared","trans":["adj. Scared v. makes afraid (past participle of scare)"],"usphone":"skeəd","ukphone":"skeəd"},{"name":"shy","trans":["adj. Shy; timid, timid vi. Throw; cringe; retreat; disgust vt. throw; random throw n. throw; shock jump n. (Shy) person's name; (English) Shy"],"usphone":"ʃaɪ","ukphone":"ʃaɪ"},{"name":"sleepy","trans":["adj. Sleepy, sleepy; (place) deserted, quiet; (business, industry, etc.) inactive"],"usphone":"ˈsliːpi","ukphone":"ˈsliːpi"},{"name":"sorry","trans":["adj. Sorry; sorry, sorry int. Sorry, sorry (indicates a euphemistic refusal, etc.)"],"usphone":"ˈsɒri","ukphone":"ˈsɒri"},{"name":"athlete","trans":["n. Athletes, sportspeople; strong people"],"usphone":"ˈæθliːt","ukphone":"ˈæθliːt"},{"name":"dive","trans":["v. Scuba diving; diving; diving; (plane or bird) dive; jump; jump, jump; jump, crash; quickly reach in; fake fall n. Dive, dive; jump; jump, jump; jump, jump; jump, jump; plunge, plunge; false fall; low level bar n. (Dive) (France, US) Diff (name of person)"],"usphone":"daɪv","ukphone":"daɪv"},{"name":"ride","trans":["v. Ride, ride (bike, motorcycle, or horse, etc.), ride (subway, train, etc.); drive, control, try to control (someone) and force it to work; float; cross, overturn; depend on; count, mock; be carried away (with great impulse), thanks to n. (in a horse, bike, or vehicle) travel, itinerary; ride a free car; a person who makes it easy for people to ride; (someone's) car; (in an amusement park) an amusement device (n) for people to ride. Ride) (English, US, France) Ryder (person name)"],"usphone":"raɪd","ukphone":"raɪd"},{"name":"swim","trans":["vi. swimming; floating; dipping; vertigo vt. swim past; make it float n. Swim; float; faint adj. The one you wear while swimming"],"usphone":"swɪm","ukphone":"swɪm"},{"name":"throw","trans":["vt. throw; throw; throw vi. throw; throw n. throw; risk"],"usphone":"θrəʊ","ukphone":"θrəʊ"},{"name":"win","trans":["vt. Win; win in... vi. Win; Win; Success n. Win; Win n. (Win) Name; (Germany, Holland, Myanmar) Wen; (English) Wen (Female nickname Winifred)"],"usphone":"wɪn","ukphone":"wɪn"},{"name":"calf","trans":["n. [Anatomy] fibula, calf; calf; calf skin; cub (of large mammals such as whales)"],"usphone":"kɑːf","ukphone":"kɑːf"},{"name":"chick","trans":["n. Chicks; birds; young women adj. timid; cowardly n. (Chick) name; (English) Chick"],"usphone":"tʃɪk","ukphone":"tʃɪk"},{"name":"cub","trans":["n. Juveniles; young people who don't understand the rules vi. Giving birth to young animals"],"usphone":"kʌb","ukphone":"kʌb"},{"name":"foal","trans":["n. Foals (especially horses, donkeys, mules under one year old) v. Foals, (horses, etc.)"],"usphone":"fəʊl","ukphone":"fəʊl"},{"name":"kid","trans":["n. Kids; Little Goats vt. Deceive; make fun of; tease vi. deceive; make fun of; make fun of adj. Made of small goatskin; younger n. (Kid) name; (English) Kidd"],"usphone":"kɪd","ukphone":"kɪd"},{"name":"lamb","trans":["n. Lamb, lamb; lamb meat vt. Raising lambs, producing lambs vi. Lamb production, lamb production n. (Lamb) name; (English) Lamb; (German) Lamb"],"usphone":"læm","ukphone":"læm"},{"name":"count","trans":["v. Counting; calculating the total number; counting..., including; important; formally accepted; considered as n. total; count; count; count of quantity; matters, charges; opinions; count (of yarn) n. (count) (US) count (US) count (name of person)"],"usphone":"kaʊnt","ukphone":"kaʊnt"},{"name":"five","trans":["n. Five, five; five dollar bill num. Five, five adj. Five's; five n. (five) names; () Fifer"],"usphone":"faɪv","ukphone":"faɪv"},{"name":"four","trans":["num. Four, four n. A group of four people (or things); (cricket) one hit in four; (clothes, etc.) number four; four-point cards; four-bar rowing, four-person rowing team adj. Four; four n. (Four) (French, US) Faure (personal name)"],"usphone":"fɔː(r)","ukphone":"fɔː(r)"},{"name":"one","trans":["num. One; one; one year old; one hour pron. A person; any person, people (general term); that person; that kind of person (specified) det. one (emphasizes someone or something); one (for a more similar person or thing); some (before the name of someone you don't know) adj. unique; one n. 1; one dollar note n. (One) (India, Malaysia, US) Wen (name of person)"],"usphone":"wʌn","ukphone":"wʌn"},{"name":"seven","trans":["num. Seven, seven n. Seven people; seven o'clock; seven-year-old adj. Seven; seven n. (Seven) (Turkish, French, Russian), Xie Wen (personal name)"],"usphone":"ˈsevn","ukphone":"ˈsevn"},{"name":"sheep","trans":["n. Sheep, sheep; cowards"],"usphone":"ʃiːp","ukphone":"ʃiːp"},{"name":"six","trans":["num. Number 6; six; a group of six people (or things); six years old; six o'clock n. (six) (American, German) six (name)"],"usphone":"sɪks","ukphone":"sɪks"},{"name":"three","trans":["n. Three, three num. Three adj. Three, three"],"usphone":"θriː","ukphone":"θriː"},{"name":"two","trans":["n. Two adj. Two nums. two"],"usphone":"tuː","ukphone":"tuː"},{"name":"cat","trans":["n.Cats, feline animals"],"usphone":"kæt","ukphone":"kæt"},{"name":"clean","trans":["adj. Clean, clean; innocent vt. Make it clean vi. Clean, clean adv. Completely n. Clean n. (Clean) person's name; (English) Klein"],"usphone":"kliːn","ukphone":"kliːn"},{"name":"climb","trans":["v. Climbing; climbing; climbing; (plants growing along a wall or shelf); promotion; (road) inclination upward; climbing; climbing in (or climbing out) with effort n. Climbing; adding value; improving (position or social status); climbing (ranking); mountain (to be climbed in mountaineering or climbing); mountain trail; (of an airplane) climbing"],"usphone":"klaɪm","ukphone":"klaɪm"},{"name":"eat","trans":["vt. Eat, drink; corrode; annoy vi. eating; corrosion, erosion"],"usphone":"iːt","ukphone":"iːt"},{"name":"hide","trans":["vt. Concealing; concealing; whipping vi. hide n. Hide; animal hide; hiding place"],"usphone":"haɪd","ukphone":"haɪd"},{"name":"look","trans":["vt. Look; expect; pay attention; aim; look like vi. Look; look; pay attention; look at n.; look; face n. (Look) name; (Sweden) Locke; (English) Luke"],"usphone":"lʊk","ukphone":"lʊk"},{"name":"play","trans":["vt. Game; play; play; compete with... vi. Play; play; perform; participate in contests n. Games; Contest; Screenplay n. (Play) Name of person; (France, Sweden) Play"],"usphone":"pleɪ","ukphone":"pleɪ"},{"name":"run","trans":["vi. Operation; running; operation vt. Management, management; operation; participation n. Running; racing; trends; running route n. (Run) name; (Se) Rune"],"usphone":"rʌn","ukphone":"rʌn"},{"name":"sleep","trans":["vi. Sleep n. Sleep n. Sleep n. (Sleep) person's name; (English) Sleep"],"usphone":"sliːp","ukphone":"sliːp"},{"name":"brown","trans":["adj. Brown, brown; sun-tanned vi. Turns brown n. Brown, brown vt. Turn brown n. (Brown) name; (English, Italian, Finnish, Czech, German, French, Spanish, Portuguese) Brown"],"usphone":"braʊn","ukphone":"braʊn"},{"name":"color","trans":["n. Color; skin tone; pigment; face color vt. Whitewash; color...; distort vi. changes color; acquires color"],"usphone":"ˈkʌlə(r)","ukphone":"ˈkʌlə(r)"},{"name":"gray","trans":["adj. gray; pale; gray-haired; gloomy n. gray; dim light vi. Become grey or grey vt. Make gray or gray n. (Gray) person's name; (Italian) Gray; (English, French, Portuguese, Swedish) Grey"],"usphone":"ɡreɪ","ukphone":"ɡreɪ"},{"name":"orange","trans":["n. Orange, tangerine; orange juice, tangerine drink; orange tree, orange tree; orange, orange; orange yellow butterfly adj. Orange-red, orange-yellow; n. (Orange) (American, French, Russian, English) of the Orange Party or Society; Olinch (personal name)"],"usphone":"ˈɒrɪndʒ","ukphone":"ˈɒrɪndʒ"},{"name":"pink","trans":["adj. pink; homosexual; slightly left-leaning, more aggressive; caryophyllaceae; ruddy; excited-n. pink; pink; (informal) left-leaning people; elite, model; caryophyllaceae; pointed sailboats; (old) yellowish pigment v. (car engine) explodes; turns pink; jagged; punches, stabs, pokes; ridicule, criticism; (close fit) cut (wool) n. (Pink) (pink) (pink) Canada, Germany, Philippines) Pink (personal name)"],"usphone":"pɪŋk","ukphone":"pɪŋk"},{"name":"purple","trans":["adj. purple; imperial; flashy n. purple; purple robe vi. Turned purple vt. Make purple"],"usphone":"ˈpɜːpl","ukphone":"ˈpɜːpl"},{"name":"bird","trans":["n. Birds; guys; badminton vt. Cheer for...; cheer vi. Bird hunting; observational study of wild birds n. (Bird) name; (English, Spanish) Bird"],"usphone":"bɜːd","ukphone":"bɜːd"},{"name":"city","trans":["n. City, city adj. urban; metropolitan"],"usphone":"ˈsɪti","ukphone":"ˈsɪti"},{"name":"farm","trans":["n. Farms; farmhouses; farms, feedlots; production (or processing) enterprises v. farming, farming, animal husbandry; outsourcing...; putting (someone) in foster care; (temporarily) transfer, rent out; subcontract (taxation)"],"usphone":"fɑːm","ukphone":"fɑːm"},{"name":"mountain","trans":["n. Mountain; Mountain n. (Mountain) person's name; (English) Mountain"],"usphone":"ˈmaʊntən","ukphone":"ˈmaʊntən"},{"name":"street","trans":["n. Street adj. n. (Street) name of the street; (English, Portuguese) Street; (German) Strait"],"usphone":"striːt","ukphone":"striːt"},{"name":"table","trans":["n. Tables; tables; level ground vt. watch-making; shelving; embedding adj. n. (Table) name of the person at the table; (Luo) Tablai"],"usphone":"ˈteɪbl","ukphone":"ˈteɪbl"},{"name":"boat","trans":["n. Small boat; ship vi. rowing"],"usphone":"bəʊt","ukphone":"bəʊt"},{"name":"build","trans":["vt. Build; build vi. architecture; construction n. Structure; body shape; physique"],"usphone":"bɪld","ukphone":"bɪld"},{"name":"castle","trans":["n. Castles; cars in chess vt. Place... in a castle; build a castle to defend n. (Castle) person's name; (English) Castle"],"usphone":"ˈkɑːsl","ukphone":"ˈkɑːsl"},{"name":"house","trans":["n. Homes; households; institutions; parliaments; buildings for a certain purpose vt. Cover; live in... the house; store... in the room vi. Name of person staying in n. (House); (English) House"],"usphone":"haʊs","ukphone":"haʊs"},{"name":"maze","trans":["n. Labyrinth; bewilderment; confusion vt. lose; confuse; confuse n. (Maze) names; (English) Metz; (French) Maze"],"usphone":"meɪz","ukphone":"meɪz"},{"name":"plane","trans":["n. Aircraft; plane; degree, level vi. planing; traveling by plane; soaring vt. Flatten; use a grater; skim over the surface of the water adj. Flat; flat n. (Plane) person's name; (Serbia, Sweden, France) Plane"],"usphone":"pleɪn","ukphone":"pleɪn"},{"name":"car","trans":["n. Car; car n. (Car) person's name; (Earth) Jarr; (French, Western) Carl; (Se) Tsar"],"usphone":"kɑː(r)","ukphone":"kɑː(r)"},{"name":"door","trans":["n. Door; home, door; doorway; channel n. (Door) person's name; (English) Dole"],"usphone":"dɔː(r)","ukphone":"dɔː(r)"},{"name":"engine","trans":["n. Engines, engines; locomotives, locomotives; tools"],"usphone":"ˈendʒɪn","ukphone":"ˈendʒɪn"},{"name":"light","trans":["n. Light; light; lamp; lighter; understanding; light color; sunroof adj. Light; light-colored; bright; relaxed; easy; light vi. Light; brighten; ignite vt. Illuminate; ignite; ignite adv. Lightly; clearly; lightly n. (Light) (English) Wright (personal name)"],"usphone":"laɪt","ukphone":"laɪt"},{"name":"seat","trans":["n. Seat; location; position vt. Sit down...; accommodate...; put into office"],"usphone":"siːt","ukphone":"siːt"},{"name":"trunk","trans":["n. Tree trunks; trunk; elephant nose; trunk at the rear of a car vt. Put... in the suitcase adj. Trunk's; trunk's; n. (trunk) name of the box; (German, German, Western) Trenk"],"usphone":"trʌŋk","ukphone":"trʌŋk"},{"name":"wheel","trans":["n. Wheel; steering wheel; rotation vt. Rotate; change direction; install wheels for... vi. Rotation; abrupt change of direction; circling flight"],"usphone":"wiːl","ukphone":"wiːl"},{"name":"window","trans":["n. window; window; window"],"usphone":"ˈwɪndəʊ","ukphone":"ˈwɪndəʊ"},{"name":"kitten","trans":["n. Kittens; small animals vi. The name of the person who gave birth to kitten n. (Kitten); (France) Kiten"],"usphone":"ˈkɪtn","ukphone":"ˈkɪtn"},{"name":"many","trans":["det. A lot of prons. Many; many people adj. Many n. Most people n. (Many) (US, France, Canada, India) Mani (name of person)"],"usphone":"ˈmeni","ukphone":"ˈmeni"},{"name":"backpack","trans":["n. Backpacks, backpacks; hiking backpacks vt. Pick up; put... in a backpack vi. Travel with easy luggage; carry"],"usphone":"ˈbækpæk","ukphone":"ˈbækpæk"},{"name":"crayon","trans":["n. Crayons, colored chalk vt. Draw with crayons, use colored chalk to draw n. (Crayon) names; (English) Crane"],"usphone":"ˈkreɪən; ˈkreɪɒn","ukphone":"ˈkreɪən; ˈkreɪɒn"},{"name":"eraser","trans":["n. Eraser; eraser; [meter] eraser"],"usphone":"ɪˈreɪzə(r)","ukphone":"ɪˈreɪzə(r)"},{"name":"pencil","trans":["n. Pencils; pen-like objects vt. Write with a pencil; apply vi with an eyebrow pencil. In the shape of a pencil"],"usphone":"ˈpensl","ukphone":"ˈpensl"},{"name":"ruler","trans":["n. ruler; ruler; [measure] line board, person who lines"],"usphone":"ˈruːlə(r)","ukphone":"ˈruːlə(r)"},{"name":"sweater","trans":["n. Sweaters, sweatshirts; people who sweat a lot, diaphoretics"],"usphone":"ˈswetə(r)","ukphone":"ˈswetə(r)"},{"name":"bell","trans":["n. Bells, bells; bells, ringing; bell-like objects vt. Set the bell in, and tie the bell to vi. A bell rings; it bulges like a bell"],"usphone":"bel","ukphone":"bel"},{"name":"candle","trans":["n. Candles; candlelight; candle-shaped objects vt. Check against light"],"usphone":"ˈkændl","ukphone":"ˈkændl"},{"name":"cookie","trans":["n.Cookies; small desserts"],"usphone":"ˈkʊki","ukphone":"ˈkʊki"},{"name":"flower","trans":["n.Flowers; essences; flowering plants vi. maturity, development; flowering; prosperity vt. Make flowers bloom; decorate n. (Flower) people's names with flowers; (English) Flower"],"usphone":"ˈflaʊə(r)","ukphone":"ˈflaʊə(r)"},{"name":"make","trans":["vt. Make; carry out; arrange, prepare, organize; manufacture; think; obtain; form; arrange; cause; constitute vi. Start; advance; grow; be made n. Manufactured; structure; temperament n. (Make) person's name; (Sai, South Africa) Mark"],"usphone":"meɪk","ukphone":"meɪk"},{"name":"Santa","trans":["n. Santa Claus (equivalent to Santa Claus)"],"usphone":"'sæntə","ukphone":"'sæntə"},{"name":"snowflake","trans":["n. snowflakes; snowflakes; unique, special people (informal); overly sensitive people (informal)"],"usphone":"ˈsnəʊfleɪk","ukphone":"ˈsnəʊfleɪk"},{"name":"snowman","trans":["n. Snowman n. (Snowman) name; (English) Snowman"],"usphone":"ˈsnəʊmæn","ukphone":"ˈsnəʊmæn"},{"name":"tree","trans":["n. Trees; lumber; tree-like objects vt. Catch up... to the tree vi. Climb up a tree; run away from a tree n. (Tree) person's name; (English) Terry"],"usphone":"triː","ukphone":"triː"},{"name":"food","trans":["n. Food; nutrients"],"usphone":"fuːd","ukphone":"fuːd"},{"name":"hand","trans":["n. Hands, craftsmanship; help; pointers; meddling vt. Transfer, hand over; support; help n. (Hand) name; (English, Sweden) Hand"],"usphone":"hænd","ukphone":"hænd"},{"name":"not","trans":["Adv. Indicate negative, not n. “not” (a type of logical operation in computers)"],"usphone":"nɒt","ukphone":"nɒt"},{"name":"room","trans":["n. Room; space; leeway; opportunity; everyone in the room vt. Provide accommodation for...; rent, share; stay, stay... vi. Residence; Accommodation n. (English) Rum (name); (Russian) Roma (name)"],"usphone":"ruːm; rʊm","ukphone":"ruːm; rʊm"},{"name":"shoe","trans":["n. Shoes; horseshoes; outer tube vt. Put on... shoes; wear... shoes n. (Shoe) name of person; (English) Hugh"],"usphone":"ʃuː","ukphone":"ʃuː"},{"name":"bake","trans":["vt. Bake, bake vi. Baked bread; baked dry; heated n. Baked; baked goods n. (Bake) name; (Germany, Sweden) Buck"],"usphone":"beɪk","ukphone":"beɪk"},{"name":"bike","trans":["n. Bicycles; bicycles vi. Cyclist (or motorcycle) n. (Bike) name; (Dukou, Sai) Bick"],"usphone":"baɪk","ukphone":"baɪk"},{"name":"dad","trans":["n. Dad; Dad n. (Dad) name; (Meng, Baki, Afu) Dade; (Tai) Da"],"usphone":"dæd","ukphone":"dæd"},{"name":"garden","trans":["n. Garden; vegetable garden vt. Cultivated flowers and trees vi. Engaged in gardening; planting n. (Garden) name in the garden; (English, Italian, Baki) Garden"],"usphone":"ˈɡɑːdn","ukphone":"ˈɡɑːdn"},{"name":"hug","trans":["v. Hug; hold tight; hold tight; hold tight; hold, hold on; hold (your body or something) n. Hug; (in wrestling) hold n. (Hug) (US, Mexico, West) Rain Ge (person's name)"],"usphone":"hʌɡ","ukphone":"hʌɡ"},{"name":"walk","trans":["v. Walking, walking; walking; walking; walking; accompanying... walking; being stolen; (ghost) infestation; (informal) release from suspicion; (baseball) free entry; (ancient) life; guide...; (informal) abandon n. walk, walk; path; (postman's) delivery route; forest area (ranger); forest area under the jurisdiction of (rangers); cockfighting farm; beagle breeding farm; leisurely pace; (baseball) free landing (n) walk (n) US) Walker (name)"],"usphone":"wɔːk","ukphone":"wɔːk"},{"name":"write","trans":["vi. Write, write; write, compose; write a letter vt. write, write; write to; write"],"usphone":"raɪt","ukphone":"raɪt"},{"name":"easy","trans":["adj. Easy; comfortable adv. Effortlessly and calmly vi. Stop paddling vt. Issuing a suspension order"],"usphone":"ˈiːzi","ukphone":"ˈiːzi"},{"name":"game","trans":["n. Games; contests; prey adj. Brave vi. Gambling n. (Game) name; (English) Gam; (French) Gam; (West) Game"],"usphone":"ɡeɪm","ukphone":"ɡeɪm"},{"name":"jump","trans":["v. Jumping; crossing; moving fast; surging, skyrocketing; abrupt change; omitting; running a red light; raid; having sex; boosting starting (vehicle) n. Jump; skyrocket; drastic change; shock jump; obstacle (in an equestrian game); (bridge) jumping; sexual intercourse n. (Jump) (US) Jiang Pu (name of person)"],"usphone":"dʒʌmp","ukphone":"dʒʌmp"},{"name":"math","trans":["n. Mathematics (equal to mathematics) n. (Math) name; (German) Matt; () Ma; (English) Maas"],"usphone":"mæθ","ukphone":"mæθ"},{"name":"puzzle","trans":["v. Confuse, (make) confuse; think hard (because of confusion); make... difficult n. Mysteries, intellectual games; mosaic toys; unsolved mysteries; enigmatic people or things"],"usphone":"ˈpʌzl","ukphone":"ˈpʌzl"},{"name":"fifteen","trans":["n. 15; 15; 15 person rugby team adj. Fifteen's num. fifteen"],"usphone":"ˌfɪfˈtiːn","ukphone":"ˌfɪfˈtiːn"},{"name":"fifty","trans":["n. Fifty; fifty; something numbered 50 adj. Fifty; fifty; many"],"usphone":"ˈfɪfti","ukphone":"ˈfɪfti"},{"name":"forty","trans":["n. 40 adj. Forty's; forty's"],"usphone":"ˈfɔːti","ukphone":"ˈfɔːti"},{"name":"tempura","trans":["n.Tempura (Japanese cuisine)"],"usphone":"temˈpʊərə; ˈtempərə","ukphone":"temˈpʊərə; ˈtempərə"},{"name":"thirty","trans":["n. Thirties num. Thirty adj. Thirty"],"usphone":"ˈθɜːti","ukphone":"ˈθɜːti"},{"name":"twenty","trans":["n. Twenties; 20s num. Twenty adj. Twenty's"],"usphone":"ˈtwenti","ukphone":"ˈtwenti"},{"name":"book","trans":["n. Books; Volumes; Books of Accounts; Roster; Workbooks vt. Reservation; registration n. (Book) name; (Chinese) Bu (Cantonese, Waitama); (North); (English) Booker; (Sweden) Bock"],"usphone":"bʊk","ukphone":"bʊk"},{"name":"friend","trans":["n. Friend; Assistant; Sponsor n. (Friend) Name; (English) Flanders"],"usphone":"frend","ukphone":"frend"},{"name":"lamp","trans":["n. Lamps; irradiators vt. Illuminate vi. Illuminated n. (Lamp) person's name; (English, German, German, Swedish) Lampe"],"usphone":"læmp","ukphone":"læmp"},{"name":"picture","trans":["n. Photographs, pictures; videos; scenery; avatars vt. painting; imagining; describing"],"usphone":"ˈpɪktʃə(r)","ukphone":"ˈpɪktʃə(r)"},{"name":"see","trans":["vt. Seeing; understanding; understanding; observing; visiting vi. See; see; understand n. (See) names; (English) Xi; () Sai; (Germany) Ze"],"usphone":"siː","ukphone":"siː"},{"name":"toy","trans":["n. Toys; small ornaments; worthless items vi. Play; flirt; treat adj casually. As a toy; n. (Toy) (US) Toy (name of person) that looks like a toy"],"usphone":"tɔɪ","ukphone":"tɔɪ"},{"name":"carry","trans":["vt. Take and carry; carry; support; carry vi. Can be achieved; carried; carried n. Carried; [measured] position; range n. (Carry) name of person; (English) Kari"],"usphone":"ˈkæri","ukphone":"ˈkæri"},{"name":"cook","trans":["v. Cooking, cooking; (food) being cooked; (informal) tampering, falsification; conspiracy; able to work well n. Chef n. (Cook) (US) Cook (name of person)"],"usphone":"kʊk","ukphone":"kʊk"},{"name":"draw","trans":["vt. Draw; pull; attract vi. Pull; drag n. Draw; Draw n. (Draw) person's name; (English) Delau"],"usphone":"drɔː","ukphone":"drɔː"},{"name":"mom","trans":["n. Mother n. (Mom) name; () Mongolian"],"usphone":"mɒm","ukphone":"mɒm"},{"name":"read","trans":["vt. Read; read, understand vi. Read; read it up n. Read; book adj. An educated n. (Read) name; (English) Reed"],"usphone":"riːd","ukphone":"riːd"},{"name":"sing","trans":["vi. Singing; praising; chirping; calling vt. Sing; praise with poetry; sing to make n. sing; cry; howl n. (Sing) person's name; (old, de, tai) Sing"],"usphone":"sɪŋ","ukphone":"sɪŋ"},{"name":"smile","trans":["v. Smile; express with a smile; show (some kind of smile) n. Smile, smile; happy color n. (Smile) (Russian, Indian, American) Smiley (name of person)"],"usphone":"smaɪl","ukphone":"smaɪl"},{"name":"deer","trans":["n. Deer n. (Deer) person's name; (English) Deer"],"usphone":"dɪə(r)","ukphone":"dɪə(r)"},{"name":"forest","trans":["n. Forest, wooded area; a thicket (similar to a forest); royal woodland, hunting grounds v. planted in; covered by forest n. (Forest) Forest (name of person)"],"usphone":"ˈfɒrɪst","ukphone":"ˈfɒrɪst"},{"name":"fox","trans":["n. Fox; cunning person; fox skin; vixen, sexy woman v. Can't guess; deceive, confuse; use cunning methods n. (Fox) (England, America, Germany, Dan, Love) Fox (name of person)"],"usphone":"fɒks","ukphone":"fɒks"},{"name":"mushroom","trans":["n. Mushrooms, condylus; mushroom-shaped objects; upstart adj. Mushrooms; mushroom-shaped; rapidly growing vi. Rapid growth; mushroom picking; rapid growth"],"usphone":"ˈmʌʃrʊm; ˈmʌʃruːm","ukphone":"ˈmʌʃrʊm; ˈmʌʃruːm"},{"name":"rabbit","trans":["n. Bunnies, hares vt. Let's... go to hell vi. Hare hunting"],"usphone":"ˈræbɪt","ukphone":"ˈræbɪt"},{"name":"squirrel","trans":["n. Squirrel; squirrel fur vt. repositioned"],"usphone":"ˈskwɪrəl","ukphone":"ˈskwɪrəl"},{"name":"stream","trans":["n. Stream; Flow; Tide; Light; (Data) Stream vi. flow; influx; drift vt. flow out; gush out; make flutter"],"usphone":"striːm","ukphone":"striːm"},{"name":"blue","trans":["adj. Blue; melancholy, pessimistic; bluish (due to cold or trouble breathing), blue-violet; (movie, joke, or story) erotic, yellow; (meat) unripe; (politically) conservative n. blue; blue items; (Oxford or Cambridge University athletes) blue honors; mistakes; redheads; fights vt. (Make) Blue; Dye... Blue; Give... Blue Bleach; Splurge (money) n. (Blue) (UK, US, Canada, Australia, New Zealand) Blue (name of person)"],"usphone":"bluː","ukphone":"bluː"},{"name":"fruit","trans":["n. Fruit; Product vi. The results are real vt. Make... result n. (Fruit) person's name; (French) Freud; (English) Fruitt"],"usphone":"fruːt","ukphone":"fruːt"},{"name":"green","trans":["adj. green; youthful n. green; youth vt. Make... green vi. Turn green n. (Green) person's name; (English, Italian) Greene; (Sweden, Finn) Glenn"],"usphone":"ɡriːn","ukphone":"ɡriːn"},{"name":"red","trans":["adj. Red, red; (hair) reddish brown; (face) reddish; (eyes) red; (eyes) red; revolutionary, aggressive; (human) red; red (wine) red; (wine) red; (indicating stop) red (light), red (flag); prohibited, dangerous; (indicated by red signs on ski trails) second most difficult; (physical) red, one of the three colors of quark; red (especially when used in the Cold War); stained with blood; (ancient or poetry/literature) bleeding; (Xhosa) n. red, red pigment from traditional tribal culture ; red coat; red wine; red thing (or person); deficit, deficit; activist n. (Red) Red (person name)"],"usphone":"red","ukphone":"red"},{"name":"yellow","trans":["adj. Yellow; yellow-skinned adj. timid n. Yellow; yellow people; yellow pigment vi. Yellowing or yellowing vt. Yellowing or yellowing"],"usphone":"ˈjeləʊ","ukphone":"ˈjeləʊ"},{"name":"apple","trans":["n. An apple, an apple tree, something like an apple; [American] bombs, grenades, (baseball) balls; [American] people, guys."],"usphone":"ˈæpl","ukphone":"ˈæpl"},{"name":"banana","trans":["n. Banana; comedian; Big Hawk Nose n. (Banana) name; (Portugal, Tianjin) Banana"],"usphone":"bəˈnɑːnə","ukphone":"bəˈnɑːnə"},{"name":"cherry","trans":["n. Cherry; cherry tree; bright red like a cherry; hymen, virgin n. (Cherry) name; (French, Arabic) Cherie; (English) Cherie (nickname of the female teaching name Charity)"],"usphone":"ˈtʃeri","ukphone":"ˈtʃeri"},{"name":"lemon","trans":["n. Lemon; lemon juice; lemon tree; lemon color; waste; idiot adj. Light yellow, lemon-colored n. (Lemon) (US) lemon (name)"],"usphone":"ˈlemən","ukphone":"ˈlemən"},{"name":"pear","trans":["n. [Horticulture] Pear Tree; Pear n. (Pear) Name; (English) Peel"],"usphone":"peə(r)","ukphone":"peə(r)"},{"name":"fish","trans":["n. Fish; Fish; Pisces; Joint Board; (informal) weirdo; (informal) torpedo v. Fishing, fishing; searching; asking for news; salvage; patching n. (Fish) (American, Love) Fish (name of person) with a junction board"],"usphone":"fɪʃ","ukphone":"fɪʃ"},{"name":"float","trans":["v. Float, float; drift; float; drift; arrange (loan) for consideration (idea or plan); issue (stock) listing; implement (currency exchange rate) free floating (currency exchange rate); spare change (used by bars, etc. to find change for customers); floats, floats; floats; drinks with ice cream; floats; drinks with ice cream; floating period; sitting in a floating box (treatment of illness, healing, or relaxation); lifebuoy n. (Float) (US, UK, Germany) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Person's name)"],"usphone":"fləʊt","ukphone":"fləʊt"},{"name":"paddle","trans":["n. Paddling; paddle wing vt. Stir; stir; use a paddle to stroke vi. Paddling; playing in the water; wading"],"usphone":"ˈpædl","ukphone":"ˈpædl"},{"name":"sail","trans":["vi. Sailing; setting sail, setting sail n. Sail, tent; sailing vt. voyages"],"usphone":"seɪl","ukphone":"seɪl"},{"name":"splash","trans":["v. Spilling; splashing (water, mud, etc.) on...; walking with splashing water (in water); (in a prominent position) publishing n. The sound of falling water; splashing water; color blocks; (informal) a small amount of liquid mixed with beverages; (informal) highlights; (informal) compelling effects"],"usphone":"splæʃ","ukphone":"splæʃ"},{"name":"water","trans":["n. Water; seawater; rainwater; ocean, large areas of water vt. Moisten; supply water; water... vi. Adding water; crying; drooling n. (Water) person's name; (English) Water"],"usphone":"ˈwɔːtə(r)","ukphone":"ˈwɔːtə(r)"},{"name":"belt","trans":["n. Belt; belt; zone vt. Fasten it with a strap; hit it with a belt vi. Attack n. (Belt) person's name; (English, French, German, Spanish) Belt"],"usphone":"belt","ukphone":"belt"},{"name":"glasses","trans":["n. [light] glasses; glass (plural form of glass); binoculars v. put... in a glass container; fill... with glass (3rd person singular form of glass)"],"usphone":"'glɑːsɪz","ukphone":"'glɑːsɪz"},{"name":"jacket","trans":["n. Down ski shirts; short suit jackets; short blouses, jackets; potato skins; book covers; document holders, briefcases vt. Put on... a jacket; put a jacket on...; put a protective seal on...; hit the 'mouth'"],"usphone":"ˈdʒækɪt","ukphone":"ˈdʒækɪt"},{"name":"pants","trans":["n.Pants"],"usphone":"pænts","ukphone":"pænts"},{"name":"put","trans":["vt. Place; express; move; place; grant vi. start; hit; sail; sprout n. throw; idiot; throw; monster adj. A fixed n. (Put) person's name; (Thai, Myanmar) Bu"],"usphone":"pʊt","ukphone":"pʊt"},{"name":"shirt","trans":["n. Shirts; undershirts, underwear"],"usphone":"ʃɜːt","ukphone":"ʃɜːt"},{"name":"sock","trans":["n. Short socks; one-hit vt. Hit hard; put on... socks adv. On the ground; unbiased adj. A very successful n. (Sock) name; (German) Zock"],"usphone":"sɒk","ukphone":"sɒk"},{"name":"butterfly","trans":["n. Butterflies; butterfly swimmers; people with frivolous manners; people who seek pleasure"],"usphone":"ˈbʌtəflaɪ","ukphone":"ˈbʌtəflaɪ"},{"name":"dragon","trans":["n. Dragon; violent person, heinous person; strict and alert woman n. (Dragon) name; () Draugon; (English, French, Finn, Roe,) Dragon"],"usphone":"ˈdræɡən","ukphone":"ˈdræɡən"},{"name":"fly","trans":["vi. fly; fly; fly vt. flight; overflight; make it fly n. Fly; fly; two-winged insect adj. An agile n. (Fly) name; (French) Foley; (English) Fry"],"usphone":"flaɪ","ukphone":"flaɪ"},{"name":"kite","trans":["n. Kite vi. Use an empty check; fly like a kite; move briskly vt. Money fraud; falsification (check) n. (Kite) name; (Sai) Kit; (English) Kate"],"usphone":"kaɪt","ukphone":"kaɪt"},{"name":"rainbow","trans":["n. Rainbow; colorful arrangement; fantasy adj. Colourful; rainbow-shaped vt. Make a rainbow; decorate like a rainbow vi. Rainbow-shaped n. (Rainbow) person's name; (English) Raynbo"],"usphone":"ˈreɪnbəʊ","ukphone":"ˈreɪnbəʊ"},{"name":"shark","trans":["n. Sharks; crooks vi. Fraud vt. extortion"],"usphone":"ʃɑːk","ukphone":"ʃɑːk"},{"name":"bus","trans":["n. Bus by bus"],"usphone":"bʌs","ukphone":"bʌs"},{"name":"horse","trans":["n. Horses; cavalry; tripods; heroin vt. Make a horse ride; tie a horse to; tease vi. Horseback riding; making fun of person n. (Horse); (Sweden) Holser"],"usphone":"hɔːs","ukphone":"hɔːs"},{"name":"skateboard","trans":["n. Ice skating board vi. Glide with a skateboard"],"usphone":"ˈskeɪtbɔːd","ukphone":"ˈskeɪtbɔːd"},{"name":"train","trans":["n. Train; Queue; Long Line; Skirt v. Training; Aim n. (Train) Name; (English) Train; (France) Trane; (Italy) Traine"],"usphone":"treɪn","ukphone":"treɪn"},{"name":"golf","trans":["n. Golf; golf sport vi. Name of person playing golf n. (Golf); (West, North) Golf"],"usphone":"ɡɒlf","ukphone":"ɡɒlf"},{"name":"grandparent","trans":["n. Grandparents; grandparents; grandparents; maternal grandparents; maternal grandparents or grandmothers"],"usphone":"ˈɡrænpeərənt","ukphone":"ˈɡrænpeərənt"},{"name":"hike","trans":["n. Hiking, hiking; sharp rise (price, etc.); sharp rise v. hiking, hiking; pulling up, lifting (clothing); drastically increasing (price, etc.) n. (Hike) (US, Russian) Hake (name of person)"],"usphone":"haɪk","ukphone":"haɪk"},{"name":"paint","trans":["n. Paint; paint; (informal) makeup; three-second zone; painting function (especially simulating real painting effects); flower horse v. paint; apply makeup (face, skin); apply (liquid) to...; paint with a drawing program; display (aircraft, etc.) (on a radar screen); paint (picture); describe n. (Paint) (US) Pan (name of person)"],"usphone":"peɪnt","ukphone":"peɪnt"},{"name":"sew","trans":["vt. Sew, sew; sewing vi. sewing, sewing"],"usphone":"səʊ","ukphone":"səʊ"},{"name":"fog","trans":["n. Fog; smoke, dust; confusion vt. Blur; confuse; cover with fog vi. shrouded in fog; blurred n. (Fog) person's name; (Dan) Fu"],"usphone":"fɒɡ","ukphone":"fɒɡ"},{"name":"ghost","trans":["n. Ghost, ghost vt. Commit to work; catch a knife for...; write for people vi. Ghostwriting for someone else"],"usphone":"ɡəʊst","ukphone":"ɡəʊst"},{"name":"monster","trans":["n. Monsters; giants, beasts; cruel people adj. huge, huge"],"usphone":"ˈmɒnstə(r)","ukphone":"ˈmɒnstə(r)"},{"name":"pumpkin","trans":["n.Pumpkin"],"usphone":"ˈpʌmpkɪn","ukphone":"ˈpʌmpkɪn"},{"name":"web","trans":["n. Net; roll of paper; fins; fabric; trap vt. Wrap it with a net; make a middle trap vi. Form a network"],"usphone":"web","ukphone":"web"},{"name":"Halloween","trans":["n. Eve of Halloween (refers to the night of October 31)"],"usphone":"ˌhæləʊˈiːn","ukphone":"ˌhæləʊˈiːn"},{"name":"spider","trans":["n. Spiders; trap setters; tripods"],"usphone":"ˈspaɪdə(r)","ukphone":"ˈspaɪdə(r)"},{"name":"ball","trans":["n. Ball; prom vi. Clumps vt. Form a ball n. (Ball) name; (Earth) Baler; (English, Spanish) Ball; (French, German, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Czech)"],"usphone":"bɔːl","ukphone":"bɔːl"},{"name":"cage","trans":["n. Cage, animal cage; cell, prison vt. Put... in a cage; imprison... n. (Cage) name; (France) Kage; (English) Cage"],"usphone":"keɪdʒ","ukphone":"keɪdʒ"},{"name":"hamster","trans":["n. Hamsters; hamster fur"],"usphone":"ˈhæmstə(r)","ukphone":"ˈhæmstə(r)"},{"name":"home","trans":["n. Home, home; place of origin; hometown; shelter adv. At home, go home; deeply adj. Domestic, domestic; effective vt. Return home, return home n. (Home) name; (De, Finn) Holme; (English, Nee) Holm"],"usphone":"həʊm","ukphone":"həʊm"},{"name":"nest","trans":["n. Nest, nest; comfort nest; hotbed vt. Nesting; nesting vi. Build a nest; find a bird's nest n. (Nest) name; (German) Nester; (English) Nester (female teacher name Agnes, Welsh nickname)"],"usphone":"nest","ukphone":"nest"},{"name":"tube","trans":["n. Tubes; electronic tubes; tunnels; televisions vt. Form a tube; load... into a tube; transport it with a tube vi. By subway; failed"],"usphone":"tjuːb","ukphone":"tjuːb"},{"name":"pool","trans":["n. Joint ventures; pool; reservoirs; joint funding vi. Joint venture, partnership vt. Partnership n. (Pool) name; (English, Spanish) Poole; (Finn, De) Poole"],"usphone":"puːl","ukphone":"puːl"},{"name":"school","trans":["n. School; college; school; fish group vt. education"],"usphone":"skuːl","ukphone":"skuːl"},{"name":"store","trans":["n. Stores; reserves, storage; warehouses vt. Storage, storage n. (Store) name of person; (DE) Storey"],"usphone":"stɔː(r)","ukphone":"stɔː(r)"},{"name":"big","trans":["adj. Big; important; large adv. Massive land; smooth; exaggerating n. (Big) people's names; (Earth) Big"],"usphone":"bɪɡ","ukphone":"bɪɡ"},{"name":"hello","trans":["int. Hello; Hello, hello n. Use to greet, surprise, or call attention n. (Hello) person's name; (France) Eloh"],"usphone":"həˈləʊ","ukphone":"həˈləʊ"},{"name":"new","trans":["adj. New, fresh; updated; first-time adv. Recent n. (New) person's name; (English) New Zealand"],"usphone":"njuː","ukphone":"njuː"},{"name":"spotted","trans":["adj. spotted; spotted; spotted; stained v. discovered (past participle of spot); tainted; stained n. (Spotted) person's name; (English) Spotted"],"usphone":"ˈspɒtɪd","ukphone":"ˈspɒtɪd"},{"name":"striped","trans":["adj. striped; spotted v. stripped (past participle of strip)"],"usphone":"straɪpt","ukphone":"straɪpt"},{"name":"cold","trans":["adj. cold; frigid, unenthusiastic; unconscious n. cold; cold; cold adv. wholly"],"usphone":"kəʊld","ukphone":"kəʊld"},{"name":"hot","trans":["adj. Hot; spicy; passionate; exciting; urgent adv. Hot; urgently vi. Getting hot vt. Add; warm up... n. (Hot) names; (Se) Holt; (France) Ott"],"usphone":"hɒt","ukphone":"hɒt"},{"name":"people","trans":["n. People; humans; nations; citizens vt. live in; fill the occupancy"],"usphone":"ˈpiːpl","ukphone":"ˈpiːpl"},{"name":"place","trans":["n. Place; residence; seat vt. Placement; Appointment; Delivery vi. Top ranking; N. (Place) name; (France) Place; (France) Plus; (English) Price"],"usphone":"pleɪs","ukphone":"pleɪs"},{"name":"thing","trans":["n. Thing; Thing; Thing; Situation"],"usphone":"θɪŋ","ukphone":"θɪŋ"},{"name":"crawl","trans":["vi. crawling; walking on one's feet vt. crawling; walking slowly n. Crawling; fish pond; prostrate"],"usphone":"krɔːl","ukphone":"krɔːl"},{"name":"hop","trans":["v. Jumping on one foot; jumping on two feet or on one foot; suddenly going to a place quickly; (informal) making a quick trip; (informal) leaving quickly; (changing position quickly, etc.) jumping...; exchanging; (informal) jumping on (moving vehicle); express delivery; flavoring with hops n. Short distance jumping on both legs; short trips; hops; (informal) dancing; (informal) dancing; (informal) dancing; beer (drugs) Opium in particular) n. (Hop) (American) joint (name of person)"],"usphone":"hɒp","ukphone":"hɒp"},{"name":"swing","trans":["v. Swing; hang; jump; rotate; rotate (on the axis); move (boat, plane) to all positions; (abruptly) turn; walk with a big swing; hang; walk; walk; jump; throw at...; fly (cricket) sideways; change (mood or opinion); gain; have a decisive influence on...; successfully completed; strong sense of rhythm n. Swing; swing; rhythm; light action (cricket) Side flying ball; (politician) A trip with multiple stays; hitting; ups and downs adj. Strong rhythm jazz music; decisive n. (Swing) (American, Swedish, English), Swain (personal name)"],"usphone":"swɪŋ","ukphone":"swɪŋ"},{"name":"backward","trans":["adj. Backward; regressive; (human) intellectually retarded; backward; (site location) adv behind the line. Backwards; backwards; backwards (past); worse and worse; backwards backwards (equal to backwards) n. The back (or past) part n. (Backward) (US, Russian) Buckwalder (person name)"],"usphone":"ˈbækwəd","ukphone":"ˈbækwəd"},{"name":"fast","trans":["adj. Fast, quick; tight, steady adv. Quickly; tightly; thoroughly vi. Fasting, fasting n. Fasting; hunger strike n. (Fast) person name; (Germany, English, Russian, Finland, Czech, Sweden) Fast"],"usphone":"fɑːst","ukphone":"fɑːst"},{"name":"forward","trans":["Adv. Moving forward; sequentially; moving towards success; entering a prominent position; towards the future; ahead of time; at (or) the bow of the boat adj. Forward; (vehicle) in front; early; quick; future-related; reckless; advance v. delivery; forwarding; promotion; transportation n. (monetary) futures agreement n. (Forward) (US, Canada, UK, Australia) Forward (person name)"],"usphone":"ˈfɔːwəd","ukphone":"ˈfɔːwəd"},{"name":"slow","trans":["adj. Slow; decelerated; slow vi. Slowing down; becoming depressed vt. slow down; hinder adv. slowly; slowly n. (Slow) person's name; (English) Slow"],"usphone":"sləʊ","ukphone":"sləʊ"},{"name":"spin","trans":["vi. spinning; spinning; spinning; spinning; dazzling vt. spinning; weaving; netting n. Rotate; gallop"],"usphone":"spɪn","ukphone":"spɪn"},{"name":"body","trans":["n. Body; subject; mass; group; main part vt. Name a person with a physical n. (Body); (English, French, Luo) Bodie"],"usphone":"ˈbɒdi","ukphone":"ˈbɒdi"},{"name":"bunny","trans":["n. Bunnies (especially bunnies); cute girl n. (Bunny) name; (English) Bonnie; () Benny"],"usphone":"ˈbʌni","ukphone":"ˈbʌni"},{"name":"tail","trans":["n. Tails; trails; braids; tuxedo vt. Trailing; attaching the tail vi. Track; reduce or decrease adj. coming from behind; tail"],"usphone":"teɪl","ukphone":"teɪl"},{"name":"teeth","trans":["n. Teeth"],"usphone":"tiːθ","ukphone":"tiːθ"},{"name":"dream","trans":["n. Sleep; dreams, wishes; trance; very beautiful people (or things); fantasies; dreamlike things v. dreaming, dreaming; dreaming; wasting time; thinking; going out of business; imagining adj. ideal, perfect"],"usphone":"driːm","ukphone":"driːm"},{"name":"robot","trans":["n. Robots; remote control devices, automatic machines; people who work like machines"],"usphone":"ˈrəʊbɒt","ukphone":"ˈrəʊbɒt"},{"name":"space","trans":["n. Space; space; distance vi. Retention interval vt. Separated"],"usphone":"speɪs","ukphone":"speɪs"},{"name":"sport","trans":["n. Sports; games; entertainment; games; jokes vi. Game vt. Gaming; playing sports; boasting adj. sporting"],"usphone":"spɔːt","ukphone":"spɔːt"},{"name":"superpower","trans":["n. Superpowers; superpowers"],"usphone":"ˈsuːpəpaʊə(r); ˈsjuːpəpaʊə(r)","ukphone":"ˈsuːpəpaʊə(r); ˈsjuːpəpaʊə(r)"},{"name":"daisy","trans":["n. Daisies; Asteraceae; excellent stuff adj. excellent; superior"],"usphone":"ˈdeɪzi","ukphone":"ˈdeɪzi"},{"name":"lily","trans":["n. Lilies, lilies; plants similar to lilies; white things adj. White, pure n. (Lily) name; (Luo) Lily"],"usphone":"ˈlɪli","ukphone":"ˈlɪli"},{"name":"love","trans":["n. Love; Love; Preference; (nickname) Dear; Loving You; Loving Someone; Favorite Thing; Zero Score v. Love (someone); Caring; Liking (something or something); Loving n. (Love) (English, Philippines, United States) Love (name of person)"],"usphone":"lʌv","ukphone":"lʌv"},{"name":"mum","trans":["n. (informal) mom; (informal) (cultivated) chrysanthemums; beer adj. Silent; confidential v. plays (role) in traditional masquerade pantomime; plays (role) in English folk drama"],"usphone":"mʌm","ukphone":"mʌm"},{"name":"poppy","trans":["n. Poppies; plants of the genus Poppy; dark red adj. Of the poppy family"],"usphone":"ˈpɒpi","ukphone":"ˈpɒpi"},{"name":"rose","trans":["n. Roses; rosy red wine; rosy color; rosy skin tone; shower nozzle; rose-shaped crest adj. Rosy; rosy, pink v. rise; reach a higher level; stand up; rise (past tense of rise)"],"usphone":"rəʊz","ukphone":"rəʊz"},{"name":"sunflower","trans":["n.Sunflowers"],"usphone":"ˈsʌnflaʊə(r)","ukphone":"ˈsʌnflaʊə(r)"},{"name":"violet","trans":["n. Violets; Viola; shy people adj. Purple; violet-colored n. (Violet) name; (West) Violette; (French) Violette; (India, English) Violet"],"usphone":"ˈvaɪələt","ukphone":"ˈvaɪələt"},{"name":"gold","trans":["n. Gold, gold; gold; gold coins adj. Gold, gold; golden n. (Gold) names; (English, French, German, Western, Russian, Czech, Swedish) Gold"],"usphone":"ɡəʊld","ukphone":"ɡəʊld"},{"name":"parrot","trans":["n. Parrots; learners, vocalizers; people who mechanically imitate others vt. Mechanical imitation of n. (Parrot) name; (English, Russian, Portuguese) Parrot; (France) Parrot"],"usphone":"ˈpærət","ukphone":"ˈpærət"},{"name":"rope","trans":["n. Rope, rope vt. Bundle, bind vi. Twisted in the shape of a rope n. (Rope) person's name; (English) Rope; (Finn) Lope"],"usphone":"rəʊp","ukphone":"rəʊp"},{"name":"ship","trans":["n. Ship, ship; three (or more) masted sailboat; boat (especially racing); spaceship; aircraft v. transport (by boat, plane, truck); repatriation (someone); (putting) on the market; boarding a ship; (sailors) working on a ship; entering water from the side of the boat; putting (pulp in a pulp rack) inside the ship; installing (rudders, masts, etc.); providing a ship; boarding a boat; traveling by boat; (military order) continue sailing; serve on a ship n. (US) (Russian, US), English) Photo (person's name)"],"usphone":"ʃɪp","ukphone":"ʃɪp"},{"name":"baby","trans":["n. Babies, babies; childish people vt. Indulge, treat... like a baby adj. Baby's; baby's n. (Baby) name; (French, Portuguese) Bobby; (English) Bobby, Barbie (female name); (Russian) Babi"],"usphone":"ˈbeɪbi","ukphone":"ˈbeɪbi"},{"name":"cart","trans":["n. Two-wheeled wagons vt. Load vi with a car. Driving a wagon; using a van to transport n. (Cart) name of person; (France) Carl; (English, Finn) Carter"],"usphone":"kɑːt","ukphone":"kɑːt"},{"name":"dime","trans":["n. (American, Canadian) Very small coins; small amount of money; small things n. (Dime) (name of person)"],"usphone":"daɪm","ukphone":"daɪm"},{"name":"dollar","trans":["n. Dollar n. (Dollar) person's name; (English) dollar"],"usphone":"ˈdɒlə(r)","ukphone":"ˈdɒlə(r)"},{"name":"nickel","trans":["n. Nickel; nickel coins; five-cent nickel coins vt. Nickel-plated in the name of n. (Nickel); (German, English) Nikkel"],"usphone":"ˈnɪkl","ukphone":"ˈnɪkl"},{"name":"penny","trans":["n. (US) cents; pennies"],"usphone":"ˈpeni","ukphone":"ˈpeni"},{"name":"quarter","trans":["n. Quarter; region; quarter; one quarter hour; two corners and five points; section vi. Accommodation; residency vt. Divide... into four equal parts; for someone to stay num. quarters"],"usphone":"ˈkwɔːtə(r)","ukphone":"ˈkwɔːtə(r)"},{"name":"save","trans":["vt. Save; Save; Save; Rescue vi. Save; save prep. Other than... n. Rescue n. (Save) person's name; (France) Saf; (Italy, Poland, West, Russia, Sweden) Savey (female name), Savey (female name)"],"usphone":"seɪv","ukphone":"seɪv"},{"name":"cloth","trans":["n.Cloth; fabric; tablecloth adj. n. (Cloth) person's name on cloth; (German) Klott"],"usphone":"klɒθ","ukphone":"klɒθ"},{"name":"fork","trans":["n. Forks; forks; rakes vt. Fork; make into a fork vi. Fork; disagreement n. (Fork) person's name; (English, German) Falk"],"usphone":"fɔːk","ukphone":"fɔːk"},{"name":"glass","trans":["n. Glass; glass products; mirrors vt. Reflect; add glass to something vi. Glassy n. (Glass) name; (English, French, German, Italian) Glass"],"usphone":"ɡlɑːs","ukphone":"ɡlɑːs"},{"name":"knife","trans":["n. Knife; dagger vt. Cut with a knife; injure (mouth) vi. split; cross"],"usphone":"naɪf","ukphone":"naɪf"},{"name":"napkin","trans":["n. Napkins; napkins; diapers"],"usphone":"ˈnæpkɪn","ukphone":"ˈnæpkɪn"},{"name":"plate","trans":["n. Disc; metal plate; metal plate; photosensitive negative vt. Electroplating; name for... armored n. (Plate); (English, German, Russian, Spanish, Italian, Sweden) Platt"],"usphone":"pleɪt","ukphone":"pleɪt"},{"name":"spoon","trans":["n. Spoons, spoons; the amount of one ladle vt. Use a spoon; make spoon-shaped vi. Gently hit up"],"usphone":"spuːn","ukphone":"spuːn"},{"name":"cow","trans":["n. Cows, cows; mother beasts vt. threats, intimidation"],"usphone":"kaʊ","ukphone":"kaʊ"},{"name":"dog","trans":["n. Dogs; scumbags; () friends vt. tracking; trailing"],"usphone":"dɒɡ","ukphone":"dɒɡ"},{"name":"in","trans":["prep. In...; in...; in...; during...; in...; in...; in...; included in...; engaged in...; engaged...; used in... language, with... medium; in the process of (activity); in... years; when...; (derives the name of a person with a certain quality); in... (used between larger and lesser numbers); in... quantity; in... color; in... manner; has characteristics; according to (representation) adv. Entering; inside; arriving; elected; high tide; in the house; at the station; receiving; submitting, delivering; filling in, coloring; facing inward, in the middle; hitting; (ball) falling within the boundary; (clothing, etc.) fashionable adj. Inside; fashionable; n. rulers within the (ball) world; doorway"],"usphone":"ɪn; ˈɪn ðət","ukphone":"ɪn; ˈɪn ðət"},{"name":"out","trans":["Adv. Appearance; outward; outdoors; release from prison; remote; going out to sea; low tide; distance from the goal line or finish line; in a public place of entertainment; in public; in a loud place; exhaustion; until completed; completely; extinguished; removed; exit prep. Get out of... and leave adj. Extinguished; blooming; marketable; out of the game; unacceptable; out of date; inaccurate; intended to do...; knocked down and stunned by public v.; disclosing (someone) as homosexual; expelled; rejected; removing n. A way out; a way out of the game; (baseball) a way out of the game; an opposition party"],"usphone":"aʊt","ukphone":"aʊt"},{"name":"pig","trans":["n. Pigs; pork vi. Give birth to a little pig; live like a pig n. Police (slang, aggressive)"],"usphone":"pɪɡ","ukphone":"pɪɡ"},{"name":"add","trans":["vi. add; add; add up; do addition vt. add, add; add; calculate... sum n. Addition, addition"],"usphone":"æd","ukphone":"æd"},{"name":"beet","trans":["n.Beets; beetroot vt. Start a fire; repair; change"],"usphone":"biːt","ukphone":"biːt"},{"name":"carrot","trans":["n.Carrot bait"],"usphone":"ˈkærət","ukphone":"ˈkærət"},{"name":"cheese","trans":["n. [Food] cheese; cheese; VIP vt. Stop adj. rebellious; timid"],"usphone":"tʃiːz","ukphone":"tʃiːz"},{"name":"dressing","trans":["n. Seasoning (used to mix salads); fillers; dressings (to protect wounds); wear; paste (for finishing fabrics); fertilizer v. dress for...; dress for...; provide (or design) clothing for...; dress (present participle of dress)"],"usphone":"ˈdresɪŋ","ukphone":"ˈdresɪŋ"},{"name":"lettuce","trans":["n. [gardening] lettuce; lettuce; (US) notes"],"usphone":"ˈletɪs","ukphone":"ˈletɪs"},{"name":"onion","trans":["n.Onions; onion heads"],"usphone":"ˈʌnjən","ukphone":"ˈʌnjən"},{"name":"pepper","trans":["n. pepper; cayenne pepper; pepper vt. Add pepper to; cover n. (Pepper) with name; (English, German, Italian) pepper"],"usphone":"ˈpepə(r)","ukphone":"ˈpepə(r)"},{"name":"tomato","trans":["n.Tomato, tomato"],"usphone":"təˈmɑːtəʊ","ukphone":"təˈmɑːtəʊ"},{"name":"clown","trans":["n. Clowns; country people; rude and clumsy people vi. pretend to be a clown; pretend to be stupid"],"usphone":"klaʊn","ukphone":"klaʊn"},{"name":"comics","trans":["n.Comics; comic books; comedians (plural form of comic)"],"usphone":"'kɒmɪks","ukphone":"'kɒmɪks"},{"name":"laugh","trans":["v. Laugh, make a laugh; laugh and say n. Laugh (sound); something or person that makes you laugh"],"usphone":"lɑːf","ukphone":"lɑːf"},{"name":"pet","trans":["n. Pets; angry; loved ones vt. Love vi. Angry; caressing adj. Favorite n. (Pet) person's name; (Russian) Pet; ()"],"usphone":"pet","ukphone":"pet"},{"name":"tickle","trans":["vt. Make it itchy; make you happy; make you satisfied vi. Feeling itchy; (something) makes people itchy n. Arms; Itchy; Things that make people itchy and happy n. (Tickle) Name of person; (English) Tickle"],"usphone":"ˈtɪkl","ukphone":"ˈtɪkl"},{"name":"mall","trans":["n. Shopping malls, shopping malls; pedestrian commercial areas; walking trails; circus courts n. (Mall) (US, Switzerland) Myler (name of person)"],"usphone":"mɔːl; mæl","ukphone":"mɔːl; mæl"},{"name":"worker","trans":["n. Worker; worker; worker ant n. (Worker) name; (English) Walker"],"usphone":"ˈwɜːkə(r)","ukphone":"ˈwɜːkə(r)"},{"name":"lunch","trans":["n. Lunch v. Eat lunch; provide lunch vi. Eat lunch; provide lunch"],"usphone":"lʌntʃ","ukphone":"lʌntʃ"},{"name":"ape","trans":["n. [spine] ape; fool; imitator vt. Imitation; stealing lines adj. Enthusiastic n. (Ape) name; (Italian) Ape"],"usphone":"eɪp","ukphone":"eɪp"},{"name":"dolphin","trans":["n. Dolphin n. (Dolphin) name; (English) Dolphin"],"usphone":"ˈdɒlfɪn","ukphone":"ˈdɒlfɪn"},{"name":"elephant","trans":["n. Elephant; large drawing paper"],"usphone":"ˈelɪfənt","ukphone":"ˈelɪfənt"},{"name":"giraffe","trans":["n.Giraffes"],"usphone":"dʒəˈrɑːf","ukphone":"dʒəˈrɑːf"},{"name":"kangaroo","trans":["n.Kangaroos"],"usphone":"ˌkæŋɡəˈruː","ukphone":"ˌkæŋɡəˈruː"},{"name":"zebra","trans":["n. [spine] zebra adj. Zebra (stationery brand); Zebra (refers to a profitable and responsible company)"],"usphone":"ˈzebrə; ˈziːbrə","ukphone":"ˈzebrə; ˈziːbrə"},{"name":"bounce","trans":["v. Bounce; bounce; bounce; play with the child upside down on your lap; shake up and down; walk bounce; walk bouncing; return (check); tentatively reveal (idea); return (email); dismissal; eviction; intimidate (someone) to do; ask for other people's opinions; impact n. Bounce; elasticity; vitality; (sudden) rise; full confidence; elasticity (of hair); collision"],"usphone":"baʊns","ukphone":"baʊns"},{"name":"dump","trans":["v. Dump; throw away; forcibly drop; (informal) dumping; ending a relationship with (someone); (informal) abandoning; (informal) selling; unloading (data); (memory information) dumping n. Dump; dumping n. Trash; Waste pile; Mine waste pile; (informal) dirty place; temporary storage for military supplies; dump; (informal) poop n. (Dump) (US) Dump (name of person)"],"usphone":"dʌmp","ukphone":"dʌmp"},{"name":"fall","trans":["v. Falling; falling; sagging; kneeling; falling down (ground); falling (in quantity, etc.); falling (rain or snow); falling; falling (in a certain state); falling; falling (of snow, rock, etc.); falling (in quantity, etc.); fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; collapse, decay adj. n. (Fall) (West) Fowler (name of person) of autumn"],"usphone":"fɔːl","ukphone":"fɔːl"},{"name":"roll","trans":["v. Rolling; rolling over; turning (eyes); rolling in place; (horse) lying down; rocking from side to side; faltering; rolling (dice); rolling (dice); rolling (number of dice); (turning) shoulders; driving; pushing; shaking the car window; (liquid) falling; (time) passing; steady and continuous; (product) produced from (machine); flowing; rolling; rolling, rolling; rolling (clothes); rolling (clothes) edge) roll up; flatten; cover; start; use a vibrato (consonant, especially r) n. Roll; column; rolled food; roll; roll over ; Shaking from side to side; rumbling; small bread; total number of people; list; document; rolling mill; roll; roll a tube; roll a dice n. (Roll) (US, N., Ga) Roll (name of person)"],"usphone":"rəʊl","ukphone":"rəʊl"},{"name":"spray","trans":["n. Sprays, sprays; sprayers; water bubbles vt. Jet vi. Spray n. (Spray) person's name; (English) Spray"],"usphone":"spreɪ","ukphone":"spreɪ"},{"name":"kick","trans":["v. Kick, kick; be mad at (yourself); (in sports) kick score; recoil, backseat; (informal) successfully quit (habit) n. kick; (once) kick (movement); athlete with specific kicking ability; recoil, recoil; violent vibration; (billiards) irregular movement of the ball; (informal) extreme stimulation; (drug or alcohol) effectiveness; (ancient) concave bottom of glass bottle n. (Kick) (American, German, English) kick (name)"],"usphone":"kɪk","ukphone":"kɪk"},{"name":"lift","trans":["v. Lift; lift; raise (voice) volume; raise (voice) volume; lift (price); air transport; be lifted; spread; perform cosmetic surgery; dig; pick up and place; get rid of an unhappy mood; advance; win; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; (cricket) fly high; free lift; (cricket) fly high; free lift; (cricket) lift; free lift; free lift; (cricket)"],"usphone":"lɪft","ukphone":"lɪft"},{"name":"muscle","trans":["n. Muscles; strength vt. Strengthen; move hard; squeeze hard vi. Move hard"],"usphone":"ˈmʌsl","ukphone":"ˈmʌsl"},{"name":"pull","trans":["vt. Pull; pull; drag vi. Pull, drag; pull n. Pull, pull rope; pull force, traction; drag n. (Pull) name; (France) Pierre; (Germany, Sweden) Poole"],"usphone":"pʊl","ukphone":"pʊl"},{"name":"push","trans":["vt. Push, increase; pressure, persecute...; press; persuade vi. Advance; Increase; Strive for n. Push; Determination; Large-scale Offensive; Committed Pursuit"],"usphone":"pʊʃ","ukphone":"pʊʃ"},{"name":"stretch","trans":["v. stretching (soft or elastic); stretching; (making) excessive extension; (capital, resources) sufficient; extensive requirements; (making) maximum use (ability); exaggerating; continuing n. (limb or body) stretching; (muscle) stretching; stretching (of materials or clothing); difficult tasks; continuous stretch (of land or water); (time) continuous; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) lengthened motor vehicle adj. Elastic, stretchable n. (Stretch) (US) Strage (name of person)"],"usphone":"stretʃ","ukphone":"stretʃ"},{"name":"dig","trans":["vt. Dig, explore; explore vi. Dig n. Poke, stab; dig up n. (Dig) people's names; (Luo) Digger"],"usphone":"dɪɡ","ukphone":"dɪɡ"},{"name":"sit","trans":["vi. Sit; located at vt. Envoy n. (Sit) (U.S. and Canada) seat (name of person)"],"usphone":"sɪt","ukphone":"sɪt"},{"name":"fancy","trans":["v. Want to do; love; arrogance; imagine; think; think (especially speed racing) think... to win; (showing surprise or opposition) really didn't expect n. fantasy; imagination; hobby; the most popular person or animal (in sports such as horse racing); enthusiasts (of sports such as boxing); fancy cakes or cookies; (16th and 17th century musical terms) Fantasia adj. complex; expensive; delicate, fancy; imaginative; (food) high quality; (flower) variegated; (animal) n. (Fancy) fan (name) for viewing"],"usphone":"ˈfænsi","ukphone":"ˈfænsi"},{"name":"plain","trans":["adj. Flat; simple; plain; clear n. Plain; unformatted; unpretentious; something unpretentious adv. Clearly; plain n. (Plain) person's name; (English) Plane; (French) Plan"],"usphone":"pleɪn","ukphone":"pleɪn"},{"name":"silly","trans":["adj. stupid; unreasonable; dumb n. (Silly) person's name; () Xi; (France) Sealy"],"usphone":"ˈsɪli","ukphone":"ˈsɪli"},{"name":"spooky","trans":["adj. spooky; ghostly; creepy"],"usphone":"ˈspuːki","ukphone":"ˈspuːki"},{"name":"starry","trans":["adj. Star-studded; sparkling; star-shining; star-shaped n. (Starry) name; (English) Starry"],"usphone":"ˈstɑːri","ukphone":"ˈstɑːri"},{"name":"stormy","trans":["adj. stormy; violent; violent"],"usphone":"ˈstɔːmi","ukphone":"ˈstɔːmi"},{"name":"cheek","trans":["n. Cheeks, cheeks; hips vt. Speak disrespectfully to..., be bold and rude to... n. (Cheek) person's name; (English) Cheek"],"usphone":"tʃiːk","ukphone":"tʃiːk"},{"name":"chin","trans":["n. Chin; chat; pull-up movements vt. Clamp your chin; chat with...; perform pull-ups on the horizontal bar vi. Small talk; pull-up action n. (Chin) person's name; (Thai) Jin; (Yue) nine; (Xi) qin"],"usphone":"tʃɪn","ukphone":"tʃɪn"},{"name":"eyebrow","trans":["n. Eyebrows v. Draw eyebrows for...; force by frowning and raising one's forehead"],"usphone":"ˈaɪbraʊ","ukphone":"ˈaɪbraʊ"},{"name":"mouth","trans":["n. Mouth, mouth; estuary vt. Say it playfully, say it in a pretentious manner; say vi in a whisper. pretend to speak"],"usphone":"maʊθ","ukphone":"maʊθ"},{"name":"nose","trans":["n. Nose; sense of smell; prominent part; inquiry vt. Smell; touch with your nose vi. Carefully explore and move forward; inquire"],"usphone":"nəʊz","ukphone":"nəʊz"},{"name":"black","trans":["adj. black; black; evil n. Black; black; black paint vt. Make it darker; apply shoe polish etc. to...; make (eye) bruised vi. Blackened n. (Black) person's name; (English, Spanish) Blake; (German, Portuguese, Czech) Braque"],"usphone":"blæk","ukphone":"blæk"},{"name":"blond","trans":["adj. Blond n. White-skinned person n. (Blond) name; (English, Spanish) Blond; (French) Blond; (DE) Blond"],"usphone":"blɒnd","ukphone":"blɒnd"},{"name":"braided","trans":["adj. Braided; embellished"],"usphone":"'breɪdɪd","ukphone":"'breɪdɪd"},{"name":"curly","trans":["adj. curly; curly; (wood) wrinkled; curled"],"usphone":"ˈkɜːli","ukphone":"ˈkɜːli"},{"name":"hair","trans":["n. Hair; hair; some minor vt. Remove the hair of... vi. Growth of hair; formation of hairy fibers adj. Of hair; of hair; of caring for hair; made of hair"],"usphone":"heə(r)","ukphone":"heə(r)"},{"name":"long","trans":["adj. Long; long term; long term; long sound; (human) high; continuous; lengthy; long term; long term (profitable) adv. Over a long period of time; (before or after something) for a long time; (after the noun of time); far away n. Long; long sound; forward securities; long size (of clothing); long pants v. desire, hope n. (long) (US, UK, Ireland) long (name of person)"],"usphone":"lɒŋ","ukphone":"lɒŋ"},{"name":"short","trans":["adj. short; insufficient; short, low n. short; lack; short circuit; shorts adv. Insufficient; suddenly; suddenly n. (Short) (English) Short (name)"],"usphone":"ʃɔːt","ukphone":"ʃɔːt"},{"name":"straight","trans":["adj. Straight; continuous; straight; upright; neat; heterosexual adv. directly; continuously; immediately; frankly n. straight; straight; straight; straight, straight, straight; straight man, straight woman, heterosexual n. (Straight) name; (English) Strait"],"usphone":"streɪt","ukphone":"streɪt"},{"name":"bathroom","trans":["n. Bathroom; toilet; lavatory"],"usphone":"ˈbɑːθruːm; ˈbɑːθrʊm","ukphone":"ˈbɑːθruːm; ˈbɑːθrʊm"},{"name":"bedroom","trans":["n. Bedroom adj. Of a gender relationship; of a residential area on the outskirts of a city"],"usphone":"ˈbedruːm; ˈbedrʊm","ukphone":"ˈbedruːm; ˈbedrʊm"},{"name":"dining room","trans":["restaurant"]},{"name":"hall","trans":["n. Aisle, foyer, hallway; auditorium; cafeteria; student dormitory; hall, foyer; recreation center, clubhouse n. (Earth) Haller (name); (German, Bo, Dan, Finn, Sweden) Hall (name); (French) Al (name)"],"usphone":"hɔːl","ukphone":"hɔːl"},{"name":"kitchen","trans":["n. Kitchen; cooking utensils; cook staff n. (Kitchen) name; (English) kitchen"],"usphone":"ˈkɪtʃɪn","ukphone":"ˈkɪtʃɪn"},{"name":"living room","trans":["Living room, living room"],"usphone":"'lɪvɪŋ ru:m","ukphone":"'lɪvɪŋ ru:m"},{"name":"brother","trans":["n. Brothers; Colleagues; Comrades int. My dude! n. (Brother) name; (English) Blazer"],"usphone":"ˈbrʌðə(r)","ukphone":"ˈbrʌðə(r)"},{"name":"feed","trans":["v. Feed; feed; provide enough food for...; fertilize; fuel (fire); provide raw materials or power for (a machine); provide (someone) (information, ideas, etc.); supply water (body of water); (ball sports terms) feed (ball), pass the ball to (teammates); move (slowly and smoothly); move (slowly and smoothly); pass (slowly and smoothly) through (limited space); promote; graze; raise (family, etc.) (informal) feed; Feeding (especially to animals or infants); eating; a meal (of an animal or baby); a feeding device (of a machine); (machinery, equipment) Raw material supply; (satellite or network) transmission; (computer) subscription source"],"usphone":"fiːd","ukphone":"fiːd"},{"name":"help","trans":["vt. help; promote; cure; remedy n. Help; remedy; helper; something beneficial vi. help; useful; welcome n. (Help) person's name; (Fen) Help"],"usphone":"help","ukphone":"help"},{"name":"hold","trans":["vt. Hold; possess; preserve; detain; bind or control; convene, hold vi. Support; effective; continuous n. Control; Retain n. (Hold) names; (English, German, Czech) Hold"],"usphone":"həʊld","ukphone":"həʊld"},{"name":"meet","trans":["vt. Satisfy; meet; deal with vi. encounter; encounter n. Assembly adj. Appropriate; suitable n. (Meet) person name; (English) Mitt"],"usphone":"miːt","ukphone":"miːt"},{"name":"rock","trans":["n.Rock; rock; rock; reef vt. Shake; shake vi. Shake; shake n. (Rock) name; (English, German, Italian, Swedish) Rock"],"usphone":"rɒk","ukphone":"rɒk"},{"name":"bed","trans":["n. Bed; foundation; river bottom, seabed vt. Make it sleep; place it; embed it; plant vi. Going to bed; layering"],"usphone":"bed","ukphone":"bed"},{"name":"clothes","trans":["n. Clothes"],"usphone":"kləʊðz; kləʊz","ukphone":"kləʊðz; kləʊz"},{"name":"desk","trans":["n. Desk; service desk; editorial office; (US) pulpit; music stand adj. The one on the desk; the one used on the desk; the one made from the desk"],"usphone":"desk","ukphone":"desk"},{"name":"hit","trans":["vt. The feeling of being hit; attack; collision; chance discovery; injury... vi. Hitting; hitting; colliding; hitting by chance n; hitting; success (performance, etc.); sarcasm"],"usphone":"hɪt","ukphone":"hɪt"},{"name":"nice","trans":["adj. Precise; beautiful; subtle; kind n. (Nice) name; (English) Nice"],"usphone":"naɪs","ukphone":"naɪs"},{"name":"frost","trans":["n. Cold weather, frozen; frosty; frosty; (informal) failure v. Frosting to; frosting; freezing, freezing; sprinkling icing on... n. (Frost) (England, US, Germany) Frost (name of person)"],"usphone":"frɒst","ukphone":"frɒst"},{"name":"pour","trans":["v. Irrigate, pour; pour; (rain) pour down; pour in, pour out; drink (drink); pour in n. Pour; pour; heavy rain n. (Pour) (US, Czech) Paul (name of person)"],"usphone":"pɔː(r)","ukphone":"pɔː(r)"},{"name":"serve","trans":["vt. Entertain, supply; serve...; be useful for...; use... vi. Service, service; suitable, sufficient; serve; entertain, wait n. Serve, turn to serve n. (Serve) person's name; (France) Self"],"usphone":"sɜːv","ukphone":"sɜːv"},{"name":"shop","trans":["n. Store; store vt. Shopping vi. Shopping; shopping"],"usphone":"ʃɒp","ukphone":"ʃɒp"},{"name":"wait","trans":["vt. Wait; delay; delay vi. wait; delay; serve food n. Wait; wait n. (Wait) name; (English) Weite; (Czech) Weite"],"usphone":"weɪt","ukphone":"weɪt"},{"name":"awake","trans":["adj. Awake v. Awakening, becoming aware; awakening, being aroused, stimulated"],"usphone":"əˈweɪk","ukphone":"əˈweɪk"},{"name":"hungry","trans":["adj. hungry; hungry; desolate; futile"],"usphone":"ˈhʌŋɡri","ukphone":"ˈhʌŋɡri"},{"name":"messy","trans":["adj. messy; untidy; (situation) difficult n. (Messy) (law) Mosley (name of person)"],"usphone":"ˈmesi","ukphone":"ˈmesi"},{"name":"raccoon","trans":["n.Raccoon; raccoon fur"],"usphone":"rəˈkuːn","ukphone":"rəˈkuːn"},{"name":"smart","trans":["adj. Clever; ingenious; agile; powerful; chic; drastic; fashionable n. (Smart) names; (French) Smarts; (English, German) Smart"],"usphone":"smɑːt","ukphone":"smɑːt"},{"name":"sneaky","trans":["adj. sneaky; covert, despicable"],"usphone":"ˈsniːki","ukphone":"ˈsniːki"},{"name":"closed","trans":["adj. closed; undisclosed v. close; end; close (past participle of close)"],"usphone":"kləʊzd","ukphone":"kləʊzd"},{"name":"down","trans":["Adv. Down; down; down (sit, lie down); drop; decrease (quantity, strength, etc.); down; down (in) south; (write) on paper; (column) on a table; (write) on paper; lost (number of money); prepaid; completed quantity (or progress); to; downstairs; at a less important point; leave the capital (or important city); read vertically; from more to less; from more to less; from complicated to simple; from first to worst; from better to worse; from best to worse; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst; from best to worst lose (a specific amount) adj. Depressed; stopped running; nearby; fixed to the surface; descending; faulty; approved; at a low level; backward; later; swallowed; finished n. Down; sweat; hills; (American football) ten yard attack; unhappy prep. Down; along; through time; downstream of...; at the end of...; drink and eat since v. (all of a sudden); knock down n. (Down) (US) Tang (name of person)"],"usphone":"daʊn","ukphone":"daʊn"},{"name":"open","trans":["adj. Open; open; empty; candid; open vi. Begin; show vt. open; open n. Open; Open; Outdoor"],"usphone":"ˈəʊpən","ukphone":"ˈəʊpən"},{"name":"up","trans":["Adv. Up; rise; get close to (someone); in the direction of (an important place); towards (the northern part of the country); break into pieces; completely; gather (to); (to) finish; get up; (informally) (bad) happen; publicly display the ground; (sail) against the wind prep. To (higher position); along; above; to a higher point of...; to (where desired) adj. Upward; rising; correcting; (jockey) riding a horse; (informal) happy; done; waking up v. suddenly doing (something unexpected); raising the price (or quantity) of...; raising n.; rising; prosperity; (informal) luck"],"usphone":"ʌp","ukphone":"ʌp"},{"name":"apartment","trans":["n. Apartment; room"],"usphone":"əˈpɑːtmənt","ukphone":"əˈpɑːtmənt"},{"name":"building","trans":["n. Architecture; Building v. Building; Building; Addition (form of building)"],"usphone":"ˈbɪldɪŋ","ukphone":"ˈbɪldɪŋ"},{"name":"elevator","trans":["n. Elevators; elevators; lift rudders; lift unloaders"],"usphone":"ˈelɪveɪtə(r)","ukphone":"ˈelɪveɪtə(r)"},{"name":"hallway","trans":["n. Corridors; foyers; entryways"],"usphone":"ˈhɔːlweɪ","ukphone":"ˈhɔːlweɪ"},{"name":"mailbox","trans":["n. Mailboxes; mailboxes"],"usphone":"ˈmeɪlbɒks","ukphone":"ˈmeɪlbɒks"},{"name":"balloon","trans":["n. Balloons; hot air balloons; large spherical wineglasses; white circles; (informal) idiot; extremely large payment at the end of the installment; (informal) big trouble v. surge; sudden weight gain; expansion; (kick the ball); travel in a hot air balloon adj. n. (Balloon) (US, India, Thailand, Russia, Pakistan) balon (name of person) that blows up like a balloon"],"usphone":"bəˈluːn","ukphone":"bəˈluːn"},{"name":"drum","trans":["n. Drums; drums; drums; drums (on the machine); drums; drummer; bag; (informal) house, one suite; (informal) brothel; inside news; afternoon tea; mountain ridges v. drumming; nonstop knocking; (woodpecker) pecking rapidly with the mouth; messaging...; vigorously fighting for n. (Drum) (American, Russian, Australian, etc.) drum (name of person)"],"usphone":"drʌm","ukphone":"drʌm"},{"name":"flag","trans":["n. Flags, national flags; (sporting) signal flags, flags; irises, irises; thick slate for paving the road; countries they are loyal to; small paper emblems; flagship flags; flag devices; empty taxi displays; characteristic positions; indicators; prominent deer tail markings; plants with slender leaves v. signs; fatigue, weakness; decline in enthusiasm; draw attention to...; wave a flag to indicate a certain direction; indicate a car to stop; use a label to mark"],"usphone":"flæɡ","ukphone":"flæɡ"},{"name":"hat","trans":["n. Hat vt. Put a hat on... vi. Hat supply; name of the person who made the hat n. (Hat); (Chinese) nuclear (Cantonese, Weitama)"],"usphone":"hæt","ukphone":"hæt"},{"name":"parade","trans":["n. Parade; military parade; show off; march; parade ground vt. Parade; show off; line up vi. Parade; showing off; parade in line n. (Parade) name; (France, Germany) Parade"],"usphone":"pəˈreɪd","ukphone":"pəˈreɪd"},{"name":"duck","trans":["n. Duck; duck meat; (English) baby; zero point vi. Evade; submerge in water vt. Dodge; press... to enter the water n. (Duck) name; (German, Portuguese,) Duke"],"usphone":"dʌk","ukphone":"dʌk"},{"name":"frog","trans":["n. Frog; [Railway] fork; buckle vi. Frog catcher n. (Frog) name; (Russian) Frog"],"usphone":"frɒɡ","ukphone":"frɒɡ"},{"name":"pond","trans":["n. Pond; (the pond) (informal) Atlantic Ocean v. Interception (liquid such as running water) to form a small lake n. (Pond) (beauty, love) pond (name of person)"],"usphone":"pɒnd","ukphone":"pɒnd"},{"name":"swan","trans":["n. Swan; Swan zodiac sign vi. Wandering, wandering n. (Swan) name; (English, Finn, Germany) Swan"],"usphone":"swɒn","ukphone":"swɒn"},{"name":"turtle","trans":["n. Turtle, turtle; turtle n. (Turtle) name; (English) Turtle"],"usphone":"ˈtɜːtl","ukphone":"ˈtɜːtl"},{"name":"worm","trans":["n. Bugs, worms; worms; threads; little people vt. Make it peristaltic; exterminate insects; move slowly vi. Move slowly; crawl n. (Worm) name; (Germany, Denmark, Portugal) Worm"],"usphone":"wɜːm","ukphone":"wɜːm"},{"name":"fluffy","trans":["adj. fluffy; fluffy; furry; contentless"],"usphone":"ˈflʌfi","ukphone":"ˈflʌfi"},{"name":"tall","trans":["adj. Tall; long; excessive; exaggerated adv. Exaggerate n. (Tall) names; (Mali, Arabic) Tales; (Finn, Roe, Sweden) Tarr; (English) Thor; (Turkey) Tales"],"usphone":"tɔːl","ukphone":"tɔːl"},{"name":"white","trans":["adj. white; white; pure n. white; white; white; white"],"usphone":"waɪt","ukphone":"waɪt"},{"name":"cloud","trans":["n. Clouds; cloudy clouds; cloud-like objects; a large group; dark spots vt. Confuse; obscure by clouds; make melancholy; tarnish vi. Overcast; dark clouds n. (Cloud) Claude (name)"],"usphone":"klaʊd","ukphone":"klaʊd"},{"name":"lightning","trans":["n. Lightning; Sudden; (informal) sudden good luck adj. Lightning-fast, fast-paced; sudden v. lightning"],"usphone":"ˈlaɪtnɪŋ","ukphone":"ˈlaɪtnɪŋ"},{"name":"puddle","trans":["n. Puddle, quagmire; glue (made of clay and water, impermeable to water) vt. Muddy, muddy; mash... into glue; stir; fill with glue vi. Stir the mud; play in puddles"],"usphone":"ˈpʌdl","ukphone":"ˈpʌdl"},{"name":"rain","trans":["n. Rain; rain; rainy day; rainy season vi. Rain; rainfall vt. Give in large quantities; leave behind n. (Rain) names; (France) Lan; (English) Rain; (Luo, Jie) Ryan"],"usphone":"reɪn","ukphone":"reɪn"},{"name":"sky","trans":["n. Sky; vertex vt. Throw... into the air; hang... too high vi. Kick or hit a high-altitude ball; tilt the paddle too high; soar n. (Sky) person's name; (English) Sky"],"usphone":"skaɪ","ukphone":"skaɪ"},{"name":"Sun","trans":["n. Sun vt. Sunlight vi. Sun basking n. (Sun) name; (Chinese) Sun (Mandarin, Witma); () Sun; (Myanmar) Su; (Tu) Song"],"usphone":"sʌn","ukphone":"sʌn"},{"name":"fire","trans":["n. Fire; fire; gunfire; fire; passion; suffering vt. Ignite; fire; fire; shine; fire; excite; fire; fire a gun vi. ignition; shooting; shooting; excitement; burning"],"usphone":"ˈfaɪə(r)","ukphone":"ˈfaɪə(r)"},{"name":"ice","trans":["n. Ice; ice cream; restraint; () diamond vt. Ice; freeze vi. freezing adj. Ice's n. (Ice) name; (English) Ace; (French) Ice"],"usphone":"aɪs","ukphone":"aɪs"},{"name":"safe","trans":["adj. Safe; reliable; safe n. Safe; refrigerator; closet n. (Safe) name of person; (a few) Safi"],"usphone":"seɪf","ukphone":"seɪf"},{"name":"mask","trans":["n. Mask; mask; disguise vi. Disguise; wear a mask; dress up vt. disguise; wear a mask; blur"],"usphone":"mɑːsk","ukphone":"mɑːsk"},{"name":"scary","trans":["adj. (thing) scary; scary; scary; (person) fearful; alarmed; timid"],"usphone":"ˈskeəri","ukphone":"ˈskeəri"},{"name":"treat","trans":["vt. Treat; treat; discuss; treat as vi. Discuss; Invite; Negotiate n. Invite; Treat n. (Treat) Name; (English) Treat"],"usphone":"triːt","ukphone":"triːt"},{"name":"trick","trans":["n. Tricks; Pranks; Tricks; Tricks; Scams; Fraud vt. Deceive; deceive; decorate; dress up vi. deceiving; teasing adj. Stunt; fraudulent; deceptive n. (trick) person name; (English) trick"],"usphone":"trɪk","ukphone":"trɪk"},{"name":"circle","trans":["n. Cycle, cycle; circle; circle; round object vi. Circling, spinning; circling vt. Draw a circle; move around..."],"usphone":"ˈsɜːkl","ukphone":"ˈsɜːkl"},{"name":"heart","trans":["n. Heart; Feelings; Courage; Heart Shape; Key points vt. Encourage; remember vi. Name of the person who made up the knot n. (Heart); (English) Hart"],"usphone":"hɑːt","ukphone":"hɑːt"},{"name":"oval","trans":["adj. oval; oval n. oval; oval n. (Oval) name; (French) Orval"],"usphone":"ˈəʊvl","ukphone":"ˈəʊvl"},{"name":"shape","trans":["n. Shape; Model; Body; Concretization vt. Form; shape, shape; conform to vi. Form; shape; grow n. (Shape) person's name; (Sweden) Sharpe"],"usphone":"ʃeɪp","ukphone":"ʃeɪp"},{"name":"spiral","trans":["n. Spirals; vortices; spirals adj. spiral; circling vt. Make a spiral; make a spiral rise vi. Circling; spiraling; spiraling up (past tense spiraled/spiralled, past participle spiraled/spiralled, present participle spiraling/spiralling, 3rd person singular spiral, adverb spirally)"],"usphone":"ˈspaɪrəl","ukphone":"ˈspaɪrəl"},{"name":"star","trans":["n. Stars, stars; stars; star-shaped objects vt. Marked with an asterisk; starred by..., with... in the lead role vi. Acting as the lead adj. Star's, protagonist's; star-shaped n. (Star) person's name; (Sweden) Stahl; (German) Stahl"],"usphone":"stɑː(r)","ukphone":"stɑː(r)"},{"name":"triangle","trans":["n. Triangles (shapes); triangular relationships; triangular objects; groups of three"],"usphone":"ˈtraɪæŋɡl","ukphone":"ˈtraɪæŋɡl"},{"name":"gravy","trans":["n. Gravy; illegal profits; easily obtained money"],"usphone":"ˈɡreɪvi","ukphone":"ˈɡreɪvi"},{"name":"smell","trans":["n. Smell, smell; smell v. smell, smell; have... smell; detect; emit... n. (Smell) (American, Russian, English, India, New) Smell (name of person)"],"usphone":"smel","ukphone":"smel"},{"name":"stuffing","trans":["n. Fillers, fillers"],"usphone":"ˈstʌfɪŋ","ukphone":"ˈstʌfɪŋ"},{"name":"Thanksgiving","trans":["n. Gratitude"],"usphone":"ˌθæŋksˈɡɪvɪŋ","ukphone":"ˌθæŋksˈɡɪvɪŋ"},{"name":"turkey","trans":["n. Turkey; idiot; failure"],"usphone":"ˈtɜːki","ukphone":"ˈtɜːki"},{"name":"yam","trans":["n. Yam, sweet potato, sweet potato"],"usphone":"jæm","ukphone":"jæm"},{"name":"sister","trans":["n. Sisters; (called like-minded people) sisters; nuns; nurses adj. sisterly; same type"],"usphone":"ˈsɪstə(r)","ukphone":"ˈsɪstə(r)"},{"name":"teacher","trans":["n. Teacher; tutor n. (Teacher) name; (English) teacher"],"usphone":"ˈtiːtʃə(r)","ukphone":"ˈtiːtʃə(r)"},{"name":"yourself","trans":["pron yourselves"],"usphone":"jɔːˈself; jəˈself","ukphone":"jɔːˈself; jəˈself"},{"name":"snake","trans":["n. Snakes; insidious people vi. Take a detour vt. Pull (timber, etc.); take a detour"],"usphone":"sneɪk","ukphone":"sneɪk"},{"name":"corn","trans":["n. (US) corn; (English) grains; [skin] corns vt. Marinate; granulate n. (Corn) person's name; (English, French, Swedish) Cohn"],"usphone":"kɔːn","ukphone":"kɔːn"},{"name":"leaves","trans":["n. Leaves, leaves; petals; (paper) pages, sheets; thin sheet of metal; movable table, folding table; fan (window, door, etc.); inside (or outside) of a hollow wall (plural of leaf) v. leave; let... leave (3rd person singular of leave)"],"usphone":"liːvz","ukphone":"liːvz"},{"name":"spring","trans":["n. Spring; springs; springs; vitality; jumping adj. Spring vi. Grow; erupt; leap; crack vt. Make it jump; make it explode; suddenly propose; make it pop n. (Spring) name; (Germany) Sprin; (England, Finland, Sweden) Spring"],"usphone":"sprɪŋ","ukphone":"sprɪŋ"},{"name":"come","trans":["vi. come; begin; appear; occur; become; arrive vt. Do; pretend; will be (... years old) int. Hi there! n. (Come) person's name; (English) Comme; (Alba) Jomey"],"usphone":"kʌm","ukphone":"kʌm"},{"name":"storm","trans":["n. Storms; great turmoil vi. Start a storm; go on a rampage; roar furiously vt. Onslaught; scolding n. (Storm) by name; (Sweden) Storm; (Germany) Storm; (English, West, Finn) Storm"],"usphone":"stɔːm","ukphone":"stɔːm"},{"name":"wind","trans":["n. Wind; Breathing; Odor; Circumference vt. Winding; twisting; bending; blowing a horn; wrapping or entangling someone vi. Winding; Clockwork; Blowing the horn n. (Wind) name; (English, Germany, Sweden) Wind"],"usphone":"wɪnd","ukphone":"wɪnd"},{"name":"berries","trans":["Berries"],"usphone":"'beriz","ukphone":"'beriz"},{"name":"brownie","trans":["n. Chocolate cake, brownies; brown fairy (legendary elf who helps with housework at night)"],"usphone":"ˈbraʊni","ukphone":"ˈbraʊni"},{"name":"candy","trans":["n. Candy, chocolate; rock sugar; drugs (packaged in candy); things you don't see and use; v. make... into compote; cook with sugar; crystallize"],"usphone":"ˈkændi","ukphone":"ˈkændi"},{"name":"ice cream","trans":["Icecream"],"usphone":"ˈaɪs kriːm","ukphone":"ˈaɪs kriːm"},{"name":"nut","trans":["n. Nuts, nuts; nuts; difficult people to deal with, difficult problems vi. Name of person picking nuts n. (Nut); (Arabic) Nut; () Nu"],"usphone":"nʌt","ukphone":"nʌt"},{"name":"funny","trans":["adj. Funny, funny, funny; (oral) strange, bizarre; sick, uncomfortable; cunning, deceptive (sexual), suspicious, unclear n. Funny characters; jokes, funny stories; funny comic book columns; (English) (for racing) single paddle boats"],"usphone":"ˈfʌni","ukphone":"ˈfʌni"},{"name":"old","trans":["adj. Obsolete, ancient; old n. Ancient n. (Old) names; (English) Old"],"usphone":"əʊld","ukphone":"əʊld"},{"name":"wet","trans":["adj. [Meteorology] [Object] Humid; rainy n. Rainy days; humidity vt. Get wet vi. Wet n. (Wet) person's name; (English, Nano, South Africa) Wete"],"usphone":"wet","ukphone":"wet"},{"name":"dry","trans":["adj. Dry; thirsty; boring and tasteless; prohibited vt. Dry... vi. Dry n. Dry n. (Dry) person's name; (France) Delhi"],"usphone":"draɪ","ukphone":"draɪ"},{"name":"feel","trans":["vt. Feeling; Thinking; Touching; Testing vi. feel; explore n. feel; touch"],"usphone":"fiːl","ukphone":"fiːl"},{"name":"rough","trans":["adj. rough; rough; rough; tough; unprocessed vt. Make rough; rough treatment; draft n. Hard; uneven ground; unprocessed material; rough part vi. Bad manners adv. crudely; crudely; crudely n. (Rough) person's name; (English) Rough"],"usphone":"rʌf","ukphone":"rʌf"},{"name":"smooth","trans":["adj. Smooth; smooth; smooth vt. Smooth; remove (barriers, etc.); make elegant; ease n. Smooth part; flat ground vi. Become calm; become smooth adv. smoothly; smoothly; smoothly"],"usphone":"smuːð","ukphone":"smuːð"},{"name":"warm","trans":["adj. Warm; passionate vi. Sympathy; Excitement; Warmth vt. Excite...; make... warm; make... interested n. Warm; heat n. (Warm) person's name; (English) worm; (d) wam"],"usphone":"wɔːm","ukphone":"wɔːm"},{"name":"beautiful","trans":["adj. Beautiful, excellent, charming, charming"],"usphone":"ˈbjuːtɪfl","ukphone":"ˈbjuːtɪfl"},{"name":"furry","trans":["adj. Furry; fur-covered; fur-like n. (Furry) name; (English) Frey"],"usphone":"ˈfɜːri","ukphone":"ˈfɜːri"},{"name":"insect","trans":["n.Insects; scumbags"],"usphone":"ˈɪnsekt","ukphone":"ˈɪnsekt"},{"name":"bear","trans":["v. endure, bear; be unfit for something; bear responsibility; bear responsibility; bear (emotion, especially bad mood); support; display; carry; (car, boat) transport; birth (child); actually, blossom (formal); turn; take a turn; be proportionate (by name, title); perform; have (mark, characteristics); blow; have (name or title); write; have (similarity or relationship); generate (interest) n. bear; bear (interest) n. bear; sell (stock) Empty person; (informal) uneducated person; heavy man; (informal) “polar bear” (Russian nickname); ( informal) police; tricky things; grumpy n. (Bear) (US) Bell (name)"],"usphone":"beə(r)","ukphone":"beə(r)"},{"name":"fat","trans":["adj. Fat, fat; greasy; plump n. Fat, fat vt. Fertilize; add fat to... vi. Name of person in Changfei n. (Fat); (French, Spanish, Saudi) Fate; (in Chinese in Southeast Asian countries)"],"usphone":"fæt","ukphone":"fæt"},{"name":"feet","trans":["n. Foot (plural form of foot); foot; rhyme"],"usphone":"fiːt","ukphone":"fiːt"},{"name":"fur","trans":["n. Leather, leather; fur; soft fur n. Scale vt. Cover with fur; make people wear fur clothing n. (Fur) name; (France) Phil; (Sweden) Fur"],"usphone":"fɜː(r)","ukphone":"fɜː(r)"},{"name":"soft","trans":["adj. Soft, soft; gentle, gentle; weak; stupid adv. softly; gently n. Flexibility; soft things; soft parts"],"usphone":"sɒft","ukphone":"sɒft"},{"name":"bucket","trans":["n. Bucket, bucket; bucket; volume of a bucket v. pouring down; moving bumpy n. (Bucket) name of person; (German) Buckett"],"usphone":"ˈbʌkɪt","ukphone":"ˈbʌkɪt"},{"name":"bumpy","trans":["adj. bumpy; bumpy"],"usphone":"ˈbʌmpi","ukphone":"ˈbʌmpi"},{"name":"colorful","trans":["adj. colorful; interesting; colorful"],"usphone":"ˈkʌləfl","ukphone":"ˈkʌləfl"},{"name":"dirty","trans":["adj. indecent, despicable; dirty; vile; dark vt. Get dirty vi. Getting dirty"],"usphone":"ˈdɜːti","ukphone":"ˈdɜːti"},{"name":"pretty","trans":["adj. Pretty, cute, graceful; pleasant, pleasant to the point of hearing (but not to the point of being heartwarming); (informal) good (sarcastic words that indicate displeasure) adv. Pretty; pretty; pretty; very n. Attractive things (especially jewelry); pretty people v. beautify to make beautiful n. (Pretty) (beauty, India), Pretty (name of person)"],"usphone":"ˈprɪti","ukphone":"ˈprɪti"},{"name":"ugly","trans":["adj. ugly; wicked; disgusting"],"usphone":"ˈʌɡli","ukphone":"ˈʌɡli"},{"name":"wild","trans":["adj. wild; barbaric; fanatical; desolate n. Wilderness adv. Insanely; randomly n. (Wild) name; (English) Wilder; (France, Germany, Portugal, Czech, Russian) Wild"],"usphone":"waɪld","ukphone":"waɪld"},{"name":"bad","trans":["adj. Bad; serious; bad quality n. Bad thing; bad person adv. Very, very; bad; wickedly n. (Bad) name; (Rob) Bad"],"usphone":"bæd","ukphone":"bæd"},{"name":"sour","trans":["adj. Acidic; fermented; harsh; sour; nasty vi. Fermentation; turning sour; boredom vt. Make sour; disappoint n. Sour; Suffering n. (Sour) name; () search"],"usphone":"ˈsaʊə(r)","ukphone":"ˈsaʊə(r)"},{"name":"sweet","trans":["adj. Sweet; sweet; aromatic; kind; fun; aromatic; baby () cool name; (English) Sweet; (English) Sweet"],"usphone":"swiːt","ukphone":"swiːt"},{"name":"boring","trans":["adj. Boring; boring n. Drilling v. drilling; boring; boring (Boring form) n. (Boring) person's name; (English, Sweden) Bolin"],"usphone":"ˈbɔːrɪŋ","ukphone":"ˈbɔːrɪŋ"},{"name":"noisy","trans":["adj. loud; loud; loud"],"usphone":"ˈnɔɪzi","ukphone":"ˈnɔɪzi"},{"name":"quiet","trans":["adj. Quiet; stable; motionless; docile n. Quiet; peaceful vt. Calm; comfort vi. pacify"],"usphone":"ˈkwaɪət","ukphone":"ˈkwaɪət"},{"name":"sound","trans":["n. Sound; Noise; Sound; Strait; Hearing Range; Medical Probes; Radio Broadcasting; Sound Effects v. (Make) Sound; Hear; Sound; Hear (Diagnosis); Echo; Detect; Test; Declare; (Medical) Check with a Probe; (Especially Whales) Dive into the Deep Sea adj. Reasonable; non-destructive; capable; adequate; thorough; sleeping; well-funded; (informal) excellent; strict; sound adv. thoroughly, heartily"],"usphone":"saʊnd","ukphone":"saʊnd"},{"name":"squeaky","trans":["adj. crunchy"],"usphone":"ˈskwiːki","ukphone":"ˈskwiːki"},{"name":"bitter","trans":["adj. bitter; painful; sharp; full of hate n. bitterness; bitter beer adv. Fiercely; bitterly cold vt. Make bitter n. (Bitter) name; (English, French, German, Fen, Jie,) bit"],"usphone":"ˈbɪtə(r)","ukphone":"ˈbɪtə(r)"},{"name":"bland","trans":["adj. Boring; gentle; apathetic vt. Make... light and tasteless; remove the characteristics of... vi. Becoming plain and unremarkable; loss of characteristic n. (Bland) name; (English) Brand"],"usphone":"blænd","ukphone":"blænd"},{"name":"juicy","trans":["adj. Juicy; lively and fun; infused with vinegar; colorful; attractive; well-paid; satisfying"],"usphone":"ˈdʒuːsi","ukphone":"ˈdʒuːsi"},{"name":"spicy","trans":["adj. spicy; fragrant, spicy; indecent"],"usphone":"ˈspaɪsi","ukphone":"ˈspaɪsi"},{"name":"collect","trans":["vt. Collection; fundraising vi. collect; gather; fundraise adv. By recipient's place of payment adj. n. (Collect) name of the person making the payment by the recipient; (English) Colect"],"usphone":"kəˈlekt","ukphone":"kəˈlekt"},{"name":"crack","trans":["v. Breaking; cracking; cracking (grain); cracking (a safe); successfully obtained; heavy impact (audible); (making) a bursting sound; (suddenly) hoarse; giving in; (informal) being unable to eat; (informal) suddenly laughing; (informally) finding a solution; stopping; opening a bottle; saying (jokes); cracking (hydrocarbons) n. Crack; crack; crack; crack; crack; burst sound; (audible); heavy impact Potent cocaine; jokes (at bitter people); good times; flaws (in opinions or systems); voice changes adj. Well-trained, highly skilled, the best n. (Crack) (English, Canada, US) Clark (name)"],"usphone":"kræk","ukphone":"kræk"},{"name":"egg","trans":["n.Eggs; eggs; guys; eggs vt. Inciting; instigating n. (Egg) name; (French, English) Egg"],"usphone":"eɡ","ukphone":"eɡ"},{"name":"broccoli","trans":["n. Cauliflower; broccoli n. (Broccoli) (Italy, US) Broccoli (personal name)"],"usphone":"ˈbrɒkəli","ukphone":"ˈbrɒkəli"},{"name":"cabbage","trans":["n. Cabbage, cabbage, cabbage; () head; (informal, insulting) plant people (commonly used in British English); () money, especially banknotes (commonly used in American slang)"],"usphone":"ˈkæbɪdʒ","ukphone":"ˈkæbɪdʒ"},{"name":"potato","trans":["n. [crop] potato, [crop] potato"],"usphone":"pəˈteɪtəʊ","ukphone":"pəˈteɪtəʊ"},{"name":"vegetable","trans":["n. Vegetables; plants; plant people adj. vegetable; vegetable"],"usphone":"ˈvedʒtəbl","ukphone":"ˈvedʒtəbl"},{"name":"clap","trans":["vi. Clap, clap; close vt with a snap. Clap, clap; tap someone lightly n. Clap; clap n. (Clap) person's name; (Western, English) Klap"],"usphone":"klæp","ukphone":"klæp"},{"name":"pop","trans":["n. Pop music; pop culture; (especially used as a title) dad, dad; soda; bang; shooting; (quick hit) sign; criticism; popular classical music v. Sudden appearance; act suddenly; explode; shoot; stare; (make) make a burst sound; place quickly; leave quickly; change in ear pressure; (excessive) medication; adj. Popular; popular, popular adv. Suddenly; pops; bursts int. A bang of explosions abbr. Post office protocol (post office protocol); population (population) n. (Pop) (name of person)"],"usphone":"pɒp","ukphone":"pɒp"},{"name":"slap","trans":["v. Clapping, slapping; slapping...; insults; applying n. (quickly, randomly, or forcefully); slapping; insults; (informal, thick, or random) cosmetics adv. directly; abruptly; exactly adj. Inenergetic; (food) soft, too soft"],"usphone":"slæp","ukphone":"slæp"},{"name":"snap","trans":["vt. Suddenly broken, pulled; bitten; close vi with a snap. Bite; speak loudly; close with a click n. Bite; crackle; suddenly break adj. sudden"],"usphone":"snæp","ukphone":"snæp"},{"name":"tap","trans":["v. Knock; put on your mouth; eavesdrop; use; cut in a tree; appoint; illegally persuade to transfer n. Tap; tap; tap; tap; light off; funeral number n. (Tap) tower (name of person)"],"usphone":"tæp","ukphone":"tæp"},{"name":"hear","trans":["vt. Hear, listen; hear; hear vi. listen; hear"],"usphone":"hɪə(r)","ukphone":"hɪə(r)"},{"name":"music","trans":["n. Music, songs"],"usphone":"ˈmjuːzɪk","ukphone":"ˈmjuːzɪk"},{"name":"snore","trans":["v. snoring n. Snoring (sound); (informal) something extremely annoying"],"usphone":"snɔː(r)","ukphone":"snɔː(r)"},{"name":"wave","trans":["v. Waving; waving; waving; fluttering; making (hair) slightly wavy n. Ocean waves; heartbeat; emerging person (or object); waving; waves; (hair) curling; (emotional) outbursts"],"usphone":"weɪv","ukphone":"weɪv"},{"name":"whisper","trans":["v. Whispering; speaking privately, secret conversation; loud noise; fabricating rumors n. Whispering (sound); gentle sound; rumor; rustling (poetry, text); telltale signs, hints"],"usphone":"ˈwɪspə(r)","ukphone":"ˈwɪspə(r)"},{"name":"bee","trans":["n. Honeybee, bee; hardworking person n. (Bee) name; (); (Chinese in Southeast Asian countries) US; (English) bee (female educational names Beatrix and Beatrice)"],"usphone":"biː","ukphone":"biː"},{"name":"outside","trans":["n. Exterior; exterior; surroundings (of buildings, etc.); opposite side (near the center of the road); external road (curved road surface or track surface) adj. Outside, outside; outside; outside; outside the main building; impossible prep. Out of...; out of range of...; leave adv. outside, outward; outdoors"],"usphone":"ˌaʊtˈsaɪd","ukphone":"ˌaʊtˈsaɪd"},{"name":"slide","trans":["v. Slide; walk smoothly; move quietly; gradually deteriorate; depreciate; decline; fall unwittingly; fall; slide; slide; avalanche; slide; avalanche; slide; slide; slide; avalanche; slide device (of a machine or musical instrument); hairpins; light shoes"],"usphone":"slaɪd","ukphone":"slaɪd"},{"name":"child","trans":["n. Children, children; products; children; grandchildren; naive people; disciples n. (English) Childe (name)"],"usphone":"tʃaɪld","ukphone":"tʃaɪld"},{"name":"here","trans":["Adv. Here; at this point int. hey! ; Hello! n. Here n. (Here) person's name; (Luo) Hersch"],"usphone":"hɪə(r)","ukphone":"hɪə(r)"},{"name":"live","trans":["v. Live; Live; Live; Live; Retain, Remember; Grow, Inhabit; Live by...; (Boat) Not Sinking; Place, Shelter; Enjoy a Wonderful Life; Experience, Live Adj. Live; live; live; live; electrified; still explosives; burning; lactic acid bacteria; currently important; effective; rotating (wheel or shaft in the machine); in a racing state; vivid, energetic n. (Live) (N., Fin, India, Russian, American, Dutch) (name of person)"],"usphone":"lɪv; laɪv","ukphone":"lɪv; laɪv"},{"name":"bubble","trans":["n. Bubbles, bubbles, bubbles; transparent round cover, round top vi. Boiling, bubbling; making a bubbling sound vt. make bubbles; talk nonstop"],"usphone":"ˈbʌbl","ukphone":"ˈbʌbl"},{"name":"above","trans":["prep. More than, better than; above; above...; above...; (due to kindness or honesty) not disdain (to do something); biased, preferred; adv. Above (or towards); at (or towards) higher; above; above, adj. The above mentioned; the above; the above n. The above mentioned content, the above personnel; the foregoing"],"usphone":"əˈbʌv","ukphone":"əˈbʌv"},{"name":"behind","trans":["prep. Behind...; behind...; behind (after someone passes through a house); behind...; behind...; behind...; behind; supporting; being... the cause of...; being (someone's) past adv. Far from behind; stay where you are; in arrears; fall behind; score settled; not on time (complete the task) n. (informal) butt; shooting score"],"usphone":"bɪˈhaɪnd","ukphone":"bɪˈhaɪnd"},{"name":"below","trans":["prep. Below...; below (location or level); below..., below adv. Below, at the bottom; at the bottom of this page; under the main deck n. (Below) (English, German, Finn, Switzerland, Dan, Canada) Bello (name of person)"],"usphone":"bɪˈləʊ","ukphone":"bɪˈləʊ"},{"name":"between","trans":["prep. (space, time, quantity, etc.) between...; round trip; (table relationship) between two...; shared; adv together. (time or space) between...; during"],"usphone":"bɪˈtwiːn","ukphone":"bɪˈtwiːn"},{"name":"far","trans":["Adv. Very; far away; long distance; to a very long distance; to a very deep extent adj. Distant; long-standing n. Faraway n. (Far) person name; (Germany, West, Serbia) Farr"],"usphone":"fɑː(r)","ukphone":"fɑː(r)"},{"name":"hid","trans":["v. hide; obscure (past tense of hide)"],"usphone":"hɪd","ukphone":"hɪd"},{"name":"inside","trans":["n. Inside; inside; inside; heart; (informal) internal organs, stomach; (informal) positions where internal information can be obtained adj. Inside, inside; from within; adv near the center of the field (for sports such as hockey, soccer, etc.) Inside, inside; in prison (informally); in the heart prep. In...; in... mind; within... time; (in sports such as soccer, rugby, etc.) closer to the center of the stadium"],"usphone":"ˌɪnˈsaɪd","ukphone":"ˌɪnˈsaɪd"},{"name":"near","trans":["Adv. Close (ground), close (ground), very close (ground) to...; soon, very soon; almost; almost prep. Near..., close; close; close, just; similar to..., similar to adj. (Distance) Close, close; close; approximate; near; close relative; stingy vt. Approaching; fast to (a stage or time) vi. (Important moment or event, etc.) Approaching"],"usphone":"nɪə(r)","ukphone":"nɪə(r)"},{"name":"beach","trans":["n. Beaches; lakeside vt. Drag... ashore vi. Stranded; name of person who settled n. (Beach); (English) Beach"],"usphone":"biːtʃ","ukphone":"biːtʃ"},{"name":"museum","trans":["n. Museums"],"usphone":"mjuˈziːəm","ukphone":"mjuˈziːəm"},{"name":"playground","trans":["n. Playgrounds, playgrounds; playgrounds"],"usphone":"ˈpleɪɡraʊnd","ukphone":"ˈpleɪɡraʊnd"},{"name":"woods","trans":["n. (forest) woods, forest; wood v. for timber; covering with trees (3rd person singular of wood) n. (Woods) (US, Canada, English) Woods (personal name)"]},{"name":"has","trans":["v. have, eat, obtain, engage, permit, hire, enjoy (have in the 3rd person singular); accept; take; buy (in a family relationship)"],"usphone":"həz; əz; hæz","ukphone":"həz; əz; hæz"},{"name":"have","trans":["vt. Have; let; take; engage; allow aux. Already n. (Have) person's name; (Fen) Harvey; (de) Havel"],"usphone":"həv; əv; hæv","ukphone":"həv; əv; hæv"},{"name":"he","trans":["pron He; (generic) person; God n. Male, man; male animal n. (He) (Chinese, American, Dan) He (human name)"],"usphone":"hi; iː; i; hiː","ukphone":"hi; iː; i; hiː"},{"name":"I","trans":["n. English letter i; imaginary number; Roman numeral 1; US interstate highways; element iodine"],"usphone":"aɪ","ukphone":"aɪ"},{"name":"she","trans":["pron She (nominative character); it (used to refer to a female animal or country, ship, earth, moon, etc.) n. woman; female animal n. (She) person's name; (Chinese) (Mandarin, Weitama)"],"usphone":"ʃi; ʃiː","ukphone":"ʃi; ʃiː"},{"name":"they","trans":["pron they; they; they"],"usphone":"ðeɪ","ukphone":"ðeɪ"},{"name":"we","trans":["pron We (nominee); author, myself (used by author or speaker); we, widow n. (We) person's name; (Myanmar) Wei"],"usphone":"wi; wiː","ukphone":"wi; wiː"},{"name":"who","trans":["pron who; what person"],"usphone":"huː","ukphone":"huː"},{"name":"you","trans":["pron You; your n. (You) name; () You; (Chinese in Southeast Asian countries) You"],"usphone":"ju; juː","ukphone":"ju; juː"},{"name":"brush","trans":["n. Brushes; Brushes; Brushes; Quarrels; Conflicts; Bushland; Short Trees; Fox Tails vt. brush; painting; vi. brush; wipe; skim; touch (as you pass by)"],"usphone":"brʌʃ","ukphone":"brʌʃ"},{"name":"computer","trans":["n. Computers; computers; electronic computers"],"usphone":"kəmˈpjuːtə(r)","ukphone":"kəmˈpjuːtə(r)"},{"name":"finger","trans":["n. Fingers; pointers, fingerprints vt. Reach out; fiddle with your finger vi. Touch with finger; pick n. (Finger) name; (English, German, Czech) Finger; (Russian) Finger"],"usphone":"ˈfɪŋɡə(r)","ukphone":"ˈfɪŋɡə(r)"},{"name":"marker","trans":["n. Markers (indicating position); signs (of nature or condition); markers; paper readers; team members pressing to defend; reference standards; signature genes; promissory notes, receipts; scorer n. (Marker) (US) Mark (name of person)"],"usphone":"ˈmɑːkə(r)","ukphone":"ˈmɑːkə(r)"},{"name":"pen","trans":["n. Pens; writers; fences vt. Write; n. (Pen) name in the entry column; (French) Pang; (Russian, Serbia, English, Italian) Penn; ()"],"usphone":"pen","ukphone":"pen"},{"name":"stick","trans":["vt. Stab; poke; stick; paste vi. insist; stick out; stick to n. stick; walking stick; dumb person n. (Stick) (Finn) stick (name of person)"],"usphone":"stɪk","ukphone":"stɪk"},{"name":"bend","trans":["v. bend, bend; yield; turn, turn; tilt, deflect; bend (limb, etc.); distort, tamper; force, concentrate; tie, bind (cable) n. Turn, curve; bend; bind; (diver's) decompression sickness (the bends); (on the coat of arms) diagonal stripes n. (Bend) (American, Dan, Germany) Bender (name of person)"],"usphone":"bend","ukphone":"bend"},{"name":"dance","trans":["n. Dance; dance party; dance music vi. dance; jump; flutter vt. dance; make a jump adj. Dance; n. (Dance) person's name used for dancing; (English) Dance; (French) Dans"],"usphone":"dɑːns","ukphone":"dɑːns"},{"name":"leap","trans":["v. Jump, jump; move rapidly, jump; suddenly do (something); increase, soar; (vehicle) suddenly move n. Leap; jump, jump high; abrupt change; jump over or take off (for place names) n. (Leap) (US, French, English) Leah (name of person)"],"usphone":"liːp","ukphone":"liːp"},{"name":"prance","trans":["v. Take a leap with your head held high; (Ma) after Adachi take a leap; (Ma) later Adachi take a leap n. (Prance) (US, UK, Canada, Australia) Prance (name of person)"],"usphone":"prɑːns","ukphone":"prɑːns"},{"name":"skip","trans":["vi. Jumping; skipping rope; omission; skipping vt. Skip; omit n. Jump; skip n. (Skip) person's name; (English) Skip"],"usphone":"skɪp","ukphone":"skɪp"},{"name":"step","trans":["n. Steps, steps; steps; steps; steps vi. Step, step; walk vt. Go, take a step"],"usphone":"step","ukphone":"step"},{"name":"this","trans":["pron This, this; this; now, this;... this; there is an adj. This, this (closer to the speaker) adv. Like this, so n. (This) (France, America, India, Pakistan) TIS (name of person)"],"usphone":"ðɪs","ukphone":"ðɪs"}]