[{"name":"body","trans":["n. Body; subject; mass; group; main part vt. Name a person with a physical n. (Body); (English, French, Luo) Bodie"],"usphone":"ˈbɒdi","ukphone":"ˈbɒdi"},{"name":"catch","trans":["vt. Catch; catch; infect; understand vi. catch; catch n. Catch; catch; window hook"],"usphone":"kætʃ","ukphone":"kætʃ"},{"name":"enjoy","trans":["vt. Appreciate, enjoy; love; make your life happy"],"usphone":"ɪnˈdʒɔɪ","ukphone":"ɪnˈdʒɔɪ"},{"name":"living","trans":["adj. Living; existing; used; living; living; living; active; realistic; (poem, text, meaning water) flowing n. livelihood; lifestyle; pastors' position (particularly in the old days) with paid housing; living person v. living; living; living; living; living; continuing to exist, preserve, remember; enjoy a full and exciting life (present participle of live) n. (Living) (English) Levine (name of person)"],"usphone":"ˈlɪvɪŋ","ukphone":"ˈlɪvɪŋ"},{"name":"mate","trans":["n. Assistant, senior vice; spouse; colleague; partner vt. Make a match; make consistent; partner vi. Mating; maturing; closely cooperating with n. (Mate) name; (Japanese) (surname); (Spanish, Italian, Serbia) Matt; (Bosnia and Herzegovina) Matt; (Russian, Russian) Matthew"],"usphone":"meɪt","ukphone":"meɪt"},{"name":"stay","trans":["vi. stay; hold on; pause; stop vt. insist; stay; inhibit n. Stay; Stop; Pillar"],"usphone":"steɪ","ukphone":"steɪ"},{"name":"coyote","trans":["n. Jungle wolves, coyotes; illegal immigrant smugglers"],"usphone":"kaɪˈəʊti; kɔɪˈəʊti","ukphone":"kaɪˈəʊti; kɔɪˈəʊti"},{"name":"den","trans":["n. Thief's den, private room; beast den, nest; small room vi. Hide in a cave; live in a dirty and humble little room vt. who drove... into the cave n. (Den) name; (Japanese) biography (name); (Russian) Jayne; (French) Dern"],"usphone":"den","ukphone":"den"},{"name":"howl","trans":["v. Howling (dog, wolf, etc.); shouting (due to pain, anger, etc.); (wind) screaming; yelling; crying; howling (dog, wolf, etc.); howling (due to pain, fear, etc.); (strong wind) howling; trembling effect"],"usphone":"haʊl","ukphone":"haʊl"},{"name":"mammal","trans":["n. [Spine] mammals"],"usphone":"ˈmæml","ukphone":"ˈmæml"},{"name":"pack","trans":["n. Package; group; backpack; package; a pair of vt. Packing; pressing; bundling; picking; stuffing vi. Crowded; packaged goods; packaged; cluster n. (Pack) person's name; (English, German) Parker"],"usphone":"pæk","ukphone":"pæk"},{"name":"pup","trans":["n. Puppies; young animals vt. Raw (small animals such as puppies) vi. Raw puppies"],"usphone":"pʌp","ukphone":"pʌp"},{"name":"breathe","trans":["vi. Breathe; whisper; breathe; (wind) gently blow vt. Breathe; Breathe; Breathe; Speak in a low voice"],"usphone":"briːð","ukphone":"briːð"},{"name":"dolphin","trans":["n. Dolphin n. (Dolphin) name; (English) Dolphin"],"usphone":"ˈdɒlfɪn","ukphone":"ˈdɒlfɪn"},{"name":"hunter","trans":["n. Hunters; Hounds; Searchers"],"usphone":"ˈhʌntə(r)","ukphone":"ˈhʌntə(r)"},{"name":"orca","trans":["n. Killer whale, orca, killer whale (same as killer whale)"],"usphone":"ˈɔːkə","ukphone":"ˈɔːkə"},{"name":"building","trans":["n. Architecture; Building v. Building; Building; Addition (form of building)"],"usphone":"ˈbɪldɪŋ","ukphone":"ˈbɪldɪŋ"},{"name":"goods","trans":["n. Commodities; movable property; agreed persons; real skills"],"usphone":"ɡʊdz","ukphone":"ɡʊdz"},{"name":"machine","trans":["n. Machinery, machines; institutions; people who work like machines vt. Using a machine to make n. (Machine) person's name; (Italian) Makine"],"usphone":"məˈʃiːn","ukphone":"məˈʃiːn"},{"name":"part","trans":["n. Parts; Characters; Parts; Some; Fragments vt. Separation; Distribution; Separation vi. Break up; break up adv. Partially adj. Part n. (Part) person's name; (English, Swedish) Pat; (Thai) Ba; (French) Paal"],"usphone":"pɑːt","ukphone":"pɑːt"},{"name":"robot","trans":["n. Robots; remote control devices, automatic machines; people who work like machines"],"usphone":"ˈrəʊbɒt","ukphone":"ˈrəʊbɒt"},{"name":"turn","trans":["vt. Turn to make a spin; turn; turn over; redeem vi. Turn; turn; turn n. Turn; change; act, act, act (damage or benefit others) n. (Turn) person's name; (Germany,) Thun"],"usphone":"tɜːn","ukphone":"tɜːn"},{"name":"chicken","trans":["n. Chicken; chick; coward, coward adj. Chicken's; timid; young"],"usphone":"ˈtʃɪkɪn","ukphone":"ˈtʃɪkɪn"},{"name":"cotton","trans":["n. Cotton; cotton cloth; cotton thread vi. Consistency; understanding; harmony; closeness adj. Cotton; cotton n. (Cotton) name; (English, Spanish, Portuguese) Cotton; (French) Gordon"],"usphone":"ˈkɒtn","ukphone":"ˈkɒtn"},{"name":"cow","trans":["n. Cows, cows; mother beasts vt. threats, intimidation"],"usphone":"kaʊ","ukphone":"kaʊ"},{"name":"fruit","trans":["n. Fruit; Product vi. The results are real vt. Make... result n. (Fruit) person's name; (French) Freud; (English) Fruitt"],"usphone":"fruːt","ukphone":"fruːt"},{"name":"sheep","trans":["n. Sheep, sheep; cowards"],"usphone":"ʃiːp","ukphone":"ʃiːp"},{"name":"sugarcane","trans":["n. [crop] sugar cane; sugar cane"]},{"name":"bow","trans":["n. Bow; bow; bow; bow; bow v. bow, nod; lower (head); submit; (make) bend; pull (string instrument) with a bow n. (Bow) (American, English, Ireland) Bow (name of person)"],"usphone":"baʊ","ukphone":"baʊ"},{"name":"buzz","trans":["v. Make a buzzing sound; make a beep; use a buzzer (signal); (informally) approach (as a warning or threat); call... (informally); move quickly, get busy; (informal) approach at high speed; loud; full of excitement; (informal) furious; rapidly spreading n. Buzz; chirping conversation; strong emotion (pleasant or excited, etc.); pleasure (drinking or drug use); active atmosphere (informal); (informal) rumor n. (Buzz) (US, India, Russia) Baz (name)"],"usphone":"bʌz","ukphone":"bʌz"},{"name":"instrument","trans":["n. Instruments; tools; musical instruments; means; instruments v. Install measuring instruments for..."],"usphone":"ˈɪnstrəmənt","ukphone":"ˈɪnstrəmənt"},{"name":"music","trans":["n. Music, songs"],"usphone":"ˈmjuːzɪk","ukphone":"ˈmjuːzɪk"},{"name":"sound","trans":["n. Sound; Noise; Sound; Strait; Hearing Range; Medical Probes; Radio Broadcasting; Sound Effects v. (Make) Sound; Hear; Sound; Hear (Diagnosis); Echo; Detect; Test; Declare; (Medical) Check with a Probe; (Especially Whales) Dive into the Deep Sea adj. Reasonable; non-destructive; capable; adequate; thorough; sleeping; well-funded; (informal) excellent; strict; sound adv. thoroughly, heartily"],"usphone":"saʊnd","ukphone":"saʊnd"},{"name":"string","trans":["n. Line, string, string; string, line"],"usphone":"strɪŋ","ukphone":"strɪŋ"},{"name":"camel","trans":["n. [animal husbandry] [spine] camel; salvage buoy; work style bureaucratic adj. Camel; dark brown vi. Job stereotypical and mediocre n. (Camel) name; (French) Carmel; (Arabic) Kamal"],"usphone":"ˈkæml","ukphone":"ˈkæml"},{"name":"elephant","trans":["n. Elephant; large drawing paper"],"usphone":"ˈelɪfənt","ukphone":"ˈelɪfənt"},{"name":"elk","trans":["n. Elk; soft-tanned leather; moose leather n. (Elk) name; (Fin) Elk"],"usphone":"elk","ukphone":"elk"},{"name":"fox","trans":["n. Fox; cunning person; fox skin; vixen, sexy woman v. Can't guess; deceive, confuse; use cunning methods n. (Fox) (England, America, Germany, Dan, Love) Fox (name of person)"],"usphone":"fɒks","ukphone":"fɒks"},{"name":"giraffe","trans":["n.Giraffes"],"usphone":"dʒəˈrɑːf","ukphone":"dʒəˈrɑːf"},{"name":"mountain","trans":["n. Mountain; Mountain n. (Mountain) person's name; (English) Mountain"],"usphone":"ˈmaʊntən","ukphone":"ˈmaʊntən"},{"name":"zebra","trans":["n. [spine] zebra adj. Zebra (stationery brand); Zebra (refers to a profitable and responsible company)"],"usphone":"ˈzebrə; ˈziːbrə","ukphone":"ˈzebrə; ˈziːbrə"},{"name":"antlers","trans":["n. [spine] antler; [spine] [traditional Chinese medicine] antler horn (plural of antler)"],"usphone":"'æntləz","ukphone":"'æntləz"},{"name":"Arctic","trans":["adj. Arctic; extremely cold n. Arctic; cold weather waterproof overshoes n. (Arctic) name; (English) Arctic"],"usphone":"ˈɑːktɪk","ukphone":"ˈɑːktɪk"},{"name":"caribou","trans":["n. North American reindeer n. (Caribou) name; (French) Caribou"],"usphone":"ˈkærɪbuː","ukphone":"ˈkærɪbuː"},{"name":"hunt","trans":["v. Hunting; searching; hunting; (UK) fox hunting; hunting with (horses and hounds) (especially fox or deer hunting); hunting with dogs (or horses); hunting (animals); (animal) hunting); (machine, instrument pin, or system) swinging; (aircraft or rocket) swinging irregularly n. Searching; hunting; (UK) foxhunting activities; hunting teams (where foxhunting is often held in the United Kingdom); hunting groups; hunting grounds; hunting grounds; hunting n. (American) (American) (American name))"],"usphone":"hʌnt","ukphone":"hʌnt"},{"name":"barrel","trans":["n. Barrel; barrel (quantity); barrel, barrel; trunk (of four-legged animals such as horses) v. Move quickly; load... into the barrel n. (Barrel) (French, Italian) Barrell (name of person)"],"usphone":"ˈbærəl","ukphone":"ˈbærəl"},{"name":"bronco","trans":["n. Mustang (western US) n. (Bronco) name; (Portuguese) Bronco"],"usphone":"ˈbrɒŋkəʊ","ukphone":"ˈbrɒŋkəʊ"},{"name":"bull","trans":["n. Bulls; people who are optimistic about the stock market; people who are as strong as bulls; nonsense; seal adj. Large; bull-like; male vt. Attempt to raise the price of securities; frighten; forcefully achieve vi. Price increase; luck; push forward; brag n. (Bull) name; (English, Portuguese, Sweden, Finland, Norway, Germany) Bull"],"usphone":"bʊl","ukphone":"bʊl"},{"name":"ride","trans":["v. Ride, ride (bike, motorcycle, or horse, etc.), ride (subway, train, etc.); drive, control, try to control (someone) and force it to work; float; cross, overturn; depend on; count, mock; be carried away (with great impulse), thanks to n. (in a horse, bike, or vehicle) travel, itinerary; ride a free car; a person who makes it easy for people to ride; (someone's) car; (in an amusement park) an amusement device (n) for people to ride. Ride) (English, US, France) Ryder (person name)"],"usphone":"raɪd","ukphone":"raɪd"},{"name":"rodeo","trans":["n. Competitive performance; competitors vi. Athletes n. (Rodeo) name; (West) Rodeo"],"usphone":"ˈrəʊdiəʊ; rəʊˈdeɪəʊ","ukphone":"ˈrəʊdiəʊ; rəʊˈdeɪəʊ"},{"name":"dairy","trans":["n. Dairy products; dairy cows; cheese farms; dairy stores; milk and dairy industry adj. Dairy products; those made of milk; those that produce milk"],"usphone":"ˈdeəri","ukphone":"ˈdeəri"},{"name":"grains","trans":["n. [crop] grain (plural of grain); double toothed harpoons, multi-toothed harpoons"],"usphone":"ɡreɪns","ukphone":"ɡreɪns"},{"name":"ground","trans":["n. Ground; Land; Scope; Battlefield; According to vt. Touch the ground; lay the foundation; run aground vi. landing; stranded adj. Of the land; on the ground; ground; ground; polished v. polish (past participle of grind); oppression"],"usphone":"ɡraʊnd","ukphone":"ɡraʊnd"},{"name":"oatmeal","trans":["n.Oatmeal; oatmeal"],"usphone":"ˈəʊtmiːl","ukphone":"ˈəʊtmiːl"},{"name":"tofu","trans":["n.Tofu"],"usphone":"ˈtəʊfuː","ukphone":"ˈtəʊfuː"},{"name":"vegan","trans":["n. Strict vegan adj. Strict vegetarianism"],"usphone":"ˈviːɡən","ukphone":"ˈviːɡən"},{"name":"bath","trans":["n. Bathing; bathroom; bidet vt. Bathing vi. showering"],"usphone":"bɑːθ","ukphone":"bɑːθ"},{"name":"bubble","trans":["n. Bubbles, bubbles, bubbles; transparent round cover, round top vi. Boiling, bubbling; making a bubbling sound vt. make bubbles; talk nonstop"],"usphone":"ˈbʌbl","ukphone":"ˈbʌbl"},{"name":"slip","trans":["vi. slipping; slipping; making a mistake; falling off; losing ground vt. Make it slide; slide over; get rid of; put it in; flash n. Slide, slip; sheet, paper; mistake; fall; accident adj. Sliding; slip-knotted; lively abbr. The serial line interface protocol is an old-style protocol (Serial Line Interface Protocol) n. (slip) person name; (Fin) slip"],"usphone":"slɪp","ukphone":"slɪp"},{"name":"time","trans":["n. Time; era; number of times; beat; multiples vt. Timing; measuring the time of...; the speed of arranging... adj. Regular; regular; instalment n. (Time) name; (Russian) Ji Mei; (English) time; (ro) time"],"usphone":"taɪm","ukphone":"taɪm"},{"name":"tub","trans":["n. Tub; bucket vt. Put... in a bucket; take a bath for... vi. Tub bath; (clothes, etc.) are washed in a bucket"],"usphone":"tʌb","ukphone":"tʌb"},{"name":"tugboat","trans":["n. Tugboat (equivalent to towboat or tug)"],"usphone":"'tʌɡbəʊt","ukphone":"'tʌɡbəʊt"},{"name":"climb","trans":["v. Climbing; climbing; climbing; (plants growing along a wall or shelf); promotion; (road) inclination upward; climbing; climbing in (or climbing out) with effort n. Climbing; adding value; improving (position or social status); climbing (ranking); mountain (to be climbed in mountaineering or climbing); mountain trail; (of an airplane) climbing"],"usphone":"klaɪm","ukphone":"klaɪm"},{"name":"eat","trans":["vt. Eat, drink; corrode; annoy vi. eating; corrosion, erosion"],"usphone":"iːt","ukphone":"iːt"},{"name":"hop","trans":["v. Jumping on one foot; jumping on two feet or on one foot; suddenly going to a place quickly; (informal) making a quick trip; (informal) leaving quickly; (changing position quickly, etc.) jumping...; exchanging; (informal) jumping on (moving vehicle); express delivery; flavoring with hops n. Short distance jumping on both legs; short trips; hops; (informal) dancing; (informal) dancing; (informal) dancing; beer (drugs) Opium in particular) n. (Hop) (American) joint (name of person)"],"usphone":"hɒp","ukphone":"hɒp"},{"name":"juggle","trans":["vi. Juggling; deception; misrepresentation vt. misrepresentation; deception n. Playing tricks; deception"],"usphone":"ˈdʒʌɡl","ukphone":"ˈdʒʌɡl"},{"name":"lift","trans":["v. Lift; lift; raise (voice) volume; raise (voice) volume; lift (price); air transport; be lifted; spread; perform cosmetic surgery; dig; pick up and place; get rid of an unhappy mood; advance; win; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; (cricket) fly high; free lift; (cricket) fly high; free lift; (cricket) lift; free lift; free lift; (cricket)"],"usphone":"lɪft","ukphone":"lɪft"},{"name":"cried","trans":["v. crying; shouting; barking; (birds or other animals) chirping; (hawkers) hawking along the street (past tense and past participle of cry)"],"usphone":"kraɪd","ukphone":"kraɪd"},{"name":"liar","trans":["n. The liar n. (Liar) (Russian, American, German) Liar (name)"],"usphone":"ˈlaɪə(r)","ukphone":"ˈlaɪə(r)"},{"name":"trick","trans":["n. Tricks; Pranks; Tricks; Tricks; Scams; Fraud vt. Deceive; deceive; decorate; dress up vi. deceiving; teasing adj. Stunt; fraudulent; deceptive n. (trick) person name; (English) trick"],"usphone":"trɪk","ukphone":"trɪk"},{"name":"truth","trans":["n. Truth; facts; honesty; substance"],"usphone":"truːθ","ukphone":"truːθ"},{"name":"wolf","trans":["n. Wolves; perverts; cruel and greedy people vt. Eat a lot; eat n. (Wolf) by the name of a person; (after, Jie, Fen, Sweden, Germany, France, Romania, Netherlands, England) Wolf"],"usphone":"wʊlf","ukphone":"wʊlf"},{"name":"gel","trans":["n. Gel, colloid; hair gel; gel; high society girl v. Cooperate well; become clear; join forces; act; form a gel, gel; gel; spray hair gel n. (Gel) (Russian, American, American) gel (name of person)"],"usphone":"dʒel","ukphone":"dʒel"},{"name":"goblin","trans":["n. Goblins; playful ugly ghouls"],"usphone":"ˈɡɒblɪn","ukphone":"ˈɡɒblɪn"},{"name":"goggles","trans":["n. [safety] goggles; protective glasses; gaze (plural of goggle) v. gaze with wide eyes; turn eyes (three single forms of goggle)"],"usphone":"ˈɡɒɡlz","ukphone":"ˈɡɒɡlz"},{"name":"gorgeous","trans":["adj. gorgeous, splendid; excellent"],"usphone":"ˈɡɔːdʒəs","ukphone":"ˈɡɔːdʒəs"},{"name":"hard","trans":["adj. Hard working; hard; difficult; hard; accurate; strict; fierce; ruthless adv. Hard; Hard; Hard; Close; Fiercely; Firmly n. (Hard) Name; (England, Finland, Sweden) Hard"],"usphone":"hɑːd","ukphone":"hɑːd"},{"name":"soft","trans":["adj. Soft, soft; gentle, gentle; weak; stupid adv. softly; gently n. Flexibility; soft things; soft parts"],"usphone":"sɒft","ukphone":"sɒft"},{"name":"angry","trans":["adj. Angry; angry; furious; (wounds, etc.) inflamed"],"usphone":"ˈæŋɡri","ukphone":"ˈæŋɡri"},{"name":"calm","trans":["adj. Quiet, calm; calm vt. Calm; calm down vi. Calm down; calm down n. Calm down n. (Calm) person's name; (France, Germany) Calm"],"usphone":"kɑːm","ukphone":"kɑːm"},{"name":"feelings","trans":["n. [physiological] feeling; [psychological] emotion; opinion (plural of feeling)"],"usphone":"'fi:liŋs","ukphone":"'fi:liŋs"},{"name":"think","trans":["vt. Think; think; remember; imagine; plan vi. think; think n. think; think adj. ideological"],"usphone":"θɪŋk","ukphone":"θɪŋk"},{"name":"difference","trans":["n. Discrepancies; differences; disputes"],"usphone":"ˈdɪfrəns","ukphone":"ˈdɪfrəns"},{"name":"Earth","trans":["n. Earth; surface, land; land, soil; dust, common events; animal burrows vt. Ground (wire) [electricity]; cover (soil); chase into the cave vi. Hide in a burrow"],"usphone":"ɜːθ","ukphone":"ɜːθ"},{"name":"electricity","trans":["n. Electricity; electric current; strong nervousness"],"usphone":"ɪˌlekˈtrɪsəti","ukphone":"ɪˌlekˈtrɪsəti"},{"name":"recycle","trans":["v. Recycle; recycle; reuse n. Recycle, recycle"],"usphone":"ˌriːˈsaɪkl","ukphone":"ˌriːˈsaɪkl"},{"name":"reuse","trans":["v. Reuse; Reuse n. Reuse; Reuse"],"usphone":"ˌriːˈjuːs","ukphone":"ˌriːˈjuːs"},{"name":"tend","trans":["vi. trend, trend; care, care vt. care, care"],"usphone":"tend","ukphone":"tend"},{"name":"costume","trans":["n. Costumes, costumes; costumes, theatrical costumes vt. Put on a costume for..."],"usphone":"ˈkɒstjuːm","ukphone":"ˈkɒstjuːm"},{"name":"ghost","trans":["n. Ghost, ghost vt. Commit to work; catch a knife for...; write for people vi. Ghostwriting for someone else"],"usphone":"ɡəʊst","ukphone":"ɡəʊst"},{"name":"Halloween","trans":["n. Eve of Halloween (refers to the night of October 31)"],"usphone":"ˌhæləʊˈiːn","ukphone":"ˌhæləʊˈiːn"},{"name":"pirate","trans":["n. Pirate, marauders at sea; pirates, patent infringers; persons (or organizations) that illegally produce television or radio programs; corrupt persons, offenders v. piracy, misappropriation; looting (ships); looting (ships) adj. pirated"],"usphone":"ˈpaɪrət","ukphone":"ˈpaɪrət"},{"name":"scared","trans":["adj. Scared v. makes afraid (past participle of scare)"],"usphone":"skeəd","ukphone":"skeəd"},{"name":"geese","trans":["n. Goose (plural goose) n. (Geese) (German) Geze (personal name)"],"usphone":"ɡiːs","ukphone":"ɡiːs"},{"name":"hawk","trans":["n. Eagles; hawks; predators; plaster pallets v. hawking; clear throat; close surveillance; hawk attacks; flying foraging n. (Hawk) Oak (name of person)"],"usphone":"hɔːk","ukphone":"hɔːk"},{"name":"opossum","trans":["n. Opossum; pretend to die"],"usphone":"əˈpɒsəm","ukphone":"əˈpɒsəm"},{"name":"pigeon","trans":["n. Pigeon n. (Pigeon) name; (French) leather; (English) pigeon"],"usphone":"ˈpɪdʒɪn","ukphone":"ˈpɪdʒɪn"},{"name":"raccoon","trans":["n.Raccoon; raccoon fur"],"usphone":"rəˈkuːn","ukphone":"rəˈkuːn"},{"name":"squirrel","trans":["n. Squirrel; squirrel fur vt. repositioned"],"usphone":"ˈskwɪrəl","ukphone":"ˈskwɪrəl"},{"name":"park","trans":["n. Park; [Interchange] Parking lot vt. Parking; placement; storage vi. n. (Park) name of the person who parked the vehicle; (English, Finland, Sweden) Park"],"usphone":"pɑːk","ukphone":"pɑːk"},{"name":"skyscraper","trans":["n. Skyscrapers, super-tall buildings; particularly tall things"],"usphone":"ˈskaɪskreɪpə(r)","ukphone":"ˈskaɪskreɪpə(r)"},{"name":"stadium","trans":["n. Stadium; large outdoor sports field"],"usphone":"ˈsteɪdiəm","ukphone":"ˈsteɪdiəm"},{"name":"store","trans":["n. Stores; reserves, storage; warehouses vt. Storage, storage n. (Store) name of person; (DE) Storey"],"usphone":"stɔː(r)","ukphone":"stɔː(r)"},{"name":"zoo","trans":["n. Zoo n. (Zoo) person's name; (North Korea) Zhu; (Arabic) father"],"usphone":"zuː","ukphone":"zuː"},{"name":"feed","trans":["v. Feed; feed; provide enough food for...; fertilize; fuel (fire); provide raw materials or power for (a machine); provide (someone) (information, ideas, etc.); supply water (body of water); (ball sports terms) feed (ball), pass the ball to (teammates); move (slowly and smoothly); move (slowly and smoothly); pass (slowly and smoothly) through (limited space); promote; graze; raise (family, etc.) (informal) feed; Feeding (especially to animals or infants); eating; a meal (of an animal or baby); a feeding device (of a machine); (machinery, equipment) Raw material supply; (satellite or network) transmission; (computer) subscription source"],"usphone":"fiːd","ukphone":"fiːd"},{"name":"help","trans":["vt. help; promote; cure; remedy n. Help; remedy; helper; something beneficial vi. help; useful; welcome n. (Help) person's name; (Fen) Help"],"usphone":"help","ukphone":"help"},{"name":"problem","trans":["n. Difficulties; people causing trouble adj. problematic; difficult to deal with"],"usphone":"ˈprɒbləm","ukphone":"ˈprɒbləm"},{"name":"solve","trans":["vt. Solve; Answer; Dissolve vi. Answer"],"usphone":"sɒlv","ukphone":"sɒlv"},{"name":"want","trans":["vt. need; hope; should; lack n. Need; Lack; Poverty; Necessity vi. required; missing"],"usphone":"wɒnt","ukphone":"wɒnt"},{"name":"care","trans":["n. Care; Care; Prudence; Concern vi. care; care; love; concern vt. Care; hope or like n. (Care) name; (English) Kyle; (Se) Tsarey"],"usphone":"keə(r)","ukphone":"keə(r)"},{"name":"class","trans":["n. Class; Class; Type; Class; Level vt. Classify; rank...; assign... to a certain level, treat... as (or categorize, categorize); put... into a class adj. Excellent; very good, excellent, excellent vi. Belongs to... category (or rank) and is classified as a class (or level) n. (English, German) Klaas (personal name)"],"usphone":"klɑːs","ukphone":"klɑːs"},{"name":"hamster","trans":["n. Hamsters; hamster fur"],"usphone":"ˈhæmstə(r)","ukphone":"ˈhæmstə(r)"},{"name":"pet","trans":["n. Pets; angry; loved ones vt. Love vi. Angry; caressing adj. Favorite n. (Pet) person's name; (Russian) Pet; ()"],"usphone":"pet","ukphone":"pet"},{"name":"squeak","trans":["vi. Report; squeak; luck and success n. Squeak; chance vt. Make a short, sharp sound"],"usphone":"skwiːk","ukphone":"skwiːk"},{"name":"animal","trans":["n. Animals Animal's"],"usphone":"ˈænɪml","ukphone":"ˈænɪml"},{"name":"country","trans":["n. Country, Homeland; Nationality; Countryside, Countryside; Hometown adj. Motherland's, hometown's; local, rural; national; rude; country music's"],"usphone":"ˈkʌntri","ukphone":"ˈkʌntri"},{"name":"field","trans":["n. Field; Pasture; Wilderness; Battlefield; Stadium; Field vi. As a field player adj. Scanning field; field game; wild vt. Expose yourself on the field; put on the field n. (Field) name; (English, French, German, Portuguese) field"],"usphone":"fiːld","ukphone":"fiːld"},{"name":"nest","trans":["n. Nest, nest; comfort nest; hotbed vt. Nesting; nesting vi. Build a nest; find a bird's nest n. (Nest) name; (German) Nester; (English) Nester (female teacher name Agnes, Welsh nickname)"],"usphone":"nest","ukphone":"nest"},{"name":"river","trans":["n. River, River n. (River) person's name; (English) River"],"usphone":"ˈrɪvə(r)","ukphone":"ˈrɪvə(r)"},{"name":"beehive","trans":["n.Honeycomb; beehive"],"usphone":"ˈbiːhaɪv","ukphone":"ˈbiːhaɪv"},{"name":"marble","trans":["n. Marble; marble products; marbles adj. Marbled; ruthless n. (Marble) name; (English) Marble"],"usphone":"ˈmɑːbl","ukphone":"ˈmɑːbl"},{"name":"peacock","trans":["n. Peacocks; male peacocks; people who love vanity vi. Show off; walk with vigor n. (Peacock) name; (English) Peacock"],"usphone":"ˈpiːkɒk","ukphone":"ˈpiːkɒk"},{"name":"rooster","trans":["n. Rooster; arrogant and conceited person"],"usphone":"ˈruːstə(r)","ukphone":"ˈruːstə(r)"},{"name":"unicorn","trans":["n.Unicorns; Kirin"],"usphone":"ˈjuːnɪkɔːn","ukphone":"ˈjuːnɪkɔːn"},{"name":"exciting","trans":["adj. exciting; exciting v. excitement; stimulation (in the ring form of excite); arousal"],"usphone":"ɪkˈsaɪtɪŋ","ukphone":"ɪkˈsaɪtɪŋ"},{"name":"first","trans":["det. First num. First; first; first (in line) first; best adj. The most important, the best; the one that never happened before; the one that came right after; the one that was ahead of everyone else; the adv who sang (or played) the high voice. First; first; first time; first place (in a competition); better; an unprecedented achievement with a certain part of the body; first grade (car, bicycle); highest score (in a British university degree); first grade (in baseball); first year (in college, school); first edition (of a book); first place (in a game); (UK) Secretary of the Navy; honors student pron. First (first); first n. (First) (US) Fielster (name)"],"usphone":"fɜːst","ukphone":"fɜːst"},{"name":"grade","trans":["n. Grade; Grade; Achievement; Level; Stage vt. Rating; rate... vi. Grading; gradual change of n. (Grade) person's name; (English) Grade; (France, Germany, Spain, Portugal, Serbia, Sweden)"],"usphone":"ɡreɪd","ukphone":"ɡreɪd"},{"name":"learn","trans":["vt. Learn; Learn; Recognize vi. Learn; learn"],"usphone":"lɜːn","ukphone":"lɜːn"},{"name":"meet","trans":["vt. Satisfy; meet; deal with vi. encounter; encounter n. Assembly adj. Appropriate; suitable n. (Meet) person name; (English) Mitt"],"usphone":"miːt","ukphone":"miːt"},{"name":"ache","trans":["v. Pain (continuous); longing; sorrow, pity; feeling pain n. Pain (in a part of the body); Pain (an annoying or bittersweet emotion) n. (Ache) (US, Indonesia, France) Aceh (name of person)"],"usphone":"eɪk","ukphone":"eɪk"},{"name":"cough","trans":["v. Cough; coughing; sudden harsh sound; loud speech; confession n. Cough, cough; cough disease n. (Cough) (American, English) Kauff (name of person)"],"usphone":"kɒf","ukphone":"kɒf"},{"name":"doctor","trans":["n. Doctor; Doctor; Dentist (title or title) Dentist; Clinic; (informal) Adviser; Knowledgeable person; Artificial flies; Cool ocean breezes; (informal) Chef on board v. Tampering, forgery; adding harmful substances (to food or drink); castrate (animals); treat diseases for...; grant a doctorate degree; repair (machine); interfere (ball); seek medical treatment; practice medicine"],"usphone":"ˈdɒktə(r)","ukphone":"ˈdɒktə(r)"},{"name":"ill","trans":["adj. Sick; bad; evil; unlucky adv. unfavorable; badly; hardly n. Illness; unfortunate n. (Ill) person's name; (Jie,) Er"],"usphone":"ɪl","ukphone":"ɪl"},{"name":"knee","trans":["n. Knee, knee vt. Touch n. (Knee) person's name with your knee; (English) Nepali"],"usphone":"niː","ukphone":"niː"},{"name":"stiff","trans":["adj. Rigid; hard; stiff; strict; strict; tight; thick; (expensive); (alcohol) strong adv. extremely; stiff; completely n. Dead corpse; obnoxious; negotiable notes; workers vt. Fraud; loss of trust"],"usphone":"stɪf","ukphone":"stɪf"},{"name":"budge","trans":["vi. Move; move slightly; change attitude or opinion; obey vt. make concessions; move; change attitudes or opinions n. Lambskin n. (Budge) name; (English) Bach"],"usphone":"bʌdʒ","ukphone":"bʌdʒ"},{"name":"face","trans":["n. Face; Face; Face; Face; Appearance; Prestige vi. Toward; morning vt. face; face; acknowledge; erase n. (Face) person's name; (France) Faith; (Italy) Fache"],"usphone":"feɪs","ukphone":"feɪs"},{"name":"nephew","trans":["n. Nephew; nephew"],"usphone":"ˈnefjuː; ˈnevjuː","ukphone":"ˈnefjuː; ˈnevjuː"},{"name":"relief","trans":["n. Relief; relief; relief; relief"],"usphone":"rɪˈliːf","ukphone":"rɪˈliːf"},{"name":"toil","trans":["v. Hard work, hard work; walking hard; (making) overworked; hard work n. Hard work; exhaustion; difficult tasks; net"],"usphone":"tɔɪl","ukphone":"tɔɪl"},{"name":"triumph","trans":["n. Victory, triumph; joy vi. Get victorious, succeed"],"usphone":"ˈtraɪʌmf","ukphone":"ˈtraɪʌmf"},{"name":"bloom","trans":["n. Flowers; youth; vigor vt. Make it bloom; make it flourish vi. Blossoming; flourishing n. (Bloom) name; (Sweden, West) Blom; (English) Bloom"],"usphone":"bluːm","ukphone":"bluːm"},{"name":"patch","trans":["n. Blindfold; specks; debris; small pieces of land vt. Fix; resolve; disguise vi. Patch n. (Patch) person's name; (English) Patch"],"usphone":"pætʃ","ukphone":"pætʃ"},{"name":"pest","trans":["n. Pests; harmful objects; hated people n. (Pest) names; (German, Czech) Pest"],"usphone":"pest","ukphone":"pest"},{"name":"spread","trans":["vi. Spread; stretch vt. Spread; spread; expand; spread n. Disseminate; stretch adj. stretching"],"usphone":"spred","ukphone":"spred"},{"name":"strawberry","trans":["n.Strawberry; strawberry color"],"usphone":"ˈstrɔːbəri","ukphone":"ˈstrɔːbəri"},{"name":"blastoff","trans":["n. Lift-off; launch"],"usphone":"'blɑːstɒf","ukphone":"'blɑːstɒf"},{"name":"rocket","trans":["n. Rockets; rocket weapons; fireworks; arugula; (informal) severe reprimand v. Rapid increase; rapid movement; rapid success; attack with rocket weapons; delivery with rockets"],"usphone":"ˈrɒkɪt","ukphone":"ˈrɒkɪt"},{"name":"second","trans":["num. Second; the one that ranks second (scale, quality, etc.); other adj. Second (one); second place (in competition, level); additional; secondary n. seconds; instantaneous; second place; second place; second place; second place; support, support; temporary assignment (staff, etc.) adv. Second place; second, followed by n. (Second) (US) plug hole (name of person)"],"usphone":"'sek(ə)nd","ukphone":"'sek(ə)nd"},{"name":"space","trans":["n. Space; space; distance vi. Retention interval vt. Separated"],"usphone":"speɪs","ukphone":"speɪs"},{"name":"barbecue","trans":["n. Yakiniku; yakiniku picnic vt. Barbecue; grilled meat"],"usphone":"ˈbɑːbɪkjuː","ukphone":"ˈbɑːbɪkjuː"},{"name":"crowd","trans":["n. Crowd; audience; (informal) group of people; many v. (group of people) (making) full; approaching (someone); gathering; filling the mind (with ideas or opinions); urging (making people angry or uncomfortable)"],"usphone":"kraʊd","ukphone":"kraʊd"},{"name":"kitchen","trans":["n. Kitchen; cooking utensils; cook staff n. (Kitchen) name; (English) kitchen"],"usphone":"ˈkɪtʃɪn","ukphone":"ˈkɪtʃɪn"},{"name":"seafood","trans":["n. Seafood; seafood; seafood"],"usphone":"ˈsiːfuːd","ukphone":"ˈsiːfuːd"},{"name":"taco","trans":["n. Pan-fried tacos; Mexican n. (Taco) name; (Portuguese) taco"],"usphone":"ˈtækəʊ","ukphone":"ˈtækəʊ"},{"name":"taste","trans":["n. Taste; taste; aesthetics vt. Taste; experience vi. Tastes; has the taste of... n. (Taste) person's name; (France) Taster"],"usphone":"teɪst","ukphone":"teɪst"},{"name":"fall","trans":["v. Falling; falling; sagging; kneeling; falling down (ground); falling (in quantity, etc.); falling (rain or snow); falling; falling (in a certain state); falling; falling (of snow, rock, etc.); falling (in quantity, etc.); fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; collapse, decay adj. n. (Fall) (West) Fowler (name of person) of autumn"],"usphone":"fɔːl","ukphone":"fɔːl"},{"name":"puddle","trans":["n. Puddle, quagmire; glue (made of clay and water, impermeable to water) vt. Muddy, muddy; mash... into glue; stir; fill with glue vi. Stir the mud; play in puddles"],"usphone":"ˈpʌdl","ukphone":"ˈpʌdl"},{"name":"season","trans":["n. Period; season; season vt. Season...; adapt vi. becomes mature; becomes dry"],"usphone":"ˈsiːzn","ukphone":"ˈsiːzn"},{"name":"spring","trans":["n. Spring; springs; springs; vitality; jumping adj. Spring vi. Grow; erupt; leap; crack vt. Make it jump; make it explode; suddenly propose; make it pop n. (Spring) name; (Germany) Sprin; (England, Finland, Sweden) Spring"],"usphone":"sprɪŋ","ukphone":"sprɪŋ"},{"name":"summer","trans":["n. Summer; heyday vi. escape the heat; spend the summer adj. Summer n. (Summer) names; (German) Zumer; (English) Summer"],"usphone":"ˈsʌmə(r)","ukphone":"ˈsʌmə(r)"},{"name":"winter","trans":["n. Winter; age; depression period vi. Winter adj. Winter's; n. (Winter) person's name for wintering; (English, German, German, German, Russian, Czech, West, Finland, Sweden, France) Winter"],"usphone":"ˈwɪntə(r)","ukphone":"ˈwɪntə(r)"},{"name":"backpack","trans":["n. Backpacks, backpacks; hiking backpacks vt. Pick up; put... in a backpack vi. Travel with easy luggage; carry"],"usphone":"ˈbækpæk","ukphone":"ˈbækpæk"},{"name":"breakfast","trans":["n. Breakfast; breakfast vi. Have breakfast vt. Serves breakfast for..."],"usphone":"ˈbrekfəst","ukphone":"ˈbrekfəst"},{"name":"friend","trans":["n. Friend; Assistant; Sponsor n. (Friend) Name; (English) Flanders"],"usphone":"frend","ukphone":"frend"},{"name":"paper","trans":["n. Paper; paper; document; newspaper adj. Made of paper vt. Use paper paste; wrap with paper vi. Paste the wallpaper; issue a traffic violation summons n. (Paper) name; (Russian) Papel"],"usphone":"ˈpeɪpə(r)","ukphone":"ˈpeɪpə(r)"},{"name":"pencil","trans":["n. Pencils; pen-like objects vt. Write with a pencil; apply vi with an eyebrow pencil. In the shape of a pencil"],"usphone":"ˈpensl","ukphone":"ˈpensl"},{"name":"remove","trans":["vt. Move, migrate; expulsion; transfer vi. Move, migrate; move n. Move; Distance; Move"],"usphone":"rɪˈmuːv","ukphone":"rɪˈmuːv"},{"name":"shovel","trans":["n. Shovel; quantity of a shovel; forklift vt. Eradicate; dig with a shovel; tuck... randomly into vi. shovel"],"usphone":"ˈʃʌvl","ukphone":"ˈʃʌvl"},{"name":"snowblower","trans":["n.Snow blower"],"usphone":"ˈsnoʊbloʊər","ukphone":"ˈsnoʊbloʊər"},{"name":"snowplow","trans":["n. Snow plow; [environment] snow plow; snow plow (equal to snowplough)"]},{"name":"bake","trans":["vt. Bake, bake vi. Baked bread; baked dry; heated n. Baked; baked goods n. (Bake) name; (Germany, Sweden) Buck"],"usphone":"beɪk","ukphone":"beɪk"},{"name":"grandparent","trans":["n. Grandparents; grandparents; grandparents; maternal grandparents; maternal grandparents or grandmothers"],"usphone":"ˈɡrænpeərənt","ukphone":"ˈɡrænpeərənt"},{"name":"piano","trans":["n. Piano n. (Piano) person's name; (French, Italian, Portuguese) Piano"],"usphone":"piˈænəʊ","ukphone":"piˈænəʊ"},{"name":"share","trans":["v. Sharing, sharing; distribution; having the same feelings (or experiences); sharing n. shares, shares; responsibility, contribution n. (Share) (US) Sharley (name of person)"],"usphone":"ʃeə(r)","ukphone":"ʃeə(r)"},{"name":"watch","trans":["vt. Observe; Watch; Watch; Watch; Watch; Watch; Watch; Watch; Watch; Watchman vi. Watch, watch; guard, guard"],"usphone":"wɒtʃ","ukphone":"wɒtʃ"},{"name":"balloon","trans":["n. Balloons; hot air balloons; large spherical wineglasses; white circles; (informal) idiot; extremely large payment at the end of the installment; (informal) big trouble v. surge; sudden weight gain; expansion; (kick the ball); travel in a hot air balloon adj. n. (Balloon) (US, India, Thailand, Russia, Pakistan) balon (name of person) that blows up like a balloon"],"usphone":"bəˈluːn","ukphone":"bəˈluːn"},{"name":"birthday","trans":["n. Birthday, birthday; day of birth"],"usphone":"ˈbɜːθdeɪ","ukphone":"ˈbɜːθdeɪ"},{"name":"cake","trans":["n. Cake; block; total benefit vt. Make agglomerates vi. N. (Cake) name formed into a block; (English) Keck; (Sai) Chakai"],"usphone":"keɪk","ukphone":"keɪk"},{"name":"candle","trans":["n. Candles; candlelight; candle-shaped objects vt. Check against light"],"usphone":"ˈkændl","ukphone":"ˈkændl"},{"name":"party","trans":["n. Political parties, parties; parties; parties vi. Attend social gatherings"],"usphone":"ˈpɑːti","ukphone":"ˈpɑːti"},{"name":"present","trans":["adj. present; present; present; present; present; n. gift; present; present; present; present; present; (verb) present tense; aim (of firing a gun) v. give; present; present; present; make; describe; appear; host (program); perform; present; present; express (check or bill); submit (check or bill); thank you; (church) to take office as pastor who has been recommended by the bishop; formally submitted to the court; aim at a gun; reveal (disease) symptoms"],"usphone":"ˈpreznt","ukphone":"ˈpreznt"},{"name":"artist","trans":["n. Artist; artist (especially painter); master"],"usphone":"ˈɑːtɪst","ukphone":"ˈɑːtɪst"},{"name":"baker","trans":["n. Bakers; bread workers; (portable) ovens"],"usphone":"ˈbeɪkə(r)","ukphone":"ˈbeɪkə(r)"},{"name":"band","trans":["n. Band, ring; [object] band; band (playing pop music) vi. Tie with a belt; embellishment n. N. Band; team; group"],"usphone":"bænd","ukphone":"bænd"},{"name":"farmer","trans":["n. Farmer, farmer n. (Farmer) name; (English) Farmer; (French) Farmer; (West) Farmer"],"usphone":"ˈfɑːmə(r)","ukphone":"ˈfɑːmə(r)"},{"name":"gardener","trans":["n. Gardener; florist; horticulturist n. (Gardener) name; (English) Gardner"],"usphone":"ˈɡɑːdnə(r)","ukphone":"ˈɡɑːdnə(r)"},{"name":"market","trans":["n. Market; market; stock market; market; bazaar; sales channel; store vt. Selling on the market vi. Name of person doing business n. (Market); (Ce) Marquette"],"usphone":"ˈmɑːkɪt","ukphone":"ˈmɑːkɪt"},{"name":"different","trans":["adj. different; individual, unique"],"usphone":"ˈdɪfrənt","ukphone":"ˈdɪfrənt"},{"name":"fangs","trans":["n. [spine] fangs; [spine] fangs (plural of fang); tip of an object v. bite with fangs; with something like fangs (three single forms of fang)"]},{"name":"number","trans":["n. Numbers; periods (magazines, etc.); numbers; numbers; arithmetic vi. Included; total reached vt. Number; count; number...; limit the number"],"usphone":"ˈnʌmbə(r)","ukphone":"ˈnʌmbə(r)"},{"name":"teeth","trans":["n. Teeth"],"usphone":"tiːθ","ukphone":"tiːθ"},{"name":"cross","trans":["n. Cross, cross; cross, crucifix vi. cross; cross; cross vt. Hybridize; overcome; intersect adj. intersecting; opposites; cynical; angry"],"usphone":"krɒs","ukphone":"krɒs"},{"name":"lace","trans":["n. Lace; laces; laces; small amounts of spirits vt. Decorated with lace; knot vi. Lace-up n. (Lace) person's name; (Italian) Lacey"],"usphone":"leɪs","ukphone":"leɪs"},{"name":"pinch","trans":["v. Pinch; clamp; clip (foot); (due to fear or tension); (informal) theft; make it impossible to make ends; remove (buds, leaves, etc.) (to promote growth); save n. pinch, screw; small amount (informal) stealing n. (Pinch) (US, Canada, English) Pinch (name of person)"],"usphone":"pɪntʃ","ukphone":"pɪntʃ"},{"name":"reach","trans":["vi. Reach; extend; reach out; spread vt. Reach; Impact; Reach; Extend n. Scope; Extension; River Section; Cross Wind Drive n. (Reach) Name; (Invitation)"],"usphone":"riːtʃ","ukphone":"riːtʃ"},{"name":"tight","trans":["adj. Tight; sealed; tight; troublesome; strict; empty; stingy adv. Tightly; thoroughly n. (Tight) person's name; (English) Tate"],"usphone":"taɪt","ukphone":"taɪt"},{"name":"enormous","trans":["adj. huge, huge; ferocious, extremely evil"],"usphone":"ɪˈnɔːməs","ukphone":"ɪˈnɔːməs"},{"name":"giant","trans":["n. Giants; great people; giant animals; giant plants; big companies; (astronomical) superstars; adj. huge; giant; great"],"usphone":"ˈdʒaɪənt","ukphone":"ˈdʒaɪənt"},{"name":"huge","trans":["adj. huge; huge; infinite n. (Huge) names; (English) strange"],"usphone":"hjuːdʒ","ukphone":"hjuːdʒ"},{"name":"miserable","trans":["adj. miserable; painful; despicable"],"usphone":"ˈmɪzrəbl","ukphone":"ˈmɪzrəbl"},{"name":"rotten","trans":["adj. Rotten; depraved; foul-smelling; weak; extremely bad adv. Very n. (Rotten) person's name; (French, German) Rotten"],"usphone":"ˈrɒtn","ukphone":"ˈrɒtn"},{"name":"terrible","trans":["adj. Terrible; terrible; obnoxious adv. Very, very"],"usphone":"ˈterəbl","ukphone":"ˈterəbl"},{"name":"curly","trans":["adj. curly; curly; (wood) wrinkled; curled"],"usphone":"ˈkɜːli","ukphone":"ˈkɜːli"},{"name":"show","trans":["vt. Display; Description; Performance; Exhibit vi. Display; Instructions; Instructions n. Show; Show off n. (Show) (U.S., Brazil) Shaw (name of person)"],"usphone":"ʃəʊ","ukphone":"ʃəʊ"},{"name":"thankful","trans":["adj. thankful; pleased"],"usphone":"ˈθæŋkfl","ukphone":"ˈθæŋkfl"},{"name":"train","trans":["n. Train; Queue; Long Line; Skirt v. Training; Aim n. (Train) Name; (English) Train; (France) Trane; (Italy) Traine"],"usphone":"treɪn","ukphone":"treɪn"},{"name":"trip","trans":["n. Trips (especially short round trips); (racing, etc.) itineraries; illusions (experienced during drug use); tripping; mistakes; exciting experiences; self-indulgent attitudes (or actions); switches (of machines, circuits); detachments (of safety devices); easy footsteps; strange, wonderful and interesting experiences that make people happy vi. Stumbling or falling; walking briskly (or running or dancing); hallucinating (informally) (after taking drugs); automatically disconnecting (some circuits); taking a short trip vt. trip; (make) fall; trigger (switch); lift (anchor); erect (sail girder) n. (Trip) (US) Trip (name of person)"],"usphone":"trɪp","ukphone":"trɪp"},{"name":"grow","trans":["vi. Develop; grow; gradually become... vt. Make grow; grow; expand n. (Grow) person's name; (English) Grow"],"usphone":"ɡrəʊ","ukphone":"ɡrəʊ"},{"name":"plant","trans":["n. Factories, workshops; plants; equipment; crops vt. Plant; cultivate; cultivate; place vi. Name of the person who planted n. (Plant); (English, Spanish, Italian) Plant; (France) Prand"],"usphone":"plɑːnt","ukphone":"plɑːnt"},{"name":"pot","trans":["n. Pot; pot; can vt. Canning...; Shoot; Abbreviate vi. Shoot n. (Pot) person's name; (card) Bout; (Czech) Potter; (France) Wave"],"usphone":"pɒt","ukphone":"pɒt"},{"name":"soil","trans":["n. Land; soil; country; manure; agriculture; hotbed vt. Dirty; humiliate vi. Getting dirty"],"usphone":"sɔɪl","ukphone":"sɔɪl"},{"name":"sunlight","trans":["n. Sunshine n. (Sunlight) person's name; (English) Sunlight"],"usphone":"ˈsʌnlaɪt","ukphone":"ˈsʌnlaɪt"},{"name":"water","trans":["n. Water; seawater; rainwater; ocean, large areas of water vt. Moisten; supply water; water... vi. Adding water; crying; drooling n. (Water) person's name; (English) Water"],"usphone":"ˈwɔːtə(r)","ukphone":"ˈwɔːtə(r)"},{"name":"coat","trans":["n. Coat vt. Cover the surface of... n. (Coat) person's name; (France) Koa"],"usphone":"kəʊt","ukphone":"kəʊt"},{"name":"hoof","trans":["n. Hooves (of animals such as horses); human feet v. walking; kicking (ball); dancing"],"usphone":"huːf","ukphone":"huːf"},{"name":"stable","trans":["adj. Stable, firm; steady, steady; long-lasting; (chemical term) stable n. stables; horse farm; a group of racehorses (with the same horse owner or trainer); a group of people (working in the same place), a series of products (produced by the same company); organization, agency (providing the same training) v. rushed into the stable and tied (horse) to the stable; (be) locked in a stable n. (Stable) (American, English, French) Stable (name of person)"],"usphone":"ˈsteɪbl","ukphone":"ˈsteɪbl"},{"name":"stall","trans":["n. Stalls; corrals; cubicles (in the room); seats for the choir and priest (in the church); parking spaces (in motor vehicle parking); single stables (where horses stand before the race starts); (theater) seats; (vehicle) flames off; (aircraft) stalls v. flames out; delays (to gain time); suspension; (aircraft) stalls; (plane) stalls; (boat) sails out of control n. (Stall) (US) Stall (US) Starr (US) (person's name)"],"usphone":"stɔːl","ukphone":"stɔːl"},{"name":"stretch","trans":["v. stretching (soft or elastic); stretching; (making) excessive extension; (capital, resources) sufficient; extensive requirements; (making) maximum use (ability); exaggerating; continuing n. (limb or body) stretching; (muscle) stretching; stretching (of materials or clothing); difficult tasks; continuous stretch (of land or water); (time) continuous; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) lengthened motor vehicle adj. Elastic, stretchable n. (Stretch) (US) Strage (name of person)"],"usphone":"stretʃ","ukphone":"stretʃ"},{"name":"crazy","trans":["adj. crazy; fanatical, fascinated"],"usphone":"ˈkreɪzi","ukphone":"ˈkreɪzi"},{"name":"fail","trans":["vi. failure, failure; bankruptcy; lack; recession v. fail; disappoint; forget; discard n. Fail n. (Fail) person's name; (Portuguese, Czech) Fayle; (France) Faye"],"usphone":"feɪl","ukphone":"feɪl"},{"name":"fantasy","trans":["n. Illusions; daydreams; hallucinations adj. Unreal vt. Daydream; imagine vi. Indulge in fantasy; play fantasy (equivalent to phantasy)"],"usphone":"ˈfæntəsi","ukphone":"ˈfæntəsi"},{"name":"search","trans":["v. Search, search; investigation, search; body search; search; search (on computer) n. Search; search n. (Search) (India, US) Search n. (Search) (India, US) Sage (name of person)"],"usphone":"sɜːtʃ","ukphone":"sɜːtʃ"},{"name":"stew","trans":["n. Stewed dishes; anxiety, unease; (ancient) hot bathrooms; brothels; fish ponds, big fish barrels; (informal) flight attendants; trouble, stuffiness v. (meat, fruit, etc.) stewing, simmering; (tea) becomes thick and bitter (due to prolonged soaking); anxiety; stuffiness; (poems/text) immersion in n. (Stew) (English, American, Canada, Russian) Stu (name of person)"],"usphone":"stjuː","ukphone":"stjuː"},{"name":"vet","trans":["n. Veterinarians; Veterinary Clinics; Veterans; Examination v. Examination, Examination; Veterinarian; Treatment n. (Vet) (Dutch, Russian) Wert (name)"],"usphone":"vet","ukphone":"vet"},{"name":"chipmunk","trans":["n. chipmunks; [spine] golden squirrels"],"usphone":"ˈtʃɪpmʌŋk","ukphone":"ˈtʃɪpmʌŋk"},{"name":"furry","trans":["adj. Furry; fur-covered; fur-like n. (Furry) name; (English) Frey"],"usphone":"ˈfɜːri","ukphone":"ˈfɜːri"},{"name":"proud","trans":["adj. Proud; proud; conceited; prominent n. (Proud) name; (English) Proud"],"usphone":"praʊd","ukphone":"praʊd"},{"name":"sly","trans":["adj. cunning; naughty; secretive n. (Sly) name; (English) Sly"],"usphone":"slaɪ","ukphone":"slaɪ"},{"name":"striped","trans":["adj. striped; spotted v. stripped (past participle of strip)"],"usphone":"straɪpt","ukphone":"straɪpt"},{"name":"collector","trans":["n. Collectors; [electronic] electrodes; tax collectors; collectors"],"usphone":"kəˈlektə(r)","ukphone":"kəˈlektə(r)"},{"name":"job","trans":["n. Work; occupation vt. Contracting; valet trading vi. Name of person doing odd jobs n. (Job); (English) Job; (French, Portuguese) Rube; (? -1605) Job the Moscow Patriarch of the Russian Orthodox Church. ; (Germany, Serbia, Czech Republic, Netherlands, Italy) Job"],"usphone":"dʒɒb","ukphone":"dʒɒb"},{"name":"leader","trans":["n. Leader; leader; leader n. (Leader) name; (English) Reed"],"usphone":"ˈliːdə(r)","ukphone":"ˈliːdə(r)"},{"name":"pass","trans":["v. Pass, pass; advance in a direction; achieve (a certain position); pass; pass; pass; pass; pass; pass; pass; pass by vote (law, etc.); pass; discharge; circulation; abandon n. Pass; pass; pass; pass; pass; pass; leap; stage; fishway; (bridge) doesn't call; stabbing (in fencing); trick; (computer) browsing n. (Germany) Pass (in fencing) English) Paz (personal name)"],"usphone":"pɑːs","ukphone":"pɑːs"},{"name":"saver","trans":["n. Saver, depositor; rescuer; saving item; saving device; (travel) discount price; (horse racing) two-sided bet; thrifty person n. (Saver) (US) Saver (name of person)"],"usphone":"ˈseɪvə(r)","ukphone":"ˈseɪvə(r)"},{"name":"student","trans":["n. Student; Scholar n. (Student) name; (Germany) Student"],"usphone":"ˈstjuːdnt","ukphone":"ˈstjuːdnt"},{"name":"celebrate","trans":["vt. celebrate; hold; praise; congratulate; proclaim vi. Celebrate; celebrate holidays; hold religious ceremonies"],"usphone":"ˈselɪbreɪt","ukphone":"ˈselɪbreɪt"},{"name":"craft","trans":["n. Crafts; craftsmanship; spaceships vt. Exquisitely crafting n. (Craft) names; (English, German, Russian) Kraft"],"usphone":"krɑːft","ukphone":"krɑːft"},{"name":"feast","trans":["n. Feasts, banquets; (sensory) enjoyment; festivals v. Indulge in, feast; feast; go to a banquet"],"usphone":"fiːst","ukphone":"fiːst"},{"name":"heritage","trans":["n. Heritage; Tradition; Inheritance; Inheritance rights n. (Heritage) person's name; (English) Heritage"],"usphone":"ˈherɪtɪdʒ","ukphone":"ˈherɪtɪdʒ"},{"name":"lean","trans":["v. Tilt the body; lean; lean; (make) lean on adj. Thin and healthy; low in fat; difficult to make money; poor; efficient and low consumption; (mixed vaporized fuel) with a high proportion of air n. lean; inclination n. (Lean) (Dan) lean (name of person)"],"usphone":"liːn","ukphone":"liːn"},{"name":"Pisa","trans":["n. Pisa (Italian city)"],"usphone":"'pi:zə","ukphone":"'pi:zə"},{"name":"safe","trans":["adj. Safe; reliable; safe n. Safe; refrigerator; closet n. (Safe) name of person; (a few) Safi"],"usphone":"seɪf","ukphone":"seɪf"},{"name":"weight","trans":["n. Weight, gravity; burden; weight; importance vt. Add weight to make it heavier n. (Weight) name; (English) Weigert; (Czech) Weigert"],"usphone":"weɪt","ukphone":"weɪt"},{"name":"worker","trans":["n. Worker; worker; worker ant n. (Worker) name; (English) Walker"],"usphone":"ˈwɜːkə(r)","ukphone":"ˈwɜːkə(r)"},{"name":"carve","trans":["vt. Carve; cut; create vi. Cut; carving work n. (Carve) person's name; (West, Sweden) Carve"],"usphone":"kɑːv","ukphone":"kɑːv"},{"name":"draw","trans":["vt. Draw; pull; attract vi. Pull; drag n. Draw; Draw n. (Draw) person's name; (English) Delau"],"usphone":"drɔː","ukphone":"drɔː"},{"name":"light","trans":["n. Light; light; lamp; lighter; understanding; light color; sunroof adj. Light; light-colored; bright; relaxed; easy; light vi. Light; brighten; ignite vt. Illuminate; ignite; ignite adv. Lightly; clearly; lightly n. (Light) (English) Wright (personal name)"],"usphone":"laɪt","ukphone":"laɪt"},{"name":"pumpkin","trans":["n.Pumpkin"],"usphone":"ˈpʌmpkɪn","ukphone":"ˈpʌmpkɪn"},{"name":"scoop","trans":["n. Spoons, shovels; one spoon (amount); exclusive news; exaggerated slide-ups v. Use a spoon; pick up; get the first report; win; glide"],"usphone":"skuːp","ukphone":"skuːp"},{"name":"seed","trans":["n. Seed; basis; semen; germination; offspring; origin vt. Sowing; fruiting; maturing; leaving... seeds vi. Sowing; (plant) fruiting n. (Seed) person's name; (English) seed"],"usphone":"siːd","ukphone":"siːd"},{"name":"lemon","trans":["n. Lemon; lemon juice; lemon tree; lemon color; waste; idiot adj. Light yellow, lemon-colored n. (Lemon) (US) lemon (name)"],"usphone":"ˈlemən","ukphone":"ˈlemən"},{"name":"pitcher","trans":["n. Pitcher; big jug n. (Pitcher) name; (English) Pitcher"],"usphone":"ˈpɪtʃə(r)","ukphone":"ˈpɪtʃə(r)"},{"name":"spot","trans":["n. Location; spot vt. Recognize; stain; illuminate with light vi. Stained; full of spots adj. Onsite; spot trading adv. accurately; exactly"],"usphone":"spɒt","ukphone":"spɒt"},{"name":"squeeze","trans":["v. Squeezing; clutching; extortion; squeezing; squeezing; (informal) putting pressure on...; (particularly financial or commercial) disrupting n. Squeezing; squeezing; clutching; crowding; commissions; reduction (of available money, jobs, etc.); (informal) girlfriends, boyfriends; crowded social gatherings; pressing models; (informal) extorted money; (bridge) coercive play; (baseball) score-grabbing tactics"],"usphone":"skwiːz","ukphone":"skwiːz"},{"name":"sweet","trans":["adj. Sweet; sweet; aromatic; kind; fun; aromatic; baby () cool name; (English) Sweet; (English) Sweet"],"usphone":"swiːt","ukphone":"swiːt"},{"name":"thirsty","trans":["adj. thirsty, dry mouth; eager, eager"],"usphone":"ˈθɜːsti","ukphone":"ˈθɜːsti"},{"name":"guard","trans":["n. Guards; Vigilance; Guards; Protective Devices vi. Be wary vt. Defend; monitor n. (Guard) person's name; (English) Gerd"],"usphone":"ɡɑːd","ukphone":"ɡɑːd"},{"name":"lost","trans":["adj. lost, lost; lost, lost; irrecoverable; lost, lost; troubled; lost; lost; lost; died; failed v. lost; pain; miscarriage; sacrifice; failure (past tense and past participle of lose)"],"usphone":"lɒst","ukphone":"lɒst"},{"name":"salesperson","trans":["n. Salesperson"],"usphone":"ˈseɪlzpɜːsn","ukphone":"ˈseɪlzpɜːsn"},{"name":"stranger","trans":["n. Stranger; Outsider; Outsider n. (Stranger) name; (Sweden) Stranger; (English) Stranger"],"usphone":"ˈstreɪndʒə(r)","ukphone":"ˈstreɪndʒə(r)"},{"name":"uniform","trans":["adj. Uniform; consistent; identical; balanced; consistent n. Uniform vt. make uniform; make the same"],"usphone":"ˈjuːnɪfɔːm","ukphone":"ˈjuːnɪfɔːm"},{"name":"common","trans":["adj. common; common; common; common n. common; civilians; public land n. (Common) names; (French) Common; (English) Common; (English) Common"],"usphone":"ˈkɒmən","ukphone":"ˈkɒmən"},{"name":"fancy","trans":["v. Want to do; love; arrogance; imagine; think; think (especially speed racing) think... to win; (showing surprise or opposition) really didn't expect n. fantasy; imagination; hobby; the most popular person or animal (in sports such as horse racing); enthusiasts (of sports such as boxing); fancy cakes or cookies; (16th and 17th century musical terms) Fantasia adj. complex; expensive; delicate, fancy; imaginative; (food) high quality; (flower) variegated; (animal) n. (Fancy) fan (name) for viewing"],"usphone":"ˈfænsi","ukphone":"ˈfænsi"},{"name":"plain","trans":["adj. Flat; simple; plain; clear n. Plain; unformatted; unpretentious; something unpretentious adv. Clearly; plain n. (Plain) person's name; (English) Plane; (French) Plan"],"usphone":"pleɪn","ukphone":"pleɪn"},{"name":"rectangle","trans":["n. Rectangular; rectangular"],"usphone":"ˈrektæŋɡl","ukphone":"ˈrektæŋɡl"},{"name":"round","trans":["adj. round; curved; integer; perfect; approximate; obese; (sound) round; (ancient, money) large; (ancient, human, or way of speaking) straightforward adv. Spin; around; around; everywhere; in a detour; in the opposite direction; one by one; prep somewhere. Around; around; around; around...; at... stages; round; round; regular activity; circle, round object; fixed route v. (make) round; complete; round off; round off; round off; round off; progress; circumnavigate; gain weight n. (Round) (US, UK, Canada, Australia, India, Germany) Round (name of person)"],"usphone":"raʊnd","ukphone":"raʊnd"},{"name":"door","trans":["n. Door; home, door; doorway; channel n. (Door) person's name; (English) Dole"],"usphone":"dɔː(r)","ukphone":"dɔː(r)"},{"name":"march","trans":["vi. Move forward (firmly to a certain place); march, march; march; advance, carry out vt. Move forward; make the march n. Move forward; march; march; march"],"usphone":"mɑːtʃ","ukphone":"mɑːtʃ"},{"name":"parade","trans":["n. Parade; military parade; show off; march; parade ground vt. Parade; show off; line up vi. Parade; showing off; parade in line n. (Parade) name; (France, Germany) Parade"],"usphone":"pəˈreɪd","ukphone":"pəˈreɪd"},{"name":"stairs","trans":["n. Stairs; steps (plural of stair) n. (Stairs) person's name; (English) Stiles"]},{"name":"street","trans":["n. Street adj. n. (Street) name of the street; (English, Portuguese) Street; (German) Strait"],"usphone":"striːt","ukphone":"striːt"},{"name":"apple","trans":["n. An apple, an apple tree, something like an apple; [American] bombs, grenades, (baseball) balls; [American] people, guys."],"usphone":"ˈæpl","ukphone":"ˈæpl"},{"name":"birch","trans":["n. Birch; birch; birch vt. Whipping n. (Birch) names with birch bars; (English, Spanish) Birch; (Sweden) Birch"],"usphone":"bɜːtʃ","ukphone":"bɜːtʃ"},{"name":"elm","trans":["n. [forest] elm; elm adj. Elm's; elm's n. (Elm) name; (English, French, German, Dan, Sweden) Elm"],"usphone":"elm","ukphone":"elm"},{"name":"maple","trans":["n. Maple; light brown n. (Maple) name; (English) Maple; (French) Mapler"],"usphone":"ˈmeɪpl","ukphone":"ˈmeɪpl"},{"name":"oak","trans":["n.Oak; oak color; oak furniture adj. Of an oak tree; n. (Oak) person's name for an oak tree; (English) Oak"],"usphone":"əʊk","ukphone":"əʊk"},{"name":"pine","trans":["n. Pine; Pine; Pineapple, Pineapple v. Longing; Pain; Waning; Grieving for...; Mourning n. (Pine) Pine (name)"],"usphone":"paɪn","ukphone":"paɪn"},{"name":"willow","trans":["n. [forest] willow; [wood] willow wood products adj. Willow's wooden n. (Willow) name; (English) Willow, Willow (female name)"],"usphone":"ˈwɪləʊ","ukphone":"ˈwɪləʊ"},{"name":"cheese","trans":["n. [Food] cheese; cheese; VIP vt. Stop adj. rebellious; timid"],"usphone":"tʃiːz","ukphone":"tʃiːz"},{"name":"pepperoni","trans":["n.Pepperoni"],"usphone":"ˌpepəˈrəʊni","ukphone":"ˌpepəˈrəʊni"},{"name":"pizza","trans":["n. Pizza (an Italian-style pancake with filling covered with cheese and ketchup) n. (Pizza) name; (Italian) pizza"],"usphone":"ˈpiːtsə","ukphone":"ˈpiːtsə"},{"name":"sauce","trans":["n. Soy sauce; sauce; sauce vt. Add fun; season n. (Sauce) name; (West) Saucer; (France) Sos"],"usphone":"sɔːs","ukphone":"sɔːs"},{"name":"toss","trans":["v. throw, throw; throw (head); bump; shake; turn (pancake) upside down; throw a coin decision; (horse) drop (rider); (informal) search (somewhere) n. decide to throw a coin; raise your head (in anger); throw n. (Toss) (US) Toss (name of person)"],"usphone":"tɒs","ukphone":"tɒs"},{"name":"cover","trans":["vt. Includes; interviews, reports; involvement; walking (a journey); cover; cover; cover; cover; cover; cover; cover; cover; cover, excuse vi. cover; replace; pervert; insure...; n. (Cover) name; (English) Covell; (Italian)"],"usphone":"ˈkʌvə(r)","ukphone":"ˈkʌvə(r)"},{"name":"mess","trans":["n. Confusion; cafeterias, food groups; dilemmas; messy stuff vt. Disrupt, stain; destroy; make a meal vi. Messing things up; making a mess; playing with n. (Mess) names; (German, Roman) Mess"],"usphone":"mes","ukphone":"mes"},{"name":"mop","trans":["n. Mops, cloths; unruly hair; cleaning; washing brushes; labor market (for agricultural workers in the fall); grimace v. mopping with a mop; wiping away sweat (face) and tears from (eyes); making a funny face"],"usphone":"mɒp","ukphone":"mɒp"},{"name":"notice","trans":["n. Notices, announcements; notices; announcements vt. Notify; Notice; Pay Attention vi. Get noticed"],"usphone":"ˈnəʊtɪs","ukphone":"ˈnəʊtɪs"},{"name":"tracks","trans":["n. [railway] track (plural of track); [meter] track; tire"]},{"name":"enough","trans":["Adv. Sufficiently, sufficiently n. Many; sufficient adj. Sufficient int. That's enough!"],"usphone":"ɪˈnʌf","ukphone":"ɪˈnʌf"},{"name":"plan","trans":["n. Plan; floor plan vt. Plan; design; plan vi. Plan; plan n. (Plan) person's name; (Sweden) Plan; (France) Prang"],"usphone":"plæn","ukphone":"plæn"},{"name":"ruin","trans":["n. Destruction; destruction, extinction; collapse; bankruptcy, loss of work; root cause, root cause of bankruptcy; ruins; remnant v. damage, bad; destruction, having a disastrous effect on...; making it ruined; (making) bankrupt; (poetry) falling head down; depraved n. (Ruin) (French, Russian, Italian, Swedish) Luan (name of person)"],"usphone":"ˈruːɪn","ukphone":"ˈruːɪn"},{"name":"snow","trans":["n. Snow, snow; snow vi. Snowfall vt. Make one fall one after another; make white n. (Snow) person's name; (English) Snow"],"usphone":"snəʊ","ukphone":"snəʊ"},{"name":"computer","trans":["n. Computers; computers; electronic computers"],"usphone":"kəmˈpjuːtə(r)","ukphone":"kəmˈpjuːtə(r)"},{"name":"crash","trans":["v. Collision; (causing) crashing; (causing) crashing; making a loud noise; (financial enterprise, etc.) going bankrupt; (machine, system, etc.) crashing; losing (during a game); falling asleep (in a temporarily arranged place); heart stops beating; unauthorized entry n. (vehicle) crashes; collision sound; collapse (of a machine, system); sleeping; cheesecloth adj. Emergency, quick advs. loudly"],"usphone":"kræʃ","ukphone":"kræʃ"},{"name":"Father's Day","trans":["n. Father's Day (3rd Sunday in June every year)"],"usphone":"ˈfɑðəz","ukphone":"ˈfɑðəz"},{"name":"laugh","trans":["v. Laugh, make a laugh; laugh and say n. Laugh (sound); something or person that makes you laugh"],"usphone":"lɑːf","ukphone":"lɑːf"},{"name":"rainforest","trans":["n. (tropical) rainforest"],"usphone":"ˈreɪnfɒrɪst","ukphone":"ˈreɪnfɒrɪst"},{"name":"salty","trans":["adj. salty; salty"],"usphone":"ˈsɔːlti; ˈsɒlti","ukphone":"ˈsɔːlti; ˈsɒlti"},{"name":"steep","trans":["adj. steep; unreasonable; exaggerated; drastic elevation of vt. Soak; soak; fill... vi. bubble; immersion n. cliff; impregnation"],"usphone":"stiːp","ukphone":"stiːp"},{"name":"tundra","trans":["n. [ecology] tundra; [geography] tundra; frozen land"],"usphone":"ˈtʌndrə","ukphone":"ˈtʌndrə"},{"name":"bigger","trans":["adj. Bigger (big comparison level) n. (Bigger) person name; (English) Big"],"usphone":"bɪgə(r)","ukphone":"bɪgə(r)"},{"name":"break","trans":["v. Break; (human or animal) fracture; abrasion (skin); violation; damage; (machine) failure; interruption (continuity); (weather) mutation; (news) sudden spread; end; break; break; short vacation; gap; break; attack; fracture; end; chance; (snooker) score in a row; buds"],"usphone":"breɪk","ukphone":"breɪk"},{"name":"hill","trans":["n. Hills; Hills; Slopes; Mountain Hill n. (Hill) name; (French, Western) Eel; (German, English, German, German, German, German, German, German, English, Czech, Lo, Finland, Sweden) Hill"],"usphone":"hɪl","ukphone":"hɪl"},{"name":"roll","trans":["v. Rolling; rolling over; turning (eyes); rolling in place; (horse) lying down; rocking from side to side; faltering; rolling (dice); rolling (dice); rolling (number of dice); (turning) shoulders; driving; pushing; shaking the car window; (liquid) falling; (time) passing; steady and continuous; (product) produced from (machine); flowing; rolling; rolling, rolling; rolling (clothes); rolling (clothes) edge) roll up; flatten; cover; start; use a vibrato (consonant, especially r) n. Roll; column; rolled food; roll; roll over ; Shaking from side to side; rumbling; small bread; total number of people; list; document; rolling mill; roll; roll a tube; roll a dice n. (Roll) (US, N., Ga) Roll (name of person)"],"usphone":"rəʊl","ukphone":"rəʊl"},{"name":"snowball","trans":["n. Snowball vi. Throw a snowball; grow like a snowball vt. Throw a snowball at...; make n. (Snowball) name grow like a snowball; (English) Snowball"],"usphone":"ˈsnəʊbɔːl","ukphone":"ˈsnəʊbɔːl"},{"name":"snowman","trans":["n. Snowman n. (Snowman) name; (English) Snowman"],"usphone":"ˈsnəʊmæn","ukphone":"ˈsnəʊmæn"},{"name":"mussel","trans":["n. Mussels; mussels; mussels n. (Mussel) name; (French) Michel"],"usphone":"ˈmʌsl","ukphone":"ˈmʌsl"},{"name":"oval","trans":["adj. oval; oval n. oval; oval n. (Oval) name; (French) Orval"],"usphone":"ˈəʊvl","ukphone":"ˈəʊvl"},{"name":"pool","trans":["n. Joint ventures; pool; reservoirs; joint funding vi. Joint venture, partnership vt. Partnership n. (Pool) name; (English, Spanish) Poole; (Finn, De) Poole"],"usphone":"puːl","ukphone":"puːl"},{"name":"shaped","trans":["adj. Appropriate; shaped; planned vt. development; shaping (past participle and past tense of shape)"],"usphone":"ʃeɪpt","ukphone":"ʃeɪpt"},{"name":"shore","trans":["n. Seaside; coastal country (or region); pillar; zone between high tide line and low tide line v. Use a pillar to support; support to stabilize; help, support n. (Shore) (US, UK, Canada) Shore (name of person)"],"usphone":"ʃɔː(r)","ukphone":"ʃɔː(r)"},{"name":"tide","trans":["n. Trends, trends; tides vt. Drifting with the tide"],"usphone":"taɪd","ukphone":"taɪd"},{"name":"cleats","trans":["n. Wedge; tether pillow; anti-slip nail (plural form of cleat) v. Attach the bolt; attach the cable to the bolt (three single forms of cleat)"]},{"name":"slipper","trans":["n. Slippers vt. Hit with slippers"],"usphone":"ˈslɪpə(r)","ukphone":"ˈslɪpə(r)"},{"name":"sneaker","trans":["n. Sneakers; scumbags; sneaky people"],"usphone":"ˈsniːkə(r)","ukphone":"ˈsniːkə(r)"},{"name":"ceiling","trans":["n. Ceiling; upper limit"],"usphone":"ˈsiːlɪŋ","ukphone":"ˈsiːlɪŋ"},{"name":"cement","trans":["n. Cement; adhesives; bonds; factors that unite people; adhesive powder; dental bone; sedimentary rock matrix v. Adhesion, consolidation, determination; application of cement on...; (substance) adhesion (particles) to sedimentary rock"],"usphone":"sɪˈment","ukphone":"sɪˈment"},{"name":"cereal","trans":["n. Cereals, grains; cereal foods; cereal plants adj. Cereals; made from cereals"],"usphone":"ˈsɪəriəl","ukphone":"ˈsɪəriəl"},{"name":"concert","trans":["n. Concerts; unity; harmony vt. Coordinate; arrange collaboratively vi. Coordination; cooperation adj. Used for concerts; performed at concerts"],"usphone":"ˈkɒnsət","ukphone":"ˈkɒnsət"},{"name":"contest","trans":["n. Contests, contests; competition (for control or power); controversy, controversy v. Seek to win (competition, election, etc.); participate in (competition or election), compete; dispute; dispute; raise objections to..."],"usphone":"ˈkɒntest","ukphone":"ˈkɒntest"},{"name":"helmet","trans":["n. Steel helmet, helmet n. (Helmet) person's name; (Germany) Helmett"],"usphone":"ˈhelmɪt","ukphone":"ˈhelmɪt"},{"name":"pad","trans":["n. Padding; protective gear; note pad; filling vi. Walk; walk lightly vt. Fill; take n. (Pad) name; (English) Pad (male teacher name Patrick's nickname)"],"usphone":"pæd","ukphone":"pæd"},{"name":"skateboard","trans":["n. Ice skating board vi. Glide with a skateboard"],"usphone":"ˈskeɪtbɔːd","ukphone":"ˈskeɪtbɔːd"},{"name":"forgot","trans":["v. forget; negligence; omission (past tense of forget)"],"usphone":"fəˈɡɒt","ukphone":"fəˈɡɒt"},{"name":"noisy","trans":["adj. loud; loud; loud"],"usphone":"ˈnɔɪzi","ukphone":"ˈnɔɪzi"},{"name":"sloth","trans":["n. Lazy, lazy; [spine] sloth n. (Sloth) person's name; (Dan) Slott"],"usphone":"sləʊθ","ukphone":"sləʊθ"},{"name":"snooze","trans":["n. Take a nap; take a nap vi. Take a nap; take a nap vt. Spend the day lazily; take a nap to get away"],"usphone":"snuːz","ukphone":"snuːz"},{"name":"tired","trans":["adj. tired; tired, tired v. tired; tired (past participle of tire)"],"usphone":"ˈtaɪəd","ukphone":"ˈtaɪəd"},{"name":"snore","trans":["v. snoring n. Snoring (sound); (informal) something extremely annoying"],"usphone":"snɔː(r)","ukphone":"snɔː(r)"},{"name":"style","trans":["n. Style; fashion; type; font vt. Design; title; make it trendy vi. Design style; decorative painting with a knife n. (Style) person's name; (English) Steyr"],"usphone":"staɪl","ukphone":"staɪl"},{"name":"wake","trans":["vi. wake up; wake up; alert vt. Wake up; inspire n. Trail; Vigil; Mourner n. (Wake) name; (English) Wake"],"usphone":"weɪk","ukphone":"weɪk"},{"name":"cloud","trans":["n. Clouds; cloudy clouds; cloud-like objects; a large group; dark spots vt. Confuse; obscure by clouds; make melancholy; tarnish vi. Overcast; dark clouds n. (Cloud) Claude (name)"],"usphone":"klaʊd","ukphone":"klaʊd"},{"name":"lightning","trans":["n. Lightning; Sudden; (informal) sudden good luck adj. Lightning-fast, fast-paced; sudden v. lightning"],"usphone":"ˈlaɪtnɪŋ","ukphone":"ˈlaɪtnɪŋ"},{"name":"rain","trans":["n. Rain; rain; rainy day; rainy season vi. Rain; rainfall vt. Give in large quantities; leave behind n. (Rain) names; (France) Lan; (English) Rain; (Luo, Jie) Ryan"],"usphone":"reɪn","ukphone":"reɪn"},{"name":"sky","trans":["n. Sky; vertex vt. Throw... into the air; hang... too high vi. Kick or hit a high-altitude ball; tilt the paddle too high; soar n. (Sky) person's name; (English) Sky"],"usphone":"skaɪ","ukphone":"skaɪ"},{"name":"thunder","trans":["n. Thunder; roar; intimidation vi. thunder; yelling vt. shout loudly; shout"],"usphone":"ˈθʌndə(r)","ukphone":"ˈθʌndə(r)"},{"name":"wind","trans":["n. Wind; Breathing; Odor; Circumference vt. Winding; twisting; bending; blowing a horn; wrapping or entangling someone vi. Winding; Clockwork; Blowing the horn n. (Wind) name; (English, Germany, Sweden) Wind"],"usphone":"wɪnd","ukphone":"wɪnd"},{"name":"chew","trans":["v. Chewing; biting (due to annoyance or anxiety); thinking; reflecting; (informal) small talk n. Chewing; chewing; chewing, chewing gum, tobacco for chewing n. (Chew) (American, New Zealand, Ma, English, Canada) (name of person)"],"usphone":"tʃuː","ukphone":"tʃuː"},{"name":"dough","trans":["n. Dough; money"],"usphone":"dəʊ","ukphone":"dəʊ"},{"name":"mix","trans":["v. (Make) mix; prepare; participate; compatibility, get along peacefully; socialize; mix recording; mix; juxtapose; combine; (informal) fight n. Mix; mixed; mixed; mixed groups of people; confusion; ratio of ingredients; ingredients; mixing, mixing; music composition, concert; superposition of images n. (Mix) (US, Russia, Pakistan) Meeks (name of person)"],"usphone":"mɪks","ukphone":"mɪks"},{"name":"special","trans":["adj. Special; Important; Special; Special; Special; Special; Special; Special; Special (Subject) In-depth Research; Special (Education); Special (Matrix) n. Special (Event, Program, etc.); Special Price (Product); Special Offer; Special Food; Special Product; Shuttle n. (Special) (Special) (India, US, Russian) Spacia (name of person)"],"usphone":"ˈspeʃl","ukphone":"ˈspeʃl"},{"name":"treat","trans":["vt. Treat; treat; discuss; treat as vi. Discuss; Invite; Negotiate n. Invite; Treat n. (Treat) Name; (English) Treat"],"usphone":"triːt","ukphone":"triːt"},{"name":"bed","trans":["n. Bed; foundation; river bottom, seabed vt. Make it sleep; place it; embed it; plant vi. Going to bed; layering"],"usphone":"bed","ukphone":"bed"},{"name":"brush","trans":["n. Brushes; Brushes; Brushes; Quarrels; Conflicts; Bushland; Short Trees; Fox Tails vt. brush; painting; vi. brush; wipe; skim; touch (as you pass by)"],"usphone":"brʌʃ","ukphone":"brʌʃ"},{"name":"drink","trans":["v. Drink, drink; drink; after drinking..., cheers; (metaphor) revel in; (informally) absorb (moisture); drink (alcohol) to have a certain flavor; raise a glass to celebrate n. Wine; drink (drink or wine); drink, drink, be greedy, abuse alcohol"],"usphone":"drɪŋk","ukphone":"drɪŋk"},{"name":"pajamas","trans":["n. Pajamas; wide pants"],"usphone":"pə'dʒɑːməz","ukphone":"pə'dʒɑːməz"},{"name":"read","trans":["vt. Read; read, understand vi. Read; read it up n. Read; book adj. An educated n. (Read) name; (English) Reed"],"usphone":"riːd","ukphone":"riːd"},{"name":"wash","trans":["v. washing; bathing; washable; scrubbing; washing; washing; slapping; soaking; (emotional) shock; washing; washing; painting; standing; eroding n. Washing; waves (left after a boat or plane has passed); sound of waves; thin coating; soap; clothes to be washed; alluvium; scum; form (unbeneficial to both parties); (the Wash) Wash Bay n. (Wash) (American) Wash (name of person)"],"usphone":"wɒʃ","ukphone":"wɒʃ"},{"name":"boat","trans":["n. Small boat; ship vi. rowing"],"usphone":"bəʊt","ukphone":"bəʊt"},{"name":"pull","trans":["vt. Pull; pull; drag vi. Pull, drag; pull n. Pull, pull rope; pull force, traction; drag n. (Pull) name; (France) Pierre; (Germany, Sweden) Poole"],"usphone":"pʊl","ukphone":"pʊl"},{"name":"ship","trans":["n. Ship, ship; three (or more) masted sailboat; boat (especially racing); spaceship; aircraft v. transport (by boat, plane, truck); repatriation (someone); (putting) on the market; boarding a ship; (sailors) working on a ship; entering water from the side of the boat; putting (pulp in a pulp rack) inside the ship; installing (rudders, masts, etc.); providing a ship; boarding a boat; traveling by boat; (military order) continue sailing; serve on a ship n. (US) (Russian, US), English) Photo (person's name)"],"usphone":"ʃɪp","ukphone":"ʃɪp"},{"name":"stuck","trans":["v. thorn (past tense and past participle of stick) adj. Stuck, unable to move; trapped; stuck; stuck; stagnant; unable to get out of trouble; crushed, unable to continue (due to difficulties) n. (Stuck) (US) Stark (name of person)"],"usphone":"stʌk","ukphone":"stʌk"},{"name":"submarine","trans":["n. Submarines; undersea organisms adj. Undersea; underwater vt. Attack vi with a submarine. Swipe down; slide down"],"usphone":"ˌsʌbməˈriːn; ˈsʌbməriːn","ukphone":"ˌsʌbməˈriːn; ˈsʌbməriːn"},{"name":"fluff","trans":["n. Fluff; mistakes; worthless things vt. Misread; shake loose; make... fuzzy vi. fluff; error; loosening"],"usphone":"flʌf","ukphone":"flʌf"},{"name":"ready","trans":["adj. Ready; ready; quick; willing; n. cash soon; ready condition adv. promptly; in advance vt. Make ready n. (Ready) person's name; (English) Reddy"],"usphone":"ˈredi","ukphone":"ˈredi"},{"name":"stripes","trans":["n. Striped cloth; striped cloth (stripe plural form) v. Add stripes to... (three single forms of stripe)"],"usphone":"st'raɪps","ukphone":"st'raɪps"},{"name":"tiger","trans":["n. Tiger; Violent person n. (Tiger) name; (English) Tiger; (French) Tigre; (Sweden) Teague"],"usphone":"ˈtaɪɡə(r)","ukphone":"ˈtaɪɡə(r)"},{"name":"muscle","trans":["n. Muscles; strength vt. Strengthen; move hard; squeeze hard vi. Move hard"],"usphone":"ˈmʌsl","ukphone":"ˈmʌsl"},{"name":"stronger","trans":["adj. Stronger"],"usphone":"strɒŋgə(r)","ukphone":"strɒŋgə(r)"},{"name":"study","trans":["n. Study, research; subject; study room; study vt. Study; consider; study; scrutinize vi. Research; work n. (Study) person's name; (English) study"],"usphone":"ˈstʌdi","ukphone":"ˈstʌdi"},{"name":"try","trans":["vt. Attempt, effort; test; trial; test vi. Try; Try; Test n. Try; Try; Test n. (Try) Name; (English, Indonesia) Teri; () Delhi"],"usphone":"traɪ","ukphone":"traɪ"},{"name":"broken","trans":["adj. broken; broken v. broken; broken; damaged (past participle of break)"],"usphone":"ˈbrəʊkən","ukphone":"ˈbrəʊkən"},{"name":"crack","trans":["v. Breaking; cracking; cracking (grain); cracking (a safe); successfully obtained; heavy impact (audible); (making) a bursting sound; (suddenly) hoarse; giving in; (informal) being unable to eat; (informal) suddenly laughing; (informally) finding a solution; stopping; opening a bottle; saying (jokes); cracking (hydrocarbons) n. Crack; crack; crack; crack; crack; burst sound; (audible); heavy impact Potent cocaine; jokes (at bitter people); good times; flaws (in opinions or systems); voice changes adj. Well-trained, highly skilled, the best n. (Crack) (English, Canada, US) Clark (name)"],"usphone":"kræk","ukphone":"kræk"},{"name":"fever","trans":["n. Fever, fever; fanaticism vt. Make you feverish; make you feverish; make you sick with a fever vi. fever; fanaticism; febrile illness"],"usphone":"ˈfiːvə(r)","ukphone":"ˈfiːvə(r)"},{"name":"paw","trans":["n. (animal) claws; (someone's) hands (used when displeased or angry) v. grasping, picking; touching; planing; caressing rudely; grabbing with claws; rummaging"],"usphone":"pɔː","ukphone":"pɔː"},{"name":"shell","trans":["n. Shell, shell; shell; shape vi. peeling; setting the position of the command line interpreter vt. Peeling; bombardment"],"usphone":"ʃel","ukphone":"ʃel"},{"name":"awake","trans":["adj. Awake v. Awakening, becoming aware; awakening, being aroused, stimulated"],"usphone":"əˈweɪk","ukphone":"əˈweɪk"},{"name":"bear","trans":["v. endure, bear; be unfit for something; bear responsibility; bear responsibility; bear (emotion, especially bad mood); support; display; carry; (car, boat) transport; birth (child); actually, blossom (formal); turn; take a turn; be proportionate (by name, title); perform; have (mark, characteristics); blow; have (name or title); write; have (similarity or relationship); generate (interest) n. bear; bear (interest) n. bear; sell (stock) Empty person; (informal) uneducated person; heavy man; (informal) “polar bear” (Russian nickname); ( informal) police; tricky things; grumpy n. (Bear) (US) Bell (name)"],"usphone":"beə(r)","ukphone":"beə(r)"},{"name":"sleepy","trans":["adj. Sleepy, sleepy; (place) deserted, quiet; (business, industry, etc.) inactive"],"usphone":"ˈsliːpi","ukphone":"ˈsliːpi"},{"name":"wheat","trans":["n. Wheat; wheat color n. (Wheat) name; (English) Wheat"],"usphone":"wiːt","ukphone":"wiːt"},{"name":"whiskers","trans":["n. Beard, beard (plural of whisker) v. make... have whiskers; make... have something like a beard (3rd person singular of whisker)"],"usphone":"'hwɪskəz","ukphone":"'hwɪskəz"},{"name":"whistle","trans":["n. Whistle; whistle; whistling; a set of clothes; with the same color card v. Whistling; whistling; whistling; whistling; whistling"],"usphone":"ˈwɪsl","ukphone":"ˈwɪsl"},{"name":"pick","trans":["vi. Picking; picking; digging vt. Picking; selecting; picking; excavating n. Select; Crane Hoe; Digging; Covering n. (Pick) person's name; (English, French, German, Czech, German, Czech, Swedish, Swedish) Pique"],"usphone":"pɪk","ukphone":"pɪk"},{"name":"pop","trans":["n. Pop music; pop culture; (especially used as a title) dad, dad; soda; bang; shooting; (quick hit) sign; criticism; popular classical music v. Sudden appearance; act suddenly; explode; shoot; stare; (make) make a burst sound; place quickly; leave quickly; change in ear pressure; (excessive) medication; adj. Popular; popular, popular adv. Suddenly; pops; bursts int. A bang of explosions abbr. Post office protocol (post office protocol); population (population) n. (Pop) (name of person)"],"usphone":"pɒp","ukphone":"pɒp"},{"name":"ripe","trans":["adj. Ripe, ripe; ripe n. Ripe (Swedish name)"],"usphone":"raɪp","ukphone":"raɪp"},{"name":"walk","trans":["v. Walking, walking; walking; walking; walking; accompanying... walking; being stolen; (ghost) infestation; (informal) release from suspicion; (baseball) free entry; (ancient) life; guide...; (informal) abandon n. walk, walk; path; (postman's) delivery route; forest area (ranger); forest area under the jurisdiction of (rangers); cockfighting farm; beagle breeding farm; leisurely pace; (baseball) free landing (n) walk (n) US) Walker (name)"],"usphone":"wɔːk","ukphone":"wɔːk"},{"name":"wild","trans":["adj. wild; barbaric; fanatical; desolate n. Wilderness adv. Insanely; randomly n. (Wild) name; (English) Wilder; (France, Germany, Portugal, Czech, Russian) Wild"],"usphone":"waɪld","ukphone":"waɪld"},{"name":"Friday","trans":["n. Friday; loyal servant"],"usphone":"ˈfraɪdeɪ; ˈfraɪdi","ukphone":"ˈfraɪdeɪ; ˈfraɪdi"},{"name":"Monday","trans":["n. Monday"],"usphone":"ˈmʌndeɪ; ˈmʌndi","ukphone":"ˈmʌndeɪ; ˈmʌndi"},{"name":"Saturday","trans":["n. Saturday"],"usphone":"ˈsætədeɪ; ˈsætədi","ukphone":"ˈsætədeɪ; ˈsætədi"},{"name":"Sunday","trans":["n. Sunday; Sunday"],"usphone":"ˈsʌndeɪ; ˈsʌndi","ukphone":"ˈsʌndeɪ; ˈsʌndi"},{"name":"Thursday","trans":["n. Thursday"],"usphone":"ˈθɜːzdeɪ; ˈθɜːzdi","ukphone":"ˈθɜːzdeɪ; ˈθɜːzdi"},{"name":"Tuesday","trans":["n. Tuesday"],"usphone":"ˈtjuːzdeɪ; ˈtjuːzdi","ukphone":"ˈtjuːzdeɪ; ˈtjuːzdi"},{"name":"Wednesday","trans":["n. Wednesday"],"usphone":"ˈwenzdeɪ; ˈwenzdi","ukphone":"ˈwenzdeɪ; ˈwenzdi"},{"name":"box","trans":["n. Box, box; private room; one punch vi. Boxing vt. Boxing; packed... in a box; slap n. (Box) person's name; (English, French, Spanish) box"],"usphone":"bɒks","ukphone":"bɒks"},{"name":"delivery","trans":["n. [trade] delivery; delivery; delivery"],"usphone":"dɪˈlɪvəri","ukphone":"dɪˈlɪvəri"},{"name":"knock","trans":["vi. knock; hit; tap vt. knock; knock; knock; criticism n. Knock; knock; knock; explosion"],"usphone":"nɒk","ukphone":"nɒk"},{"name":"smash","trans":["vt. Smash; bankrupt; collapse; crash; disrupt (political group or system) vi. Smash; break n. Break; Dash; Clash; Big Defeat; Very popular song (or movie, drama) adv. Shout adj. amazing; very sensational; excellent"],"usphone":"smæʃ","ukphone":"smæʃ"},{"name":"stamp","trans":["n. Stamps; imprints; signs; stomps vt. Remember; mark; stamp on...; put a stamp on...; step on with your foot vi. Stomp; smash; destroy n. (Stamp) name; (German) Stump; (English) Stamp"],"usphone":"stæmp","ukphone":"stæmp"},{"name":"baby","trans":["n. Babies, babies; childish people vt. Indulge, treat... like a baby adj. Baby's; baby's n. (Baby) name; (French, Portuguese) Bobby; (English) Bobby, Barbie (female name); (Russian) Babi"],"usphone":"ˈbeɪbi","ukphone":"ˈbeɪbi"},{"name":"bilby","trans":["Rabbit-eared raccoon"],"usphone":"ˈbɪlbi","ukphone":"ˈbɪlbi"},{"name":"kangaroo","trans":["n.Kangaroos"],"usphone":"ˌkæŋɡəˈruː","ukphone":"ˌkæŋɡəˈruː"},{"name":"koala","trans":["n. Koala, koala (born in Australia, also known as koalas)"],"usphone":"kəʊˈɑːlə","ukphone":"kəʊˈɑːlə"},{"name":"pouch","trans":["n. Pouch; nursery bag; tobacco bag vi. In the form of a bag vt. Make it into a bag; put... in the bag n. (Pouch) name; (Czech) Paugh; (English) Poch"],"usphone":"paʊtʃ","ukphone":"paʊtʃ"},{"name":"wallaby","trans":["n. [Spine] Wallabies; Australian natives (especially women)"],"usphone":"ˈwɒləbi","ukphone":"ˈwɒləbi"},{"name":"bend","trans":["v. bend, bend; yield; turn, turn; tilt, deflect; bend (limb, etc.); distort, tamper; force, concentrate; tie, bind (cable) n. Turn, curve; bend; bind; (diver's) decompression sickness (the bends); (on the coat of arms) diagonal stripes n. (Bend) (American, Dan, Germany) Bender (name of person)"],"usphone":"bend","ukphone":"bend"},{"name":"delicious","trans":["adj. delicious; delicious"],"usphone":"dɪˈlɪʃəs","ukphone":"dɪˈlɪʃəs"},{"name":"hang","trans":["vt. hang, hang; decorate; hang; leave unresolved vi. Suspended, hanged; hanged; suspended, suspended n. (Hang) name; (Luo) Han; (Chinese in Southeast Asian countries) Kang; (old) Han; () Han (used in the first section of the name), hang"],"usphone":"hæŋ","ukphone":"hæŋ"},{"name":"otter","trans":["n. Otter; Otter skin n. (Otter) name; (English, German, French, Swedish) Ott"],"usphone":"ˈɒtə(r)","ukphone":"ˈɒtə(r)"},{"name":"tongue","trans":["n. Tongue; language vt. Lick; rebuke; blow with tongue vi. Speaking; wind instrument n. (Tongue) person's name; (English) Tang"],"usphone":"tʌŋ","ukphone":"tʌŋ"},{"name":"alone","trans":["adj. Alone; alone; alone; alone; alone; only adv. Alone; alone; alone; only, only; only...; only; alone; alone"],"usphone":"əˈləʊn","ukphone":"əˈləʊn"},{"name":"movie","trans":["n. Film; cinema; film industry adj. Of the movie"],"usphone":"ˈmuːvi","ukphone":"ˈmuːvi"},{"name":"shop","trans":["n. Store; store vt. Shopping vi. Shopping; shopping"],"usphone":"ʃɒp","ukphone":"ʃɒp"},{"name":"branch","trans":["n. Branches; Branches; Branches; Tributaries; Forks; (Blood Vascular) Branches v. Branches; Branches; Divergence n. (Branch) Branch (person's name)"],"usphone":"brɑːntʃ","ukphone":"brɑːntʃ"},{"name":"collecting","trans":["gather to collect (present participle of collect)"]},{"name":"root","trans":["n. Root; root; root word; ancestor vi. Rooting; Eradicate vt. Rooted, fixed; root is n. (Root) name; (English) Root; (Germany, Sweden) Roth"],"usphone":"ruːt","ukphone":"ruːt"},{"name":"trunk","trans":["n. Tree trunks; trunk; elephant nose; trunk at the rear of a car vt. Put... in the suitcase adj. Trunk's; trunk's; n. (trunk) name of the box; (German, German, Western) Trenk"],"usphone":"trʌŋk","ukphone":"trʌŋk"},{"name":"hollow","trans":["adj. empty; hollow, empty; concave; hypocritical n. hole; valley; hole vt. Make it hollow vi. Form a cavity adv. completely; useless n. (Hollow) person's name; (English) Hollo"],"usphone":"ˈhɒləʊ","ukphone":"ˈhɒləʊ"},{"name":"sharp","trans":["adj. Drastic; sharp; intense; agile; harsh adv. sharply; sharply; abruptly n. pointed vt. Speed up; raise the pitch vi. Play n. (Sharp) person's name; (English) Sharp"],"usphone":"ʃɑːp","ukphone":"ʃɑːp"},{"name":"syrup","trans":["n. Syrups, fruit juices; medicinal syrups"],"usphone":"ˈsɪrəp","ukphone":"ˈsɪrəp"},{"name":"umbrella","trans":["n. Umbrellas; umbrellas; shelters; umbrella-shaped structures"],"usphone":"ʌmˈbrelə","ukphone":"ʌmˈbrelə"},{"name":"climbing","trans":["n. Mountain climbing; climbing; ascent adj. Ascending; climbing v. climbing; rising; (plant) climbing; struggling to climb out (confined space) (present participle of climb)"],"usphone":"ˈklaɪmɪŋ","ukphone":"ˈklaɪmɪŋ"},{"name":"ice hockey","trans":["Ice hockey, ice hockey"],"usphone":"ˈaɪs hɒki","ukphone":"ˈaɪs hɒki"},{"name":"skiing","trans":["n. Skiing; Skiing Skills v. Skiing (the ing form of skiing)"],"usphone":"ˈskiːɪŋ","ukphone":"ˈskiːɪŋ"},{"name":"snowboarding","trans":["n. Snowboarding (sport); Snowboarding (sport) v. Participation in skiing (in the form of snowboarding)"],"usphone":"ˈsnəʊbɔːdɪŋ","ukphone":"ˈsnəʊbɔːdɪŋ"},{"name":"snowshoeing","trans":["n. Walking in snowshoes v. Walking in snowshoes (present participle of snowshoe)"]},{"name":"sport","trans":["n. Sports; games; entertainment; games; jokes vi. Game vt. Gaming; playing sports; boasting adj. sporting"],"usphone":"spɔːt","ukphone":"spɔːt"},{"name":"behave","trans":["vi. Performance; (machine, etc.) operation; proper behavior; (thing) playing a certain role vt. Follow the rules; act..."],"usphone":"bɪˈheɪv","ukphone":"bɪˈheɪv"},{"name":"focus","trans":["n. Focus; center; clear; focal length vt. Focus; focus vi. Focus; focus; adjust focus distance n. (Focus) person's name; (Sweden) Focus"],"usphone":"ˈfəʊkəs","ukphone":"ˈfəʊkəs"},{"name":"listen","trans":["vi. Listen, listen; obey, listen n. Listen, listen"],"usphone":"ˈlɪsn","ukphone":"ˈlɪsn"},{"name":"work","trans":["n. Work; work; product; operation; occupation; act; career; factory; work; literary, musical or artistic work vt. Make work; operate; operate; move forward slowly vi. Work; operate; function n. (Work) (English, Esse, Dan, Bing, US) Walker (name of person)"],"usphone":"wɜːk","ukphone":"wɜːk"},{"name":"against","trans":["prep. Opposition, violation; adverse to...; close contact, collision; target; prevention, defense; (sports competition) match; use... as a background; reference, comparison with...; (gambling) anticipate the failure of..."],"usphone":"əˈɡenst; əˈɡeɪnst","ukphone":"əˈɡenst; əˈɡeɪnst"},{"name":"create","trans":["vt. create, create; cause"],"usphone":"kriˈeɪt","ukphone":"kriˈeɪt"},{"name":"rule","trans":["n. Rules; Suggestions; Governance; Habits; Laws; Rule of Law; Rule of Law; Ruler; Dash; Rule; Rule; Ruling; Draw on a Scale; (Informal) Excellent; (Planets) Influence...; (Price) is generally at a certain level n. (Rule) (West) Rulai (name of person)"],"usphone":"ruːl","ukphone":"ruːl"},{"name":"swing","trans":["v. Swing; hang; jump; rotate; rotate (on the axis); move (boat, plane) to all positions; (abruptly) turn; walk with a big swing; hang; walk; walk; jump; throw at...; fly (cricket) sideways; change (mood or opinion); gain; have a decisive influence on...; successfully completed; strong sense of rhythm n. Swing; swing; rhythm; light action (cricket) Side flying ball; (politician) A trip with multiple stays; hitting; ups and downs adj. Strong rhythm jazz music; decisive n. (Swing) (American, Swedish, English), Swain (personal name)"],"usphone":"swɪŋ","ukphone":"swɪŋ"},{"name":"touch","trans":["v. Touch; tap (button); tap (instrument); touch (instrument); touch (ball); touch (curve, surface); handle (particularly in a harmful way); cause harm (someone); use (storage); consume (food or drink); act; involve; clearly visible (quality, characteristics); reveal appearance; touch; (informal) mildly insane; (informal) reach (a certain level or amount) n. touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; touch; Elasticity (of instrument keys, strings); Light touch (of pens, pencils, etc.); Test; Slight; Technique; Skills; (Percussion of the chimes) Middle) Less modulation of Zhong Le; retouching; (informal) asking for money n. (Touch) (card) Du (name of person)"],"usphone":"tʌtʃ","ukphone":"tʌtʃ"}]