[{"name":"arms","trans":["n. Arm (plural of arm); [military] weapon; coat of arms v. Armament; equipped (three single forms of arm) n. (Arms) name; (English) Arms"],"usphone":"ɑːmz","ukphone":"ɑːmz"},{"name":"different","trans":["adj. different; individual, unique"],"usphone":"ˈdɪfrənt","ukphone":"ˈdɪfrənt"},{"name":"eye","trans":["n. Eyes; Sight; Vision; Opinions, Opinions vt. Watch and see n. (Eye) names; (German) Aye; (English) Ai"],"usphone":"aɪ","ukphone":"aɪ"},{"name":"friend","trans":["n. Friend; Assistant; Sponsor n. (Friend) Name; (English) Flanders"],"usphone":"frend","ukphone":"frend"},{"name":"leg","trans":["n. leg; pillar"],"usphone":"leɡ","ukphone":"leɡ"},{"name":"space","trans":["n. Space; space; distance vi. Retention interval vt. Separated"],"usphone":"speɪs","ukphone":"speɪs"},{"name":"airplane","trans":["n. Aircraft"],"usphone":"ˈeəpleɪn","ukphone":"ˈeəpleɪn"},{"name":"grow","trans":["vi. Develop; grow; gradually become... vt. Make grow; grow; expand n. (Grow) person's name; (English) Grow"],"usphone":"ɡrəʊ","ukphone":"ɡrəʊ"},{"name":"machine","trans":["n. Machinery, machines; institutions; people who work like machines vt. Using a machine to make n. (Machine) person's name; (Italian) Makine"],"usphone":"məˈʃiːn","ukphone":"məˈʃiːn"},{"name":"place","trans":["n. Place; residence; seat vt. Placement; Appointment; Delivery vi. Top ranking; N. (Place) name; (France) Place; (France) Plus; (English) Price"],"usphone":"pleɪs","ukphone":"pleɪs"},{"name":"trick","trans":["n. Tricks; Pranks; Tricks; Tricks; Scams; Fraud vt. Deceive; deceive; decorate; dress up vi. deceiving; teasing adj. Stunt; fraudulent; deceptive n. (trick) person name; (English) trick"],"usphone":"trɪk","ukphone":"trɪk"},{"name":"way","trans":["n. Method; Path; Direction; Industry; Habits adv. Greatly; far away adj. Name of n. (Way) person on the way; (middle) see Wei; (English, Myanmar) Wei"],"usphone":"weɪ","ukphone":"weɪ"},{"name":"big","trans":["adj. Big; important; large adv. Massive land; smooth; exaggerating n. (Big) people's names; (Earth) Big"],"usphone":"bɪɡ","ukphone":"bɪɡ"},{"name":"blue","trans":["adj. Blue; melancholy, pessimistic; bluish (due to cold or trouble breathing), blue-violet; (movie, joke, or story) erotic, yellow; (meat) unripe; (politically) conservative n. blue; blue items; (Oxford or Cambridge University athletes) blue honors; mistakes; redheads; fights vt. (Make) Blue; Dye... Blue; Give... Blue Bleach; Splurge (money) n. (Blue) (UK, US, Canada, Australia, New Zealand) Blue (name of person)"],"usphone":"bluː","ukphone":"bluː"},{"name":"brown","trans":["adj. Brown, brown; sun-tanned vi. Turns brown n. Brown, brown vt. Turn brown n. (Brown) name; (English, Italian, Finnish, Czech, German, French, Spanish, Portuguese) Brown"],"usphone":"braʊn","ukphone":"braʊn"},{"name":"earthworm","trans":["n. [spineless] earthworms"],"usphone":"ˈɜːθwɜːm","ukphone":"ˈɜːθwɜːm"},{"name":"plant","trans":["n. Factories, workshops; plants; equipment; crops vt. Plant; cultivate; cultivate; place vi. Name of the person who planted n. (Plant); (English, Spanish, Italian) Plant; (France) Prand"],"usphone":"plɑːnt","ukphone":"plɑːnt"},{"name":"red","trans":["adj. Red, red; (hair) reddish brown; (face) reddish; (eyes) red; (eyes) red; revolutionary, aggressive; (human) red; red (wine) red; (wine) red; (indicating stop) red (light), red (flag); prohibited, dangerous; (indicated by red signs on ski trails) second most difficult; (physical) red, one of the three colors of quark; red (especially when used in the Cold War); stained with blood; (ancient or poetry/literature) bleeding; (Xhosa) n. red, red pigment from traditional tribal culture ; red coat; red wine; red thing (or person); deficit, deficit; activist n. (Red) Red (person name)"],"usphone":"red","ukphone":"red"},{"name":"ring","trans":["n. Ring; ring; circle; round arena (or performance field); furnace mouth; (illegal) gang; bell; (bird) leg ring; planetary aura; ring moat; anus; people (or things) in a circle; feeling v. calling; making a ring; reverberating; filling; humming; requesting service (by ringing a bell); sound (with some impression); report (time); surround; circle n. (Ring) (US, Nou, Germany, love, love) English, Bo, Dan) Lin (personal name)"],"usphone":"rɪŋ","ukphone":"rɪŋ"},{"name":"small","trans":["adj. Few, small; weak; almost none; unimportant; young adv. Tiny Land; Despicable n. Small Items; Short Person n. (Small) Name; (English) Small"],"usphone":"smɔːl","ukphone":"smɔːl"},{"name":"soil","trans":["n. Land; soil; country; manure; agriculture; hotbed vt. Dirty; humiliate vi. Getting dirty"],"usphone":"sɔɪl","ukphone":"sɔɪl"},{"name":"bird","trans":["n. Birds; guys; badminton vt. Cheer for...; cheer vi. Bird hunting; observational study of wild birds n. (Bird) name; (English, Spanish) Bird"],"usphone":"bɜːd","ukphone":"bɜːd"},{"name":"black","trans":["adj. black; black; evil n. Black; black; black paint vt. Make it darker; apply shoe polish etc. to...; make (eye) bruised vi. Blackened n. (Black) person's name; (English, Spanish) Blake; (German, Portuguese, Czech) Braque"],"usphone":"blæk","ukphone":"blæk"},{"name":"cold","trans":["adj. cold; frigid, unenthusiastic; unconscious n. cold; cold; cold adv. wholly"],"usphone":"kəʊld","ukphone":"kəʊld"},{"name":"penguin","trans":["n. Penguin; Air Force ground crew"],"usphone":"ˈpeŋɡwɪn","ukphone":"ˈpeŋɡwɪn"},{"name":"swim","trans":["vi. swimming; floating; dipping; vertigo vt. swim past; make it float n. Swim; float; faint adj. The one you wear while swimming"],"usphone":"swɪm","ukphone":"swɪm"},{"name":"white","trans":["adj. white; white; pure n. white; white; white; white"],"usphone":"waɪt","ukphone":"waɪt"},{"name":"climb","trans":["v. Climbing; climbing; climbing; (plants growing along a wall or shelf); promotion; (road) inclination upward; climbing; climbing in (or climbing out) with effort n. Climbing; adding value; improving (position or social status); climbing (ranking); mountain (to be climbed in mountaineering or climbing); mountain trail; (of an airplane) climbing"],"usphone":"klaɪm","ukphone":"klaɪm"},{"name":"egg","trans":["n.Eggs; eggs; guys; eggs vt. Inciting; instigating n. (Egg) name; (French, English) Egg"],"usphone":"eɡ","ukphone":"eɡ"},{"name":"eight","trans":["num. Eight; eight; eighth; eight years old; eight point adj. Eight's n. 8-person rowing team"],"usphone":"eɪt","ukphone":"eɪt"},{"name":"lay","trans":["vt. Lie down; lay eggs; lay out; lay out; coat, apply adj. Secular; layman; inexperienced n. position; short poem; pattern direction; narrative poem; sexual partner vi. lay an egg; bet v. lie down; position (past tense of lie)"],"usphone":"leɪ","ukphone":"leɪ"},{"name":"silk","trans":["n.Silk; silk; silk fabric adj. Silk; silk; silk vi. (Corn) in the stage of growing whiskers n. (Silk) name; (English, Sweden) Silke"],"usphone":"sɪlk","ukphone":"sɪlk"},{"name":"spider","trans":["n. Spiders; trap setters; tripods"],"usphone":"ˈspaɪdə(r)","ukphone":"ˈspaɪdə(r)"},{"name":"chase","trans":["vt. Chase; hunt; try to win; carve vi. Chase; chase; run n. Chase; chase; chase n. (Chase) name; (English) Chase; (France) Sass"],"usphone":"tʃeɪs","ukphone":"tʃeɪs"},{"name":"dog","trans":["n. Dogs; scumbags; () friends vt. tracking; trailing"],"usphone":"dɒɡ","ukphone":"dɒɡ"},{"name":"people","trans":["n. People; humans; nations; citizens vt. live in; fill the occupancy"],"usphone":"ˈpiːpl","ukphone":"ˈpiːpl"},{"name":"sister","trans":["n. Sisters; (called like-minded people) sisters; nuns; nurses adj. sisterly; same type"],"usphone":"ˈsɪstə(r)","ukphone":"ˈsɪstə(r)"},{"name":"think","trans":["vt. Think; think; remember; imagine; plan vi. think; think n. think; think adj. ideological"],"usphone":"θɪŋk","ukphone":"θɪŋk"},{"name":"beaver","trans":["n. Beaver; Beaver fur n. (Beaver) name; (English) Beaver"],"usphone":"ˈbiːvə(r)","ukphone":"ˈbiːvə(r)"},{"name":"eagle","trans":["n. Eagle; eagle logo n. (Eagle) name; (English) Eagle"],"usphone":"ˈiːɡl","ukphone":"ˈiːɡl"},{"name":"goose","trans":["n. Goose; goose meat; fool; female goose vt. Sudden increase in throttle; booed n. (Goose) name; (German) Goose; (English) Gus"],"usphone":"ɡuːs","ukphone":"ɡuːs"},{"name":"live","trans":["v. Live; Live; Live; Live; Retain, Remember; Grow, Inhabit; Live by...; (Boat) Not Sinking; Place, Shelter; Enjoy a Wonderful Life; Experience, Live Adj. Live; live; live; live; electrified; still explosives; burning; lactic acid bacteria; currently important; effective; rotating (wheel or shaft in the machine); in a racing state; vivid, energetic n. (Live) (N., Fin, India, Russian, American, Dutch) (name of person)"],"usphone":"lɪv; laɪv","ukphone":"lɪv; laɪv"},{"name":"loon","trans":["n. [bird] diving bird; lazy person; idiot n. (Loon) name; (English, Sweden) Long"],"usphone":"luːn","ukphone":"luːn"},{"name":"moose","trans":["n. [spine] moose; [plural moose]"],"usphone":"muːs","ukphone":"muːs"},{"name":"defend","trans":["vt. Defense; defense vi. defend; defend"],"usphone":"dɪˈfend","ukphone":"dɪˈfend"},{"name":"hurt","trans":["vt. Injury; damage; cause pain; cause pain vi. Feeling pain; bad; causing pain n. Pain; Harm; cause of pain adj. injured; painful; damaged n. (Hurt) name; (German, Czech) Hut; (English) Hurt"],"usphone":"hɜːt","ukphone":"hɜːt"},{"name":"jellyfish","trans":["n. Jellyfish; [spineless] jellyfish; weak and incompetent people"],"usphone":"ˈdʒelifɪʃ","ukphone":"ˈdʒelifɪʃ"},{"name":"safe","trans":["adj. Safe; reliable; safe n. Safe; refrigerator; closet n. (Safe) name of person; (a few) Safi"],"usphone":"seɪf","ukphone":"seɪf"},{"name":"sting","trans":["n. Tingling; irony, irritation; stinging vt. Sting; driving; distressing...; making... painful vi. Stinging; being stung; feeling severe pain n. (Sting) name; (English) Sting; (German) Sting"],"usphone":"stɪŋ","ukphone":"stɪŋ"},{"name":"wasp","trans":["n. Wasps; [Kun] Wasps; Irritable people vi. Straight hit like a wasp"],"usphone":"wɒsp","ukphone":"wɒsp"},{"name":"bloom","trans":["n. Flowers; youth; vigor vt. Make it bloom; make it flourish vi. Blossoming; flourishing n. (Bloom) name; (Sweden, West) Blom; (English) Bloom"],"usphone":"bluːm","ukphone":"bluːm"},{"name":"come","trans":["vi. come; begin; appear; occur; become; arrive vt. Do; pretend; will be (... years old) int. Hi there! n. (Come) person's name; (English) Comme; (Alba) Jomey"],"usphone":"kʌm","ukphone":"kʌm"},{"name":"cycle","trans":["n. Cycle; cycle; bicycle; complete set; a period of time vt. Make a cycle; make a rotation vi. Cycling; Biking; Rotation"],"usphone":"ˈsaɪkl","ukphone":"ˈsaɪkl"},{"name":"sprout","trans":["vi. Germinate; grow shoots vt. Germinate; sprout n. Sprout; sprout; sprout; sprout n. (Sprout) person's name; (English) Sprout"],"usphone":"spraʊt","ukphone":"spraʊt"},{"name":"wait","trans":["vt. Wait; delay; delay vi. wait; delay; serve food n. Wait; wait n. (Wait) name; (English) Weite; (Czech) Weite"],"usphone":"weɪt","ukphone":"weɪt"},{"name":"fair","trans":["adj. Fair; beautiful, white; [weather] clear adv. Fairly; directly; clearly vi. Changqing n. Exhibition; Market; Beauty n. (Fair) Name; (English, Finn) Fair"],"usphone":"feə(r)","ukphone":"feə(r)"},{"name":"favorite","trans":["adj. Most loved (equal to favorite) n. The most loved person (or thing); the most promising winner (in a competition or competition); Favorite (equal to favorite) v. Add... to a favorite n. (Favorite) (US) Favourite (US) Favourite (name of person)"],"usphone":"'feɪvərɪt","ukphone":"'feɪvərɪt"},{"name":"giant","trans":["n. Giants; great people; giant animals; giant plants; big companies; (astronomical) superstars; adj. huge; giant; great"],"usphone":"ˈdʒaɪənt","ukphone":"ˈdʒaɪənt"},{"name":"painted","trans":["adj. drawn; colored; painted v. paint (past tense and past participle of paint) n. (Painted) person's name; (Sweden) Painted"],"usphone":"'peɪntɪd","ukphone":"'peɪntɪd"},{"name":"tiny","trans":["adj. Tiny; few n. (Tiny) names; (Portuguese, Indian) Tini"],"usphone":"ˈtaɪni","ukphone":"ˈtaɪni"},{"name":"wheel","trans":["n. Wheel; steering wheel; rotation vt. Rotate; change direction; install wheels for... vi. Rotation; abrupt change of direction; circling flight"],"usphone":"wiːl","ukphone":"wiːl"},{"name":"bakery","trans":["n.Bakeries"],"usphone":"ˈbeɪkəri","ukphone":"ˈbeɪkəri"},{"name":"balloon","trans":["n. Balloons; hot air balloons; large spherical wineglasses; white circles; (informal) idiot; extremely large payment at the end of the installment; (informal) big trouble v. surge; sudden weight gain; expansion; (kick the ball); travel in a hot air balloon adj. n. (Balloon) (US, India, Thailand, Russia, Pakistan) balon (name of person) that blows up like a balloon"],"usphone":"bəˈluːn","ukphone":"bəˈluːn"},{"name":"birthday","trans":["n. Birthday, birthday; day of birth"],"usphone":"ˈbɜːθdeɪ","ukphone":"ˈbɜːθdeɪ"},{"name":"game","trans":["n. Games; contests; prey adj. Brave vi. Gambling n. (Game) name; (English) Gam; (French) Gam; (West) Game"],"usphone":"ɡeɪm","ukphone":"ɡeɪm"},{"name":"party","trans":["n. Political parties, parties; parties; parties vi. Attend social gatherings"],"usphone":"ˈpɑːti","ukphone":"ˈpɑːti"},{"name":"shop","trans":["n. Store; store vt. Shopping vi. Shopping; shopping"],"usphone":"ʃɒp","ukphone":"ʃɒp"},{"name":"anywhere","trans":["Adv. anywhere; no matter where n. Anywhere"],"usphone":"ˈeniweə(r)","ukphone":"ˈeniweə(r)"},{"name":"backyard","trans":["n. Backyard; backyard"],"usphone":"ˌbækˈjɑːd","ukphone":"ˌbækˈjɑːd"},{"name":"mountain","trans":["n. Mountain; Mountain n. (Mountain) person's name; (English) Mountain"],"usphone":"ˈmaʊntən","ukphone":"ˈmaʊntən"},{"name":"ocean","trans":["n. Ocean; Massive; Broad n. (Ocean) name; (Luo) Ocian"],"usphone":"ˈəʊʃn","ukphone":"ˈəʊʃn"},{"name":"special","trans":["adj. Special; Important; Special; Special; Special; Special; Special; Special; Special (Subject) In-depth Research; Special (Education); Special (Matrix) n. Special (Event, Program, etc.); Special Price (Product); Special Offer; Special Food; Special Product; Shuttle n. (Special) (Special) (India, US, Russian) Spacia (name of person)"],"usphone":"ˈspeʃl","ukphone":"ˈspeʃl"},{"name":"build","trans":["vt. Build; build vi. architecture; construction n. Structure; body shape; physique"],"usphone":"bɪld","ukphone":"bɪld"},{"name":"cloud","trans":["n. Clouds; cloudy clouds; cloud-like objects; a large group; dark spots vt. Confuse; obscure by clouds; make melancholy; tarnish vi. Overcast; dark clouds n. (Cloud) Claude (name)"],"usphone":"klaʊd","ukphone":"klaʊd"},{"name":"empty","trans":["adj. empty; meaningless; ignorant; futile vt. Make lost; make... empty vi. become empty; empty n. Empty car; empty thing"],"usphone":"ˈempti","ukphone":"ˈempti"},{"name":"water","trans":["n. Water; seawater; rainwater; ocean, large areas of water vt. Moisten; supply water; water... vi. Adding water; crying; drooling n. (Water) person's name; (English) Water"],"usphone":"ˈwɔːtə(r)","ukphone":"ˈwɔːtə(r)"},{"name":"world","trans":["n. World; Sphere; Secular; All Humanity; Material Life"],"usphone":"wɜːld","ukphone":"wɜːld"},{"name":"built","trans":["v. Build, build; gradually enhance; embed (wall, object, etc.) (past tense and past participle of build) adj. Those with... physique; those with a beautiful body;... built"],"usphone":"bɪlt","ukphone":"bɪlt"},{"name":"flatten","trans":["vt. Defeat, destroy; flatten... vi. Become flat; become monotonous n. (Flatten) person's name; (German) Flatten"],"usphone":"ˈflætn","ukphone":"ˈflætn"},{"name":"gravel","trans":["n. Gravel; gravel vt. Use gravel shops; land the boat on the beach; confuse n. (Gravel) people's names; (English, French, Spanish) Gravel"],"usphone":"ˈɡrævl","ukphone":"ˈɡrævl"},{"name":"paint","trans":["n. Paint; paint; (informal) makeup; three-second zone; painting function (especially simulating real painting effects); flower horse v. paint; apply makeup (face, skin); apply (liquid) to...; paint with a drawing program; display (aircraft, etc.) (on a radar screen); paint (picture); describe n. (Paint) (US) Pan (name of person)"],"usphone":"peɪnt","ukphone":"peɪnt"},{"name":"pave","trans":["v. Paving (road) (with slate or brick), paving, paving; paving the way for something and creating conditions n. (Pave) (France, Serbia, Croatia) Pave (name of person)"],"usphone":"peɪv","ukphone":"peɪv"},{"name":"spread","trans":["vi. Spread; stretch vt. Spread; spread; expand; spread n. Disseminate; stretch adj. stretching"],"usphone":"spred","ukphone":"spred"},{"name":"busy","trans":["adj. Busy; lively; occupied vt. Busy n. (Busy) name; () Busy; (France) Bissey"],"usphone":"ˈbɪzi","ukphone":"ˈbɪzi"},{"name":"number","trans":["n. Numbers; periods (magazines, etc.); numbers; numbers; arithmetic vi. Included; total reached vt. Number; count; number...; limit the number"],"usphone":"ˈnʌmbə(r)","ukphone":"ˈnʌmbə(r)"},{"name":"picture","trans":["n. Photographs, pictures; videos; scenery; avatars vt. painting; imagining; describing"],"usphone":"ˈpɪktʃə(r)","ukphone":"ˈpɪktʃə(r)"},{"name":"snack","trans":["n. Snacks, snacks; fast food; easy to do, small things v. Eat snacks (or fast food, snacks)"],"usphone":"snæk","ukphone":"snæk"},{"name":"story","trans":["n. Story; novel; description; news report; origin; false story; layer; a unit of measurement (1 story equals 3.3 meters) vt. Decorate with historical story paintings vi. Lying n. (Story) Story (person name)"],"usphone":"ˈstɔːri","ukphone":"ˈstɔːri"},{"name":"hexagon","trans":["n. Hexagon, hexagon adj. hexagonal; six-sided"],"usphone":"ˈheksəɡən","ukphone":"ˈheksəɡən"},{"name":"oval","trans":["adj. oval; oval n. oval; oval n. (Oval) name; (French) Orval"],"usphone":"ˈəʊvl","ukphone":"ˈəʊvl"},{"name":"rectangle","trans":["n. Rectangular; rectangular"],"usphone":"ˈrektæŋɡl","ukphone":"ˈrektæŋɡl"},{"name":"shape","trans":["n. Shape; Model; Body; Concretization vt. Form; shape, shape; conform to vi. Form; shape; grow n. (Shape) person's name; (Sweden) Sharpe"],"usphone":"ʃeɪp","ukphone":"ʃeɪp"},{"name":"square","trans":["adj. square; square; right angle; straight vt. Make a square; consistent with... vi. Consistent; square n. Square; Square; square adv. Narukaigakuji"],"usphone":"skweə(r)","ukphone":"skweə(r)"},{"name":"triangle","trans":["n. Triangles (shapes); triangular relationships; triangular objects; groups of three"],"usphone":"ˈtraɪæŋɡl","ukphone":"ˈtraɪæŋɡl"},{"name":"shark","trans":["n. Sharks; crooks vi. Fraud vt. extortion"],"usphone":"ʃɑːk","ukphone":"ʃɑːk"},{"name":"sharp","trans":["adj. Drastic; sharp; intense; agile; harsh adv. sharply; sharply; abruptly n. pointed vt. Speed up; raise the pitch vi. Play n. (Sharp) person's name; (English) Sharp"],"usphone":"ʃɑːp","ukphone":"ʃɑːp"},{"name":"spots","trans":["n. Spots (plural of spots); broadcast advertisements; flower dot cloth, patterned cotton cloth; ball point"],"usphone":"spɒts","ukphone":"spɒts"},{"name":"stripes","trans":["n. Striped cloth; striped cloth (stripe plural form) v. Add stripes to... (three single forms of stripe)"],"usphone":"st'raɪps","ukphone":"st'raɪps"},{"name":"teeth","trans":["n. Teeth"],"usphone":"tiːθ","ukphone":"tiːθ"},{"name":"Easter","trans":["n. Easter"],"usphone":"ˈiːstə(r)","ukphone":"ˈiːstə(r)"},{"name":"find","trans":["vt. Find, find; discover; think; feel; obtain vi. ruling n. Find n. (Find) person's name; (Dan) Finn"],"usphone":"faɪnd","ukphone":"faɪnd"},{"name":"pot","trans":["n. Pot; pot; can vt. Canning...; Shoot; Abbreviate vi. Shoot n. (Pot) person's name; (card) Bout; (Czech) Potter; (France) Wave"],"usphone":"pɒt","ukphone":"pɒt"},{"name":"rake","trans":["n. Rake, target; prodigal; inclination (especially of a theater stage); front blade surface (of a cutting tool); bus cabin v. raking with a rake; shooting; searching; scratching (with branches or fingernails); (with a rake) to slant (the mast or chimney) towards the stern of the stern; determining the degree of inclination (especially of the stage) n. (Rake) (American, Indian) Lake (name of person)"],"usphone":"reɪk","ukphone":"reɪk"},{"name":"swing","trans":["v. Swing; hang; jump; rotate; rotate (on the axis); move (boat, plane) to all positions; (abruptly) turn; walk with a big swing; hang; walk; walk; jump; throw at...; fly (cricket) sideways; change (mood or opinion); gain; have a decisive influence on...; successfully completed; strong sense of rhythm n. Swing; swing; rhythm; light action (cricket) Side flying ball; (politician) A trip with multiple stays; hitting; ups and downs adj. Strong rhythm jazz music; decisive n. (Swing) (American, Swedish, English), Swain (personal name)"],"usphone":"swɪŋ","ukphone":"swɪŋ"},{"name":"driver","trans":["n. Driver; Driver; Driver; Transmission n. (Driver) Name; (German) Driver; (English) Driver"],"usphone":"ˈdraɪvə(r)","ukphone":"ˈdraɪvə(r)"},{"name":"elephant","trans":["n. Elephant; large drawing paper"],"usphone":"ˈelɪfənt","ukphone":"ˈelɪfənt"},{"name":"laugh","trans":["v. Laugh, make a laugh; laugh and say n. Laugh (sound); something or person that makes you laugh"],"usphone":"lɑːf","ukphone":"lɑːf"},{"name":"tire","trans":["v. Fatigue, tiredness; boredom, boredom n. Tires; headdress (same as tyre) n. (Tire) (French, Russian, Turkey) Tyre (person's name)"],"usphone":"ˈtaɪə(r)","ukphone":"ˈtaɪə(r)"},{"name":"wash","trans":["v. washing; bathing; washable; scrubbing; washing; washing; slapping; soaking; (emotional) shock; washing; washing; painting; standing; eroding n. Washing; waves (left after a boat or plane has passed); sound of waves; thin coating; soap; clothes to be washed; alluvium; scum; form (unbeneficial to both parties); (the Wash) Wash Bay n. (Wash) (American) Wash (name of person)"],"usphone":"wɒʃ","ukphone":"wɒʃ"},{"name":"window","trans":["n. window; window; window"],"usphone":"ˈwɪndəʊ","ukphone":"ˈwɪndəʊ"},{"name":"corn","trans":["n. (US) corn; (English) grains; [skin] corns vt. Marinate; granulate n. (Corn) person's name; (English, French, Swedish) Cohn"],"usphone":"kɔːn","ukphone":"kɔːn"},{"name":"frost","trans":["n. Cold weather, frozen; frosty; frosty; (informal) failure v. Frosting to; frosting; freezing, freezing; sprinkling icing on... n. (Frost) (England, US, Germany) Frost (name of person)"],"usphone":"frɒst","ukphone":"frɒst"},{"name":"grass","trans":["n. Grass; grass, lawn vt. Graze; make... grow grass; make... eat grass vi. Long grass n. (Grass) name; (French, German, Russian, Swedish, English) Glass"],"usphone":"ɡrɑːs","ukphone":"ɡrɑːs"},{"name":"leaves","trans":["n. Leaves, leaves; petals; (paper) pages, sheets; thin sheet of metal; movable table, folding table; fan (window, door, etc.); inside (or outside) of a hollow wall (plural of leaf) v. leave; let... leave (3rd person singular of leave)"],"usphone":"liːvz","ukphone":"liːvz"},{"name":"moon","trans":["n. Moon; Moon; Moonlight; Satellites vi. Laid-back; astonished vt. Hudu n. (Moon) name; (Sweden) Meng; () Meng; (English) Moon; (Myanmar) Meng"],"usphone":"muːn","ukphone":"muːn"},{"name":"pumpkin","trans":["n.Pumpkin"],"usphone":"ˈpʌmpkɪn","ukphone":"ˈpʌmpkɪn"},{"name":"apple","trans":["n. An apple, an apple tree, something like an apple; [American] bombs, grenades, (baseball) balls; [American] people, guys."],"usphone":"ˈæpl","ukphone":"ˈæpl"},{"name":"beet","trans":["n.Beets; beetroot vt. Start a fire; repair; change"],"usphone":"biːt","ukphone":"biːt"},{"name":"cabbage","trans":["n. Cabbage, cabbage, cabbage; () head; (informal, insulting) plant people (commonly used in British English); () money, especially banknotes (commonly used in American slang)"],"usphone":"ˈkæbɪdʒ","ukphone":"ˈkæbɪdʒ"},{"name":"fall","trans":["v. Falling; falling; sagging; kneeling; falling down (ground); falling (in quantity, etc.); falling (rain or snow); falling; falling (in a certain state); falling; falling (of snow, rock, etc.); falling (in quantity, etc.); fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; collapse, decay adj. n. (Fall) (West) Fowler (name of person) of autumn"],"usphone":"fɔːl","ukphone":"fɔːl"},{"name":"food","trans":["n. Food; nutrients"],"usphone":"fuːd","ukphone":"fuːd"},{"name":"pear","trans":["n. [Horticulture] Pear Tree; Pear n. (Pear) Name; (English) Peel"],"usphone":"peə(r)","ukphone":"peə(r)"},{"name":"potato","trans":["n. [crop] potato, [crop] potato"],"usphone":"pəˈteɪtəʊ","ukphone":"pəˈteɪtəʊ"},{"name":"ripe","trans":["adj. Ripe, ripe; ripe n. Ripe (Swedish name)"],"usphone":"raɪp","ukphone":"raɪp"},{"name":"carve","trans":["vt. Carve; cut; create vi. Cut; carving work n. (Carve) person's name; (West, Sweden) Carve"],"usphone":"kɑːv","ukphone":"kɑːv"},{"name":"pick","trans":["vi. Picking; picking; digging vt. Picking; selecting; picking; excavating n. Select; Crane Hoe; Digging; Covering n. (Pick) person's name; (English, French, German, Czech, German, Czech, Swedish, Swedish) Pique"],"usphone":"pɪk","ukphone":"pɪk"},{"name":"roasted","trans":["adj. grilled v. hot simmering (past participle of roast)"],"usphone":"'rəʊstɪd","ukphone":"'rəʊstɪd"},{"name":"angry","trans":["adj. Angry; angry; furious; (wounds, etc.) inflamed"],"usphone":"ˈæŋɡri","ukphone":"ˈæŋɡri"},{"name":"feelings","trans":["n. [physiological] feeling; [psychological] emotion; opinion (plural of feeling)"],"usphone":"'fi:liŋs","ukphone":"'fi:liŋs"},{"name":"happy","trans":["adj. Happy; happy; clever n. (Happy) names; (English, Swedish, Ka) Happy"],"usphone":"ˈhæpi","ukphone":"ˈhæpi"},{"name":"sad","trans":["adj. sad; sad, sad; miserable, gloomy (describe color)"],"usphone":"sæd","ukphone":"sæd"},{"name":"scared","trans":["adj. Scared v. makes afraid (past participle of scare)"],"usphone":"skeəd","ukphone":"skeəd"},{"name":"sometimes","trans":["Adv. Sometimes, intermittently or"],"usphone":"ˈsʌmtaɪmz","ukphone":"ˈsʌmtaɪmz"},{"name":"candle","trans":["n. Candles; candlelight; candle-shaped objects vt. Check against light"],"usphone":"ˈkændl","ukphone":"ˈkændl"},{"name":"festival","trans":["n. Festivals; celebrations, commemorations; joy adj. festive, festive; happy"],"usphone":"ˈfestɪvl","ukphone":"ˈfestɪvl"},{"name":"Hanukkah","trans":["n. Hanukah (Jewish holiday, equivalent to Chanukah)"],"usphone":"ˈhænʊkə; ˈxænʊkə","ukphone":"ˈhænʊkə; ˈxænʊkə"},{"name":"light","trans":["n. Light; light; lamp; lighter; understanding; light color; sunroof adj. Light; light-colored; bright; relaxed; easy; light vi. Light; brighten; ignite vt. Illuminate; ignite; ignite adv. Lightly; clearly; lightly n. (Light) (English) Wright (personal name)"],"usphone":"laɪt","ukphone":"laɪt"},{"name":"middle","trans":["adj. middle, middle; intermediate, medium n. middle, center; waist"],"usphone":"ˈmɪdl","ukphone":"ˈmɪdl"},{"name":"night","trans":["n. Night, night; dark, dark adj. At night, at night"],"usphone":"naɪt","ukphone":"naɪt"},{"name":"duck","trans":["n. Duck; duck meat; (English) baby; zero point vi. Evade; submerge in water vt. Dodge; press... to enter the water n. (Duck) name; (German, Portuguese,) Duke"],"usphone":"dʌk","ukphone":"dʌk"},{"name":"in","trans":["prep. In...; in...; in...; during...; in...; in...; in...; included in...; engaged in...; engaged...; used in... language, with... medium; in the process of (activity); in... years; when...; (derives the name of a person with a certain quality); in... (used between larger and lesser numbers); in... quantity; in... color; in... manner; has characteristics; according to (representation) adv. Entering; inside; arriving; elected; high tide; in the house; at the station; receiving; submitting, delivering; filling in, coloring; facing inward, in the middle; hitting; (ball) falling within the boundary; (clothing, etc.) fashionable adj. Inside; fashionable; n. rulers within the (ball) world; doorway"],"usphone":"ɪn; ˈɪn ðət","ukphone":"ɪn; ˈɪn ðət"},{"name":"man","trans":["n. Man; man; human; husband; employee vt. Manipulate; assign personnel to...; strengthen courage; take place in... n. (Man); (Russian) Man; (English, Portuguese, Italy, Luo, Czech, Nepal, Lao, Myanmar, Kim); (Japan) 10,000 (names)"],"usphone":"mæn","ukphone":"mæn"},{"name":"pig","trans":["n. Pigs; pork vi. Give birth to a little pig; live like a pig n. Police (slang, aggressive)"],"usphone":"pɪɡ","ukphone":"pɪɡ"},{"name":"woman","trans":["n. Women; women; adult women"],"usphone":"ˈwʊmən","ukphone":"ˈwʊmən"},{"name":"ate","trans":["v. eat (past tense of eat)"],"usphone":"et; eɪt","ukphone":"et; eɪt"},{"name":"play","trans":["vt. Game; play; play; compete with... vi. Play; play; perform; participate in contests n. Games; Contest; Screenplay n. (Play) Name of person; (France, Sweden) Play"],"usphone":"pleɪ","ukphone":"pleɪ"},{"name":"ran","trans":["v. Run (past tense of run) n. (Ran) person's name; (Russian, Sweden, Ser) Ran; ()"],"usphone":"ræn","ukphone":"ræn"},{"name":"read","trans":["vt. Read; read, understand vi. Read; read it up n. Read; book adj. An educated n. (Read) name; (English) Reed"],"usphone":"riːd","ukphone":"riːd"},{"name":"sat","trans":["v. sit (past tense of sit, past participle) n. (Sat) person's name; (Chinese) Sa (Cantonese, Waitama); (Indian) Sa; (India) Sath"],"usphone":"sæt","ukphone":"sæt"},{"name":"slept","trans":["vi. sleep (past tense and past participle of sleep)"],"usphone":"slept","ukphone":"slept"},{"name":"chug","trans":["vi. Make a rolling sound; make a crackling sound; make a rolling sound; move forward n. (US) rolling"],"usphone":"tʃʌɡ","ukphone":"tʃʌɡ"},{"name":"float","trans":["v. Float, float; drift; float; drift; arrange (loan) for consideration (idea or plan); issue (stock) listing; implement (currency exchange rate) free floating (currency exchange rate); spare change (used by bars, etc. to find change for customers); floats, floats; floats; drinks with ice cream; floats; drinks with ice cream; floating period; sitting in a floating box (treatment of illness, healing, or relaxation); lifebuoy n. (Float) (US, UK, Germany) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Person's name)"],"usphone":"fləʊt","ukphone":"fləʊt"},{"name":"pedal","trans":["n. Pedals (of vehicles, musical instruments) v. Riding (bicycles); pedaling adj. Of the foot; of the foot"],"usphone":"ˈpedl","ukphone":"ˈpedl"},{"name":"rocket","trans":["n. Rockets; rocket weapons; fireworks; arugula; (informal) severe reprimand v. Rapid increase; rapid movement; rapid success; attack with rocket weapons; delivery with rockets"],"usphone":"ˈrɒkɪt","ukphone":"ˈrɒkɪt"},{"name":"sail","trans":["vi. Sailing; setting sail, setting sail n. Sail, tent; sailing vt. voyages"],"usphone":"seɪl","ukphone":"seɪl"},{"name":"zoom","trans":["v. (In particular, cars, airplanes, etc.) rapid growth; (price, cost, etc.) rapid increase; (making the lens or camera) move closer or farther away n. (vehicle, etc.) speeding sound, hum; zoom photography; rapid rise int. (Used to indicate sudden rapid movement) Whistling"],"usphone":"zuːm","ukphone":"zuːm"},{"name":"froglet","trans":["n. Young frogs; small frogs"],"usphone":"ˈfrɒɡlət","ukphone":"ˈfrɒɡlət"},{"name":"tadpole","trans":["n. tadpole"],"usphone":"ˈtædpəʊl","ukphone":"ˈtædpəʊl"},{"name":"tail","trans":["n. Tails; trails; braids; tuxedo vt. Trailing; attaching the tail vi. Track; reduce or decrease adj. coming from behind; tail"],"usphone":"teɪl","ukphone":"teɪl"},{"name":"four","trans":["num. Four, four n. A group of four people (or things); (cricket) one hit in four; (clothes, etc.) number four; four-point cards; four-bar rowing, four-person rowing team adj. Four; four n. (Four) (French, US) Faure (personal name)"],"usphone":"fɔː(r)","ukphone":"fɔː(r)"},{"name":"move","trans":["v. Move; Change; Progress; Act; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move; Move"],"usphone":"muːv","ukphone":"muːv"},{"name":"one","trans":["num. One; one; one year old; one hour pron. A person; any person, people (general term); that person; that kind of person (specified) det. one (emphasizes someone or something); one (for a more similar person or thing); some (before the name of someone you don't know) adj. unique; one n. 1; one dollar note n. (One) (India, Malaysia, US) Wen (name of person)"],"usphone":"wʌn","ukphone":"wʌn"},{"name":"three","trans":["n. Three, three num. Three adj. Three, three"],"usphone":"θriː","ukphone":"θriː"},{"name":"two","trans":["n. Two adj. Two nums. two"],"usphone":"tuː","ukphone":"tuː"},{"name":"five","trans":["n. Five, five; five dollar bill num. Five, five adj. Five's; five n. (five) names; () Fifer"],"usphone":"faɪv","ukphone":"faɪv"},{"name":"nine","trans":["n. Nine, nine num. Nine; nine adj. Nine, nine n. (Nine) names; (Sai) Niney"],"usphone":"naɪn","ukphone":"naɪn"},{"name":"seven","trans":["num. Seven, seven n. Seven people; seven o'clock; seven-year-old adj. Seven; seven n. (Seven) (Turkish, French, Russian), Xie Wen (personal name)"],"usphone":"ˈsevn","ukphone":"ˈsevn"},{"name":"six","trans":["num. Number 6; six; a group of six people (or things); six years old; six o'clock n. (six) (American, German) six (name)"],"usphone":"sɪks","ukphone":"sɪks"},{"name":"cheetah","trans":["n. [spine] cheetah"],"usphone":"ˈtʃiːtə","ukphone":"ˈtʃiːtə"},{"name":"meek","trans":["adj. docile; humble; tame n. (Meek) name; (English) Mick"],"usphone":"miːk","ukphone":"miːk"},{"name":"peacock","trans":["n. Peacocks; male peacocks; people who love vanity vi. Show off; walk with vigor n. (Peacock) name; (English) Peacock"],"usphone":"ˈpiːkɒk","ukphone":"ˈpiːkɒk"},{"name":"proud","trans":["adj. Proud; proud; conceited; prominent n. (Proud) name; (English) Proud"],"usphone":"praʊd","ukphone":"praʊd"},{"name":"silent","trans":["adj. silent; silent; unrecorded n. Silent film"],"usphone":"ˈsaɪlənt","ukphone":"ˈsaɪlənt"},{"name":"slug","trans":["n. Slugs; people who move slowly; small pieces of metal vi. Lazy; slow movement vt. whack"],"usphone":"slʌɡ","ukphone":"slʌɡ"},{"name":"closet","trans":["n. Closets; conference rooms, secret rooms; small rooms adj. Secret, private; empty talk vt. Lock... in a private room n. (Closet) person's name; (France) Clause"],"usphone":"ˈklɒzɪt","ukphone":"ˈklɒzɪt"},{"name":"everywhere","trans":["Adv. everywhere n. Everywhere"],"usphone":"ˈevriweə(r)","ukphone":"ˈevriweə(r)"},{"name":"look","trans":["vt. Look; expect; pay attention; aim; look like vi. Look; look; pay attention; look at n.; look; face n. (Look) name; (Sweden) Locke; (English) Luke"],"usphone":"lʊk","ukphone":"lʊk"},{"name":"shoe","trans":["n. Shoes; horseshoes; outer tube vt. Put on... shoes; wear... shoes n. (Shoe) name of person; (English) Hugh"],"usphone":"ʃuː","ukphone":"ʃuː"},{"name":"under","trans":["prep. Below...; below the surface; behind...; (position, rank) below; younger than...; controlled by; according to; in the process; influenced by; endured; under (a word); under...; under (a system); during...; under... living conditions; planted; during...; under... living conditions; planted; during...; while in power; working under... adv. below; under water; less than; younger; in a coma; adj. lower; below"],"usphone":"ˈʌndə(r)","ukphone":"ˈʌndə(r)"},{"name":"hunt","trans":["v. Hunting; searching; hunting; (UK) fox hunting; hunting with (horses and hounds) (especially fox or deer hunting); hunting with dogs (or horses); hunting (animals); (animal) hunting); (machine, instrument pin, or system) swinging; (aircraft or rocket) swinging irregularly n. Searching; hunting; (UK) foxhunting activities; hunting teams (where foxhunting is often held in the United Kingdom); hunting groups; hunting grounds; hunting grounds; hunting n. (American) (American) (American name))"],"usphone":"hʌnt","ukphone":"hʌnt"},{"name":"jump","trans":["v. Jumping; crossing; moving fast; surging, skyrocketing; abrupt change; omitting; running a red light; raid; having sex; boosting starting (vehicle) n. Jump; skyrocket; drastic change; shock jump; obstacle (in an equestrian game); (bridge) jumping; sexual intercourse n. (Jump) (US) Jiang Pu (name of person)"],"usphone":"dʒʌmp","ukphone":"dʒʌmp"},{"name":"movies","trans":["n. (US) [movie] movie (plural of movie)"],"usphone":"mu:vɪz","ukphone":"mu:vɪz"},{"name":"purr","trans":["n. Purring sound; (cat's) whining; (machine, etc.) fluttering sound vi. It makes a sound in the throat; the cat whines vt. Make a whisper; say n. (Purr) person's name with satisfaction; (German, Czech) Poole"],"usphone":"pɜː(r)","ukphone":"pɜː(r)"},{"name":"scratch","trans":["n. Abrasion; scratches; scratchy sound; graffiti adj. For drafting; coincidental; coincidental vt. Grab; scrape; dig out; paint vi. Catch; kick; scrape; barely make ends meet; quit the game"],"usphone":"skrætʃ","ukphone":"skrætʃ"},{"name":"stretch","trans":["v. stretching (soft or elastic); stretching; (making) excessive extension; (capital, resources) sufficient; extensive requirements; (making) maximum use (ability); exaggerating; continuing n. (limb or body) stretching; (muscle) stretching; stretching (of materials or clothing); difficult tasks; continuous stretch (of land or water); (time) continuous; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) lengthened motor vehicle adj. Elastic, stretchable n. (Stretch) (US) Strage (name of person)"],"usphone":"stretʃ","ukphone":"stretʃ"},{"name":"book","trans":["n. Books; Volumes; Books of Accounts; Roster; Workbooks vt. Reservation; registration n. (Book) name; (Chinese) Bu (Cantonese, Waitama); (North); (English) Booker; (Sweden) Bock"],"usphone":"bʊk","ukphone":"bʊk"},{"name":"mask","trans":["n. Mask; mask; disguise vi. Disguise; wear a mask; dress up vt. disguise; wear a mask; blur"],"usphone":"mɑːsk","ukphone":"mɑːsk"},{"name":"scary","trans":["adj. (thing) scary; scary; scary; (person) fearful; alarmed; timid"],"usphone":"ˈskeəri","ukphone":"ˈskeəri"},{"name":"song","trans":["n. Song; Singing; Poetry; Sound n. (Song) Name; (Thai) Song; (Chinese) Song; (English) Song; (Old) Song; (Yue) Shuang; (Southeast Asian Chinese) Song"],"usphone":"sɒŋ","ukphone":"sɒŋ"},{"name":"watch","trans":["vt. Observe; Watch; Watch; Watch; Watch; Watch; Watch; Watch; Watch; Watchman vi. Watch, watch; guard, guard"],"usphone":"wɒtʃ","ukphone":"wɒtʃ"},{"name":"lots","trans":["n. Many, many; a bunch; destiny (plural of lot) adv. Very, very v. lottery; grouping; dividing (land) into blocks (in the form of three lots)"],"usphone":"lɒts","ukphone":"lɒts"},{"name":"sheep","trans":["n. Sheep, sheep; cowards"],"usphone":"ʃiːp","ukphone":"ʃiːp"},{"name":"sleep","trans":["vi. Sleep n. Sleep n. Sleep n. (Sleep) person's name; (English) Sleep"],"usphone":"sliːp","ukphone":"sliːp"},{"name":"wonder","trans":["v. Wanting to know; not knowing (when asking); being puzzled; surprised; amazed n. Surprised; miracles; capable people; something with special effects adj. Excellent, spiritual; amazing n. (Wonder) (US) Wonder (name of person)"],"usphone":"ˈwʌndə(r)","ukphone":"ˈwʌndə(r)"},{"name":"form","trans":["n. Form, shape; form, appearance; form; table vt. Composition, composition; arrangement, organization; generation, shaping vi. Formation, composition; arrangement n. (Form) names; (English) Form; (France, Germany) Forum"],"usphone":"fɔːm","ukphone":"fɔːm"},{"name":"freeze","trans":["v. (Freezing), freezing; severe cold; freezing (water pipes, etc.); freezing, refrigerating; astonishing; freezing; freezing (account); stiffness n. Freezing; stopping; freezing period, severe cold period; frost n. (Freeze) (US) Freeze (name of person)"],"usphone":"friːz","ukphone":"friːz"},{"name":"ice","trans":["n. Ice; ice cream; restraint; () diamond vt. Ice; freeze vi. freezing adj. Ice's n. (Ice) name; (English) Ace; (French) Ice"],"usphone":"aɪs","ukphone":"aɪs"},{"name":"slippery","trans":["adj. slippery; cunning; unstable"],"usphone":"ˈslɪpəri","ukphone":"ˈslɪpəri"},{"name":"wet","trans":["adj. [Meteorology] [Object] Humid; rainy n. Rainy days; humidity vt. Get wet vi. Wet n. (Wet) person's name; (English, Nano, South Africa) Wete"],"usphone":"wet","ukphone":"wet"},{"name":"chicken","trans":["n. Chicken; chick; coward, coward adj. Chicken's; timid; young"],"usphone":"ˈtʃɪkɪn","ukphone":"ˈtʃɪkɪn"},{"name":"pork","trans":["n. Pork vt. Name of person who had sex with a woman n. (Pork); (Russian) Polk"],"usphone":"pɔːk","ukphone":"pɔːk"},{"name":"salmon","trans":["n. Salmon; salmon; salmon color; salmon meat; orange-red, pink-orange adj. Light orange"],"usphone":"ˈsæmən","ukphone":"ˈsæmən"},{"name":"same","trans":["adj. The same; the same; the one described above (usually used in conjunction with the); no change in pron. The same thing or person (usually used in conjunction with the) adv. Also (usually used in conjunction with the) n. (Same) person's name; (Italian) Sameh"],"usphone":"seɪm","ukphone":"seɪm"},{"name":"tuna","trans":["n. Tuna, tuna n. (Tuna) name; (Portuguese, Dutch, Czech, Turkish, Sai) Tuna"],"usphone":"ˈtjuːnə","ukphone":"ˈtjuːnə"},{"name":"color","trans":["n. Color; skin tone; pigment; face color vt. Whitewash; color...; distort vi. changes color; acquires color"],"usphone":"ˈkʌlə(r)","ukphone":"ˈkʌlə(r)"},{"name":"insect","trans":["n.Insects; scumbags"],"usphone":"ˈɪnsekt","ukphone":"ˈɪnsekt"},{"name":"ladybug","trans":["n.Ladybugs"],"usphone":"'leɪdɪbʌg","ukphone":"'leɪdɪbʌg"},{"name":"clothes","trans":["n. Clothes"],"usphone":"kləʊðz; kləʊz","ukphone":"kləʊðz; kləʊz"},{"name":"learn","trans":["vt. Learn; Learn; Recognize vi. Learn; learn"],"usphone":"lɜːn","ukphone":"lɜːn"},{"name":"newspaper","trans":["n. Newspapers Newspapers Old newspapers"],"usphone":"ˈnjuːzpeɪpə(r)","ukphone":"ˈnjuːzpeɪpə(r)"},{"name":"past","trans":["adj. past, past, past; past; just past, just ended; (verb) past tense; completed, ended n. Past, past; past, past; (someone) past experience (or career); (grammar) past tense, past tense (of verb) prep. Pass by; pass by; (refers to an hour), after...; further away from..., on the other side; more than, over, over adv. pass, pass, from side to side; (time) pass, pass; exceed; later, after (after a certain period of time from a known hour)"],"usphone":"pɑːst","ukphone":"pɑːst"},{"name":"photo","trans":["n. Photos"],"usphone":"ˈfəʊtəʊ","ukphone":"ˈfəʊtəʊ"},{"name":"clang","trans":["n. Clinging sounds; loud noises vi. Make a loud voice vt. Name of person who made a loud voice n. (Clang); (French) krona"],"usphone":"klæŋ","ukphone":"klæŋ"},{"name":"crash","trans":["v. Collision; (causing) crashing; (causing) crashing; making a loud noise; (financial enterprise, etc.) going bankrupt; (machine, system, etc.) crashing; losing (during a game); falling asleep (in a temporarily arranged place); heart stops beating; unauthorized entry n. (vehicle) crashes; collision sound; collapse (of a machine, system); sleeping; cheesecloth adj. Emergency, quick advs. loudly"],"usphone":"kræʃ","ukphone":"kræʃ"},{"name":"ding","trans":["v. jingling; blows, impacts (car or head); obsessively speaking, repeatedly saying n. (informal) dents; (jingling) sounds; (jingling) bells; (informal) lively gatherings int. Ding Dang (used to imitate a metal sound like a bell) n. (Ding) (English, Canada, Australia) Ding (personal name)"],"usphone":"dɪŋ","ukphone":"dɪŋ"},{"name":"plop","trans":["n. Fluttering (of an object falling into water); sound of falling v. fluttering; putting... in (especially liquid) with a fluttering sound; sit down heavily and lie down adv. Fluttering n. (Plop) (Romania, Moldova, Russia) Plop (personal name)"],"usphone":"plɒp","ukphone":"plɒp"},{"name":"rip","trans":["vt. Tear; saw vi. Cracked, torn n. Fissure, fissure n. (Rip) person's name; (Sai) Rip"],"usphone":"rɪp","ukphone":"rɪp"},{"name":"whoosh","trans":["vi. Move fast; hisses vt. Move int rapidly. whistling; (sounds made by speeding, etc.) n. hissing; moving fast"],"usphone":"wʊʃ; wuːʃ","ukphone":"wʊʃ; wuːʃ"},{"name":"blender","trans":["n. (US) mixer; blender; mixture n. (Blender) name; (English) Blender"],"usphone":"ˈblendə(r)","ukphone":"ˈblendə(r)"},{"name":"dry","trans":["adj. Dry; thirsty; boring and tasteless; prohibited vt. Dry... vi. Dry n. Dry n. (Dry) person's name; (France) Delhi"],"usphone":"draɪ","ukphone":"draɪ"},{"name":"make","trans":["vt. Make; carry out; arrange, prepare, organize; manufacture; think; obtain; form; arrange; cause; constitute vi. Start; advance; grow; be made n. Manufactured; structure; temperament n. (Make) person's name; (Sai, South Africa) Mark"],"usphone":"meɪk","ukphone":"meɪk"},{"name":"board","trans":["n. Board of directors; boards; decks; meals vt. Onboard (plane, car, boat, etc.); cover with a board; provide accommodation vi. Boarding n. (Board) name; (English, Spanish) Bode"],"usphone":"bɔːd","ukphone":"bɔːd"},{"name":"drum","trans":["n. Drums; drums; drums; drums (on the machine); drums; drummer; bag; (informal) house, one suite; (informal) brothel; inside news; afternoon tea; mountain ridges v. drumming; nonstop knocking; (woodpecker) pecking rapidly with the mouth; messaging...; vigorously fighting for n. (Drum) (American, Russian, Australian, etc.) drum (name of person)"],"usphone":"drʌm","ukphone":"drʌm"},{"name":"horn","trans":["n. Speaker, horn; horn vt. Cast in the name of n. (Horn); (English, German, Czech, Luo, Bo, Finn, Sey, Sweden) Horn; (France) Orne; (Original) Hong"],"usphone":"hɔːn","ukphone":"hɔːn"},{"name":"pluck","trans":["v. Picking; plucking; plucking (dead bird's hair); slapping (instrument strings); rescuing; snatching; pulling (eyebrows) to keep clean; gathering courage; (glacier ice) extracting n. Courage; internal organs (for food); pulling quickly and violently"],"usphone":"plʌk","ukphone":"plʌk"},{"name":"rattle","trans":["vt. Make a gurgle sound; talk incessantly; cause panic, make you panic vi. Talk incessantly; make a clicking sound n. A person who talks incessantly; creaking, loud n. (Rattle) person's name; (English) Rattle"],"usphone":"ˈrætl","ukphone":"ˈrætl"},{"name":"strum","trans":["v. Play (guitar, etc.); play n. Play casually; play n. (Strum) (US) Strum (person's name) at once"],"usphone":"strʌm","ukphone":"strʌm"},{"name":"chips","trans":["n. [Food] Fried potato sticks; small wooden chips; round chips (used for betting); gaps (plural form of chips)"],"usphone":"tʃɪps","ukphone":"tʃɪps"},{"name":"cilantro","trans":["n.Coriander leaves; coriander"],"usphone":"sɪˈlæntrəʊ","ukphone":"sɪˈlæntrəʊ"},{"name":"onion","trans":["n.Onions; onion heads"],"usphone":"ˈʌnjən","ukphone":"ˈʌnjən"},{"name":"pepper","trans":["n. pepper; cayenne pepper; pepper vt. Add pepper to; cover n. (Pepper) with name; (English, German, Italian) pepper"],"usphone":"ˈpepə(r)","ukphone":"ˈpepə(r)"},{"name":"salsa","trans":["n. Spicy sauce made from onions; salsa dance vi. Salsa dancing n. (Salsa) name; (Italian, Portuguese) salsa"],"usphone":"ˈsælsə","ukphone":"ˈsælsə"},{"name":"tomato","trans":["n.Tomato, tomato"],"usphone":"təˈmɑːtəʊ","ukphone":"təˈmɑːtəʊ"},{"name":"dinosaur","trans":["n. Dinosaurs; people or things that are out of date or outdated"],"usphone":"ˈdaɪnəsɔː(r)","ukphone":"ˈdaɪnəsɔː(r)"},{"name":"head","trans":["n. Head; headache; upper end; front part; comprehension vt. Move forward; use the top of your head; be the leader of...; stand in front of...; title... vi. Departure; end up; boat sails to adj. Head; main; n. (Head) name at the top; (English) Head"],"usphone":"hed","ukphone":"hed"},{"name":"kind","trans":["n. Type; nature adj. Kind; forgiving; grateful n. (Kind) name; (German, Russian, French, Czech); (Sweden) Sinde"],"usphone":"kaɪnd","ukphone":"kaɪnd"},{"name":"boil","trans":["v. Boil, (bring) to a boil, reach the boiling point; cook with boiling water or iron; cook...; stir; ignite n. Boiling point, boiling; passion; spurred, subcutaneous abscess; suddenly floats to eat fish bait n. (Boil) (US) Boyle (name of person)"],"usphone":"bɔɪl","ukphone":"bɔɪl"},{"name":"count","trans":["v. Counting; calculating the total number; counting..., including; important; formally accepted; considered as n. total; count; count; count of quantity; matters, charges; opinions; count (of yarn) n. (count) (US) count (US) count (name of person)"],"usphone":"kaʊnt","ukphone":"kaʊnt"},{"name":"eat","trans":["vt. Eat, drink; corrode; annoy vi. eating; corrosion, erosion"],"usphone":"iːt","ukphone":"iːt"},{"name":"mash","trans":["n. Feed; paste; malt pulp vt. Smash; flirt n. (Mash) name; (English) Marsh"],"usphone":"mæʃ","ukphone":"mæʃ"},{"name":"peel","trans":["v. Peel, peel; cut; (in croquet) hit (someone else's ball) through the Iron Ring Gate n. Peel n. (Peel) person's name; (English) Peel"],"usphone":"piːl","ukphone":"piːl"},{"name":"cuddle","trans":["vi. Hug; snuggle; sleep comfortably close to your body vt. Hug; hug warmly; hug fondly n. Hug, hug"],"usphone":"ˈkʌdl","ukphone":"ˈkʌdl"},{"name":"feed","trans":["v. Feed; feed; provide enough food for...; fertilize; fuel (fire); provide raw materials or power for (a machine); provide (someone) (information, ideas, etc.); supply water (body of water); (ball sports terms) feed (ball), pass the ball to (teammates); move (slowly and smoothly); move (slowly and smoothly); pass (slowly and smoothly) through (limited space); promote; graze; raise (family, etc.) (informal) feed; Feeding (especially to animals or infants); eating; a meal (of an animal or baby); a feeding device (of a machine); (machinery, equipment) Raw material supply; (satellite or network) transmission; (computer) subscription source"],"usphone":"fiːd","ukphone":"fiːd"},{"name":"protect","trans":["vt. protection, defense; vigilance"],"usphone":"prəˈtekt","ukphone":"prəˈtekt"},{"name":"sing","trans":["vi. Singing; praising; chirping; calling vt. Sing; praise with poetry; sing to make n. sing; cry; howl n. (Sing) person's name; (old, de, tai) Sing"],"usphone":"sɪŋ","ukphone":"sɪŋ"},{"name":"teach","trans":["vt. Teach; teach; teach vi. Professor; teaching; being a teacher n. (Teach) person's name; (English) Teach"],"usphone":"tiːtʃ","ukphone":"tiːtʃ"},{"name":"grandma","trans":["n. Grandma; grandmother"],"usphone":"ˈɡrænmɑː","ukphone":"ˈɡrænmɑː"},{"name":"hide","trans":["vt. Concealing; concealing; whipping vi. hide n. Hide; animal hide; hiding place"],"usphone":"haɪd","ukphone":"haɪd"},{"name":"lunch","trans":["n. Lunch v. Eat lunch; provide lunch vi. Eat lunch; provide lunch"],"usphone":"lʌntʃ","ukphone":"lʌntʃ"},{"name":"nice","trans":["adj. Precise; beautiful; subtle; kind n. (Nice) name; (English) Nice"],"usphone":"naɪs","ukphone":"naɪs"},{"name":"run","trans":["vi. Operation; running; operation vt. Management, management; operation; participation n. Running; racing; trends; running route n. (Run) name; (Se) Rune"],"usphone":"rʌn","ukphone":"rʌn"},{"name":"try","trans":["vt. Attempt, effort; test; trial; test vi. Try; Try; Test n. Try; Try; Test n. (Try) Name; (English, Indonesia) Teri; () Delhi"],"usphone":"traɪ","ukphone":"traɪ"},{"name":"change","trans":["v. Change, transform, (make) different; (make) transform; replace, replace; exchange; currency exchange; exchange... for change; refund n. Change, change; substitute; change for laundry; change, change; change; transfer; new experience; emergence of a new phase of the moon"],"usphone":"tʃeɪndʒ","ukphone":"tʃeɪndʒ"},{"name":"dark","trans":["adj. Dark, dark; fuzzy; ignorant; melancholy n. darkness; night; dusk; blurry n. (Dark) names; (English) Dark n. (Dark) “Dark” (Dark) (Dark) “Dark” (a German thriller series produced by Netflix in 2017)"],"usphone":"dɑːk","ukphone":"dɑːk"},{"name":"full","trans":["adj. Complete, complete; full, full; rich; perfect; plump; detailed adv. Ten, very; completely; completely vt. Sew clothes wide n. All; complete"],"usphone":"fʊl","ukphone":"fʊl"},{"name":"thin","trans":["adj. Thin; skinny; thin; weak vt. Make thin; make thin; make thin vi. Get thinner; get thinner; become thinner adv. sparsely; faintly n. Small part n. (Thin) person's name; (Yue) Chen; () Ting"],"usphone":"θɪn","ukphone":"θɪn"},{"name":"call","trans":["vi. Call; visit; call vt. Call; call; call; call; call; request; visit n. (Call) person's name; (Sweden, Russia) Carl; (English) Kaul"],"usphone":"kɔːl","ukphone":"kɔːl"},{"name":"donkey","trans":["n. Donkeys; idiots; stubborn people"],"usphone":"ˈdɒŋki","ukphone":"ˈdɒŋki"},{"name":"gorilla","trans":["n. Gorillas"],"usphone":"ɡəˈrɪlə","ukphone":"ɡəˈrɪlə"},{"name":"know","trans":["vt. Know; know; understand vi. Understand; Familiar; Convinced"],"usphone":"nəʊ","ukphone":"nəʊ"},{"name":"koala","trans":["n. Koala, koala (born in Australia, also known as koalas)"],"usphone":"kəʊˈɑːlə","ukphone":"kəʊˈɑːlə"},{"name":"owl","trans":["n. Owls; lords; people accustomed to night activities"],"usphone":"aʊl","ukphone":"aʊl"},{"name":"brother","trans":["n. Brothers; Colleagues; Comrades int. My dude! n. (Brother) name; (English) Blazer"],"usphone":"ˈbrʌðə(r)","ukphone":"ˈbrʌðə(r)"},{"name":"grown","trans":["adj. grown; grown; grown into something v. grow; become; cultivate (past participle of grow)"],"usphone":"ɡrəʊn","ukphone":"ɡrəʊn"},{"name":"summer","trans":["n. Summer; heyday vi. escape the heat; spend the summer adj. Summer n. (Summer) names; (German) Zumer; (English) Summer"],"usphone":"ˈsʌmə(r)","ukphone":"ˈsʌmə(r)"},{"name":"sweatshirt","trans":["n. Sweatshirts; T-shirts"],"usphone":"ˈswetʃɜːt","ukphone":"ˈswetʃɜːt"},{"name":"too","trans":["Adv. too; too; very; also; very; excessive"],"usphone":"tuː","ukphone":"tuː"},{"name":"caring","trans":["adj. Caring for others; helpful; considerate; nursing; compassionate n. (especially for the elderly, patients, etc.) nursing work v. care; attention; care, care, concern; love, love; want; care, care; meet requirements; work hard (present participle of care)"],"usphone":"ˈkeərɪŋ","ukphone":"ˈkeərɪŋ"},{"name":"creative","trans":["adj. creative"],"usphone":"kriˈeɪtɪv","ukphone":"kriˈeɪtɪv"},{"name":"helpful","trans":["adj. helpful; helpful"],"usphone":"ˈhelpfl","ukphone":"ˈhelpfl"},{"name":"interesting","trans":["adj. interesting; intriguing, attention-grabbing"],"usphone":"ˈɪntrəstɪŋ; ˈɪntrestɪŋ","ukphone":"ˈɪntrəstɪŋ; ˈɪntrestɪŋ"},{"name":"smart","trans":["adj. Clever; ingenious; agile; powerful; chic; drastic; fashionable n. (Smart) names; (French) Smarts; (English, German) Smart"],"usphone":"smɑːt","ukphone":"smɑːt"},{"name":"talented","trans":["adj. Talented; multi-talented"],"usphone":"ˈtæləntɪd","ukphone":"ˈtæləntɪd"},{"name":"cozy","trans":["adj. Comfortable, warm; friendly, intimate; close, cooperating; easy to get (but not necessarily appropriate); n. (teapot) insulation cover that does not present (or accept) challenges; double seat with canopy v. (informal) makes for comfort and makes sense"],"usphone":"ˈkəʊzi","ukphone":"ˈkəʊzi"},{"name":"deck","trans":["n. Decks; luggage compartments; outdoor decks vt. Decorations; armor plates; dress up n. (Deck) name; (English, French, German) Dirk"],"usphone":"dek","ukphone":"dek"},{"name":"tall","trans":["adj. Tall; long; excessive; exaggerated adv. Exaggerate n. (Tall) names; (Mali, Arabic) Tales; (Finn, Roe, Sweden) Tarr; (English) Thor; (Turkey) Tales"],"usphone":"tɔːl","ukphone":"tɔːl"},{"name":"view","trans":["n. Observation; vision; opinion; landscape vt. Observe; Consider; Review"],"usphone":"vjuː","ukphone":"vjuː"},{"name":"wooden","trans":["adj. wooden; stiff, rigid"],"usphone":"ˈwʊdn","ukphone":"ˈwʊdn"},{"name":"bucket","trans":["n. Bucket, bucket; bucket; volume of a bucket v. pouring down; moving bumpy n. (Bucket) name of person; (German) Buckett"],"usphone":"ˈbʌkɪt","ukphone":"ˈbʌkɪt"},{"name":"fort","trans":["n. Forts; fortresses; (US) border trading posts vt. Set up a fortress to defend vi. Name of person who built the fortress n. (Fort); (France) Faure; (German, English, Spanish, Portuguese, Russian) Ford"],"usphone":"fɔːt","ukphone":"fɔːt"},{"name":"phone","trans":["n. Telephone; headphone, handset vt. Call vi. Name of person calling n. (Phone); (Lao, Mian) Pong"],"usphone":"fəʊn","ukphone":"fəʊn"},{"name":"puppet","trans":["n. Puppets; puppets; people manipulated by others"],"usphone":"ˈpʌpɪt","ukphone":"ˈpʌpɪt"},{"name":"sprinkler","trans":["n. Sprinklers; sprinklers"],"usphone":"ˈsprɪŋklə(r)","ukphone":"ˈsprɪŋklə(r)"},{"name":"thing","trans":["n. Thing; Thing; Thing; Situation"],"usphone":"θɪŋ","ukphone":"θɪŋ"},{"name":"beg","trans":["vt. Begging; pleading; avoiding the topic vi. Begging; requesting n. (Beg) person's name; (German, Sai, Baki) Berg"],"usphone":"beɡ","ukphone":"beɡ"},{"name":"brush","trans":["n. Brushes; Brushes; Brushes; Quarrels; Conflicts; Bushland; Short Trees; Fox Tails vt. brush; painting; vi. brush; wipe; skim; touch (as you pass by)"],"usphone":"brʌʃ","ukphone":"brʌʃ"},{"name":"fed","trans":["v. Feed; feed on; fertilize (plants); fuel (fire); promote, promote; satisfy (addiction) (informal) (past tense and past participle of feed)"],"usphone":"fed","ukphone":"fed"},{"name":"stubborn","trans":["adj. Stubborn; tenacious; difficult to handle"],"usphone":"ˈstʌbən","ukphone":"ˈstʌbən"},{"name":"tickle","trans":["vt. Make it itchy; make you happy; make you satisfied vi. Feeling itchy; (something) makes people itchy n. Arms; Itchy; Things that make people itchy and happy n. (Tickle) Name of person; (English) Tickle"],"usphone":"ˈtɪkl","ukphone":"ˈtɪkl"},{"name":"box","trans":["n. Box, box; private room; one punch vi. Boxing vt. Boxing; packed... in a box; slap n. (Box) person's name; (English, French, Spanish) box"],"usphone":"bɒks","ukphone":"bɒks"},{"name":"cage","trans":["n. Cage, animal cage; cell, prison vt. Put... in a cage; imprison... n. (Cage) name; (France) Kage; (English) Cage"],"usphone":"keɪdʒ","ukphone":"keɪdʒ"},{"name":"close","trans":["adj. Close; Close; Close; Close; Close; Close (Open); Close (Open); Close (Bank Account); Close; Close; Close; Close (Open); Close; Close; Close; Close (Open); Close; Close; Close; Close (Open); Close (Open); Close (Open); Close (Open); Close (Open); Close (Bank Account); Close (Close); Close (Stock); Close (Stock); Close (Bank Account) Zoom out; hold... firmly; (computer) close (file) adv. Closely; Close; Close to ground n. End; Closed; Dead Alley; Surrounding area (of a cathedral); Playgrounds of some traditional English public schools; n. (Close) (English, French) (English, French) Close (name of person)"],"usphone":"kləʊs","ukphone":"kləʊs"},{"name":"door","trans":["n. Door; home, door; doorway; channel n. (Door) person's name; (English) Dole"],"usphone":"dɔː(r)","ukphone":"dɔː(r)"},{"name":"drawer","trans":["n. Drawer; Invoyer; Issuer; Drafter; Tavern Servant n. n. (de) Delavel (name of person)"],"usphone":"drɔ:(r)","ukphone":"drɔ:(r)"},{"name":"jar","trans":["n. Can; wide mouth bottle; vibration; harsh sound vi. Conflict; inconsistency; shock; harshness vt. Vibrate; irritate; cause vibration n. (Jar) person's name; (Luo) Zar"],"usphone":"dʒɑː(r)","ukphone":"dʒɑː(r)"},{"name":"open","trans":["adj. Open; open; empty; candid; open vi. Begin; show vt. open; open n. Open; Open; Outdoor"],"usphone":"ˈəʊpən","ukphone":"ˈəʊpən"},{"name":"dice","trans":["n. Dice; craps game; small pieces of food v. Cut (food, etc.) into cubes; roll the dice; (informally) refuse n. (Dice) (US) Dice (name of person)"],"usphone":"daɪs","ukphone":"daɪs"},{"name":"gloves","trans":["n. [clothing] gloves (plural of gloves) v. give... wear gloves (three single forms of gloves)"]},{"name":"pair","trans":["n. One pair, one pair, one pair vt. Form... into a pair of n. (Pair) names; (English, French) Pell"],"usphone":"peə(r)","ukphone":"peə(r)"},{"name":"skates","trans":["n. Skates; skates (plural of skate) v. ice skating; sliding; slightly touching (three single forms of skating)"],"usphone":"skeits","ukphone":"skeits"},{"name":"sock","trans":["n. Short socks; one-hit vt. Hit hard; put on... socks adv. On the ground; unbiased adj. A very successful n. (Sock) name; (German) Zock"],"usphone":"sɒk","ukphone":"sɒk"},{"name":"twin","trans":["n. One of the twins; one of a pair of similar things adj. Twins; one of the twins; twins; double v. makes a sister city; makes a couple; makes twins n. (Twin) Twins (personal name)"],"usphone":"twɪn","ukphone":"twɪn"},{"name":"wings","trans":["n. [Kun] wings (plural form of wing); flight badge; a wing-shaped badge worn by Girl Scouts n. (Wings) name; (de) Wings"]},{"name":"agree","trans":["vt. agree, approve; acknowledge; agree, agree vi. vi. agree, agree; agree, agree"],"usphone":"əˈɡriː","ukphone":"əˈɡriː"},{"name":"always","trans":["Adv. forever, always; always; often"],"usphone":"ˈɔːlweɪz","ukphone":"ˈɔːlweɪz"},{"name":"everyone","trans":["pron everyone; everyone"],"usphone":"ˈevriwʌn","ukphone":"ˈevriwʌn"},{"name":"kickball","trans":["n.Soccer games for kids"],"usphone":"ˈkɪkbɔːl","ukphone":"ˈkɪkbɔːl"},{"name":"last","trans":["adj. The last; most recent; last; ultimate; least likely; worst; the only remaining adv. Recently, last time; last pron. Last person or thing; recent event; ultimate v. continuation; continuation of service; survival; (supply, resources) sufficient (someone) for a period of time n. Shoe support; end n. (Last) (US, Germany) Rust (name of person)"],"usphone":"lɑːst","ukphone":"lɑːst"},{"name":"city","trans":["n. City, city adj. urban; metropolitan"],"usphone":"ˈsɪti","ukphone":"ˈsɪti"},{"name":"country","trans":["n. Country, Homeland; Nationality; Countryside, Countryside; Hometown adj. Motherland's, hometown's; local, rural; national; rude; country music's"],"usphone":"ˈkʌntri","ukphone":"ˈkʌntri"},{"name":"home","trans":["n. Home, home; place of origin; hometown; shelter adv. At home, go home; deeply adj. Domestic, domestic; effective vt. Return home, return home n. (Home) name; (De, Finn) Holme; (English, Nee) Holm"],"usphone":"həʊm","ukphone":"həʊm"},{"name":"state","trans":["n. Country; State; Situation vt. regulations; statements; adj. National; state; official n. (State) name; (Russian, Sweden) Staat; (English) State"],"usphone":"steɪt","ukphone":"steɪt"},{"name":"street","trans":["n. Street adj. n. (Street) name of the street; (English, Portuguese) Street; (German) Strait"],"usphone":"striːt","ukphone":"striːt"},{"name":"library","trans":["n. Library, library; library"],"usphone":"ˈlaɪbrəri; ˈlaɪbri","ukphone":"ˈlaɪbrəri; ˈlaɪbri"},{"name":"loud","trans":["adj. Loud, loud; constant; loud adv. Loudly, loudly, loudly n. (Loud) person's name; (English) Lauder"],"usphone":"laʊd","ukphone":"laʊd"},{"name":"quiet","trans":["adj. Quiet; stable; motionless; docile n. Quiet; peaceful vt. Calm; comfort vi. pacify"],"usphone":"ˈkwaɪət","ukphone":"ˈkwaɪət"},{"name":"bridge","trans":["n. Bridges; Bridges; Bridges; Ship Bridges vt. Building a bridge; crossing n. (Bridge) name; (English) Bridge"],"usphone":"brɪdʒ","ukphone":"brɪdʒ"},{"name":"dam","trans":["n. 10 meters (equal to decametre); dams; reservoirs; rubber barriers (in dental surgery); mother animals v. building dams; blocking, controlling n. (dam) (American) dan (name of person)"],"usphone":"dæm","ukphone":"dæm"},{"name":"yawn","trans":["v. Yawn; open; open (fearfully) n. Yawn; boring people (things)"],"usphone":"jɔːn","ukphone":"jɔːn"},{"name":"boulder","trans":["n. Pebbles, large boulders; boulders"],"usphone":"ˈbəʊldə(r)","ukphone":"ˈbəʊldə(r)"},{"name":"broke","trans":["adj. (informal) unnamed, bankrupt v. break; damage; break; violate; suspend (past tense of break) n. (Broke) (US, India, Russia, Germany) Brock (name of person)"],"usphone":"brəʊk","ukphone":"brəʊk"},{"name":"pebble","trans":["n. Pebble; crystal lens vt. Use pebble shops"],"usphone":"ˈpebl","ukphone":"ˈpebl"},{"name":"rock","trans":["n.Rock; rock; rock; reef vt. Shake; shake vi. Shake; shake n. (Rock) name; (English, German, Italian, Swedish) Rock"],"usphone":"rɒk","ukphone":"rɒk"},{"name":"stone","trans":["n. Stones; stones; [treasure] gemstones adj. Stone, stone vt. Throw stones; use stones to lay stones n. (Stone) names; (Czech) Storne; (Sweden) Stones; (English) Stone"],"usphone":"stəʊn","ukphone":"stəʊn"},{"name":"block","trans":["n. Blocks; blocks; buildings; obstacles vt. block; block; limit; block adj. Batch, large; n. (Block) names of people in traffic jams; (English, French, German, Spanish, Portuguese, Finnish, Russian) Brock"],"usphone":"blɒk","ukphone":"blɒk"},{"name":"long","trans":["adj. Long; long term; long term; long sound; (human) high; continuous; lengthy; long term; long term (profitable) adv. Over a long period of time; (before or after something) for a long time; (after the noun of time); far away n. Long; long sound; forward securities; long size (of clothing); long pants v. desire, hope n. (long) (US, UK, Ireland) long (name of person)"],"usphone":"lɒŋ","ukphone":"lɒŋ"},{"name":"round","trans":["adj. round; curved; integer; perfect; approximate; obese; (sound) round; (ancient, money) large; (ancient, human, or way of speaking) straightforward adv. Spin; around; around; everywhere; in a detour; in the opposite direction; one by one; prep somewhere. Around; around; around; around...; at... stages; round; round; regular activity; circle, round object; fixed route v. (make) round; complete; round off; round off; round off; round off; progress; circumnavigate; gain weight n. (Round) (US, UK, Canada, Australia, India, Germany) Round (name of person)"],"usphone":"raʊnd","ukphone":"raʊnd"},{"name":"short","trans":["adj. short; insufficient; short, low n. short; lack; short circuit; shorts adv. Insufficient; suddenly; suddenly n. (Short) (English) Short (name)"],"usphone":"ʃɔːt","ukphone":"ʃɔːt"},{"name":"fancy","trans":["v. Want to do; love; arrogance; imagine; think; think (especially speed racing) think... to win; (showing surprise or opposition) really didn't expect n. fantasy; imagination; hobby; the most popular person or animal (in sports such as horse racing); enthusiasts (of sports such as boxing); fancy cakes or cookies; (16th and 17th century musical terms) Fantasia adj. complex; expensive; delicate, fancy; imaginative; (food) high quality; (flower) variegated; (animal) n. (Fancy) fan (name) for viewing"],"usphone":"ˈfænsi","ukphone":"ˈfænsi"},{"name":"grand","trans":["adj. Magnificent; luxurious; extremely important n. Grand piano; 1,000 dollars n. (Grand) name; (French) Grand; (English, Sweden) Grand"],"usphone":"ɡrænd","ukphone":"ɡrænd"},{"name":"shy","trans":["adj. Shy; timid, timid vi. Throw; cringe; retreat; disgust vt. throw; random throw n. throw; shock jump n. (Shy) person's name; (English) Shy"],"usphone":"ʃaɪ","ukphone":"ʃaɪ"},{"name":"sure","trans":["adj. Convinced; reliable; certain adv. Of course; indeed n. (Sure) (France, India, US, Germany) Hugh (name)"],"usphone":"ʃʊə(r); ʃɔː(r)","ukphone":"ʃʊə(r); ʃɔː(r)"},{"name":"wonderful","trans":["adj. excellent, wonderful, wonderful; amazing; wonderful; winning; amazing"],"usphone":"ˈwʌndəfl","ukphone":"ˈwʌndəfl"},{"name":"desert","trans":["n. Desert, wasteland; dull and boring situation (or region), deserted place; well-deserved reward (common plural) v. abandonment; abandonment, abandonment (place); (soldier) leaving (army); escape; desertion; abandonment, abandonment; abandonment, abandonment; departure, disappointment; (sense, quality, or skill) leaving, losing (sense, quality, or skill) adj. desert; desolate; abandoned"],"usphone":"(for v.) dɪ'zɜːt; (for n.) 'dezət","ukphone":"(for v.) dɪ'zɜːt; (for n.) 'dezət"},{"name":"forest","trans":["n. Forest, wooded area; a thicket (similar to a forest); royal woodland, hunting grounds v. planted in; covered by forest n. (Forest) Forest (name of person)"],"usphone":"ˈfɒrɪst","ukphone":"ˈfɒrɪst"},{"name":"plains","trans":["n. Flat ground, plain (plural of plain)"],"usphone":"pleinz","ukphone":"pleinz"},{"name":"comet","trans":["n. [day] comet n. (Comet) person's name; (France) Comet"],"usphone":"ˈkɒmɪt","ukphone":"ˈkɒmɪt"},{"name":"day","trans":["n. Day; period; daytime adv. Every day; often during the day adj. Daytime; daily n. (Day) names; (English, French, Spanish) Dai; (Vietnamese) Dai; (Arabic, Turkish) Dai"],"usphone":"deɪ","ukphone":"deɪ"},{"name":"planet","trans":["n. Planet n. (Planet) name; (French) Plane; (Spanish, Portuguese) Planet"],"usphone":"ˈplænɪt","ukphone":"ˈplænɪt"},{"name":"satellite","trans":["n. Satellite; artificial satellite; companion; satellite country"],"usphone":"ˈsætəlaɪt","ukphone":"ˈsætəlaɪt"},{"name":"sky","trans":["n. Sky; vertex vt. Throw... into the air; hang... too high vi. Kick or hit a high-altitude ball; tilt the paddle too high; soar n. (Sky) person's name; (English) Sky"],"usphone":"skaɪ","ukphone":"skaɪ"},{"name":"star","trans":["n. Stars, stars; stars; star-shaped objects vt. Marked with an asterisk; starred by..., with... in the lead role vi. Acting as the lead adj. Star's, protagonist's; star-shaped n. (Star) person's name; (Sweden) Stahl; (German) Stahl"],"usphone":"stɑː(r)","ukphone":"stɑː(r)"},{"name":"finger","trans":["n. Fingers; pointers, fingerprints vt. Reach out; fiddle with your finger vi. Touch with finger; pick n. (Finger) name; (English, German, Czech) Finger; (Russian) Finger"],"usphone":"ˈfɪŋɡə(r)","ukphone":"ˈfɪŋɡə(r)"},{"name":"shell","trans":["n. Shell, shell; shell; shape vi. peeling; setting the position of the command line interpreter vt. Peeling; bombardment"],"usphone":"ʃel","ukphone":"ʃel"},{"name":"spiral","trans":["n. Spirals; vortices; spirals adj. spiral; circling vt. Make a spiral; make a spiral rise vi. Circling; spiraling; spiraling up (past tense spiraled/spiralled, past participle spiraled/spiralled, present participle spiraling/spiralling, 3rd person singular spiral, adverb spirally)"],"usphone":"ˈspaɪrəl","ukphone":"ˈspaɪrəl"},{"name":"basement","trans":["n. Basement; cellar"],"usphone":"ˈbeɪsmənt","ukphone":"ˈbeɪsmənt"},{"name":"clean","trans":["adj. Clean, clean; innocent vt. Make it clean vi. Clean, clean adv. Completely n. Clean n. (Clean) person's name; (English) Klein"],"usphone":"kliːn","ukphone":"kliːn"},{"name":"kitchen","trans":["n. Kitchen; cooking utensils; cook staff n. (Kitchen) name; (English) kitchen"],"usphone":"ˈkɪtʃɪn","ukphone":"ˈkɪtʃɪn"},{"name":"living room","trans":["Living room, living room"],"usphone":"'lɪvɪŋ ru:m","ukphone":"'lɪvɪŋ ru:m"},{"name":"porch","trans":["n. Porches; hallways"],"usphone":"pɔːtʃ","ukphone":"pɔːtʃ"},{"name":"spring","trans":["n. Spring; springs; springs; vitality; jumping adj. Spring vi. Grow; erupt; leap; crack vt. Make it jump; make it explode; suddenly propose; make it pop n. (Spring) name; (Germany) Sprin; (England, Finland, Sweden) Spring"],"usphone":"sprɪŋ","ukphone":"sprɪŋ"},{"name":"animal","trans":["n. Animals Animal's"],"usphone":"ˈænɪml","ukphone":"ˈænɪml"},{"name":"living","trans":["adj. Living; existing; used; living; living; living; active; realistic; (poem, text, meaning water) flowing n. livelihood; lifestyle; pastors' position (particularly in the old days) with paid housing; living person v. living; living; living; living; living; continuing to exist, preserve, remember; enjoy a full and exciting life (present participle of live) n. (Living) (English) Levine (name of person)"],"usphone":"ˈlɪvɪŋ","ukphone":"ˈlɪvɪŋ"},{"name":"rosy","trans":["adj. Rosy, rose-red; beautiful; optimistic; blushing n. (Rosy) name; (Luo, Italian, Swedish, classical) Rosie (female name); Rosie; (English) Rosie"],"usphone":"ˈrəʊzi","ukphone":"ˈrəʊzi"},{"name":"strange","trans":["adj. Strange; strange; layman adv. Strange; strange place, callously n. (Strange) person name; (English) Strange; (Sweden, Serbia) Stranger"],"usphone":"streɪndʒ","ukphone":"streɪndʒ"},{"name":"bite","trans":["vt. bite; sting n. bite; bite; bite; sting vi. Bite; stinging abbr. Built-in Test Equipment (Built-In Test Equipment) n. (Bite) person's name; () Bitai"],"usphone":"baɪt","ukphone":"baɪt"},{"name":"dessert","trans":["n. After-meal dessert; sweet snack n. (Dessert) person's name; (France) Dessel"],"usphone":"dɪˈzɜːt","ukphone":"dɪˈzɜːt"},{"name":"hate","trans":["vt. Hate; Disgust; Regret vi. hate n. hate; disgust n. (hate) name; (France) art"],"usphone":"heɪt","ukphone":"heɪt"},{"name":"plate","trans":["n. Disc; metal plate; metal plate; photosensitive negative vt. Electroplating; name for... armored n. (Plate); (English, German, Russian, Spanish, Italian, Sweden) Platt"],"usphone":"pleɪt","ukphone":"pleɪt"},{"name":"take","trans":["vt. Take, take; take; accept (gifts, etc.); buy, spend; spend (time, etc.) vi. Take; obtain n. Catch; Views; Benefits, Profits; Amount (of tickets) sold"],"usphone":"teɪk","ukphone":"teɪk"},{"name":"cut out","trans":["Disconnect; Delete; Stop; Shut Down"],"usphone":"ˈkʌt aʊt","ukphone":"ˈkʌt aʊt"},{"name":"drink","trans":["v. Drink, drink; drink; after drinking..., cheers; (metaphor) revel in; (informally) absorb (moisture); drink (alcohol) to have a certain flavor; raise a glass to celebrate n. Wine; drink (drink or wine); drink, drink, be greedy, abuse alcohol"],"usphone":"drɪŋk","ukphone":"drɪŋk"},{"name":"first","trans":["det. First num. First; first; first (in line) first; best adj. The most important, the best; the one that never happened before; the one that came right after; the one that was ahead of everyone else; the adv who sang (or played) the high voice. First; first; first time; first place (in a competition); better; an unprecedented achievement with a certain part of the body; first grade (car, bicycle); highest score (in a British university degree); first grade (in baseball); first year (in college, school); first edition (of a book); first place (in a game); (UK) Secretary of the Navy; honors student pron. First (first); first n. (First) (US) Fielster (name)"],"usphone":"fɜːst","ukphone":"fɜːst"},{"name":"slide","trans":["v. Slide; walk smoothly; move quietly; gradually deteriorate; depreciate; decline; fall unwittingly; fall; slide; slide; avalanche; slide; avalanche; slide; slide; slide; avalanche; slide device (of a machine or musical instrument); hairpins; light shoes"],"usphone":"slaɪd","ukphone":"slaɪd"},{"name":"turn","trans":["vt. Turn to make a spin; turn; turn over; redeem vi. Turn; turn; turn n. Turn; change; act, act, act (damage or benefit others) n. (Turn) person's name; (Germany,) Thun"],"usphone":"tɜːn","ukphone":"tɜːn"},{"name":"back","trans":["n. Back; backbone; rear; back; tail; (chair) backrest; defender; hull; (aircraft) fuselage; (human) trunk; adj. What is behind; what is behind; what is in the past; what is in arrears; what is behind the tongue adv. Backwards; backwards; on the back; on the back; on the back; behind n. (Back) (US) Buck (name); behind n. (Back) (US); Back; Back; Back; Back; Back; Back (name of person); Bets; Approval; Reinforcements; Accompaniment; Accompaniment; Attached to...; Steer counterclockwise; Seek back; behind... n. (Back) (US) Buck (name of person)"],"usphone":"bæk","ukphone":"bæk"},{"name":"front","trans":["n. Front; front; front line vt. face; face; face vi. Facing adj. Front; front adv. At the front; forward n. (Front) person's name; (France) Fron"],"usphone":"frʌnt","ukphone":"frʌnt"},{"name":"minute","trans":["n. Minutes; Moments, Moments; Memos, Notes; Meeting Minutes vt. Record... adj. tiny, detailed [mat; US -ˈnut; maßnut]"],"usphone":"ˈmɪnɪt","ukphone":"ˈmɪnɪt"},{"name":"toothpaste","trans":["n. Toothpaste"],"usphone":"ˈtuːθpeɪst","ukphone":"ˈtuːθpeɪst"},{"name":"avocado","trans":["n.Avocados; avocado trees; avocados"],"usphone":"ˌævəˈkɑːdəʊ","ukphone":"ˌævəˈkɑːdəʊ"},{"name":"eggplant","trans":["n. Eggplant adj. dark purple"],"usphone":"ˈeɡplɑːnt","ukphone":"ˈeɡplɑːnt"},{"name":"fruit","trans":["n. Fruit; Product vi. The results are real vt. Make... result n. (Fruit) person's name; (French) Freud; (English) Fruitt"],"usphone":"fruːt","ukphone":"fruːt"},{"name":"surprise","trans":["n. Surprise, surprise; sudden attack vt. surprise; surprise attack adj. Surprising"],"usphone":"səˈpraɪz","ukphone":"səˈpraɪz"},{"name":"camera","trans":["n. Camera; Camera n. (Camera) person's name; (English, Italian, Spanish) Carmela"],"usphone":"ˈkæmrə","ukphone":"ˈkæmrə"},{"name":"computer","trans":["n. Computers; computers; electronic computers"],"usphone":"kəmˈpjuːtə(r)","ukphone":"kəmˈpjuːtə(r)"},{"name":"new","trans":["adj. New, fresh; updated; first-time adv. Recent n. (New) person's name; (English) New Zealand"],"usphone":"njuː","ukphone":"njuː"},{"name":"old","trans":["adj. Obsolete, ancient; old n. Ancient n. (Old) names; (English) Old"],"usphone":"əʊld","ukphone":"əʊld"},{"name":"television","trans":["n. Television, television; television industry"],"usphone":"ˈtelɪvɪʒn","ukphone":"ˈtelɪvɪʒn"},{"name":"air","trans":["n. Air, atmosphere; sky; appearance; tune vt. Ventilate and dry; brag vi. venting"],"usphone":"eə(r)","ukphone":"eə(r)"},{"name":"boat","trans":["n. Small boat; ship vi. rowing"],"usphone":"bəʊt","ukphone":"bəʊt"},{"name":"cup","trans":["n. Cups; trophies; wine glasses vt. Shape it into a cup; for... a cupping pot"],"usphone":"kʌp","ukphone":"kʌp"},{"name":"fox","trans":["n. Fox; cunning person; fox skin; vixen, sexy woman v. Can't guess; deceive, confuse; use cunning methods n. (Fox) (England, America, Germany, Dan, Love) Fox (name of person)"],"usphone":"fɒks","ukphone":"fɒks"},{"name":"house","trans":["n. Homes; households; institutions; parliaments; buildings for a certain purpose vt. Cover; live in... the house; store... in the room vi. Name of person staying in n. (House); (English) House"],"usphone":"haʊs","ukphone":"haʊs"},{"name":"tea","trans":["n. Tea leaves; tea tree; refreshments vt. Give... make tea vi. Drink tea; take tea n. (Tea) person's name; (card) di"],"usphone":"tiː","ukphone":"tiː"},{"name":"catch","trans":["vt. Catch; catch; infect; understand vi. catch; catch n. Catch; catch; window hook"],"usphone":"kætʃ","ukphone":"kætʃ"},{"name":"hot","trans":["adj. Hot; spicy; passionate; exciting; urgent adv. Hot; urgently vi. Getting hot vt. Add; warm up... n. (Hot) names; (Se) Holt; (France) Ott"],"usphone":"hɒt","ukphone":"hɒt"},{"name":"outside","trans":["n. Exterior; exterior; surroundings (of buildings, etc.); opposite side (near the center of the road); external road (curved road surface or track surface) adj. Outside, outside; outside; outside; outside the main building; impossible prep. Out of...; out of range of...; leave adv. outside, outward; outdoors"],"usphone":"ˌaʊtˈsaɪd","ukphone":"ˌaʊtˈsaɪd"},{"name":"ride","trans":["v. Ride, ride (bike, motorcycle, or horse, etc.), ride (subway, train, etc.); drive, control, try to control (someone) and force it to work; float; cross, overturn; depend on; count, mock; be carried away (with great impulse), thanks to n. (in a horse, bike, or vehicle) travel, itinerary; ride a free car; a person who makes it easy for people to ride; (someone's) car; (in an amusement park) an amusement device (n) for people to ride. Ride) (English, US, France) Ryder (person name)"],"usphone":"raɪd","ukphone":"raɪd"},{"name":"carry","trans":["vt. Take and carry; carry; support; carry vi. Can be achieved; carried; carried n. Carried; [measured] position; range n. (Carry) name of person; (English) Kari"],"usphone":"ˈkæri","ukphone":"ˈkæri"},{"name":"dig","trans":["vt. Dig, explore; explore vi. Dig n. Poke, stab; dig up n. (Dig) people's names; (Luo) Digger"],"usphone":"dɪɡ","ukphone":"dɪɡ"},{"name":"knife","trans":["n. Knife; dagger vt. Cut with a knife; injure (mouth) vi. split; cross"],"usphone":"naɪf","ukphone":"naɪf"},{"name":"pound","trans":["n. Pound; heavy strike, heavy hitting sound; beast fence; prison vt. Smashing; beating; imprisoning, detaining vi. Continuous heavy hits, punching n. (Pound) person's name; (English) Pound"],"usphone":"paʊnd","ukphone":"paʊnd"},{"name":"tool","trans":["n. Tools, utensils; instruments, machine tools; means vi. Use tools; equip the factory with machine tools vt. Use tools to process..."],"usphone":"tuːl","ukphone":"tuːl"},{"name":"wheelbarrow","trans":["n. Wheelbarrow vt. For stroller transportation"],"usphone":"ˈwiːlbærəʊ","ukphone":"ˈwiːlbærəʊ"},{"name":"bathroom","trans":["n. Bathroom; toilet; lavatory"],"usphone":"ˈbɑːθruːm; ˈbɑːθrʊm","ukphone":"ˈbɑːθruːm; ˈbɑːθrʊm"},{"name":"between","trans":["prep. (space, time, quantity, etc.) between...; round trip; (table relationship) between two...; shared; adv together. (time or space) between...; during"],"usphone":"bɪˈtwiːn","ukphone":"bɪˈtwiːn"},{"name":"pet","trans":["n. Pets; angry; loved ones vt. Love vi. Angry; caressing adj. Favorite n. (Pet) person's name; (Russian) Pet; ()"],"usphone":"pet","ukphone":"pet"},{"name":"sneeze","trans":["vi. sneeze n. Sneeze"],"usphone":"sniːz","ukphone":"sniːz"},{"name":"noodle","trans":["n.Noodles; idiot"],"usphone":"ˈnuːdl","ukphone":"ˈnuːdl"},{"name":"soak","trans":["vt. Absorb, inhale; immerse (at work or study); wet up and down... vi. Soaking; infiltration n. Immersion; wet; heavy rain"],"usphone":"səʊk","ukphone":"səʊk"},{"name":"sponge","trans":["n. Sponges; artificial sponges; wipe; sponge animals; sponge fillers, sponge insulators; (informal) heavy drinkers; metal sponges, sponge metal; sponge cake, soft pudding; (informal) white eaters, oil washers v. wipe with sponge; wipe off with sponge (wet cloth); paint with sponge (wet cloth); paint with sponge; (informal) eat white soap, wipe oil in white"],"usphone":"spʌndʒ","ukphone":"spʌndʒ"},{"name":"bank","trans":["n. Banks; shores; shoals; storage vt. Deposit... into the bank; make an inclined turn vi. Accumulation; inclined turn n. (Bank) name; (English, German, Russian) Bank; (French,) Bunker"],"usphone":"bæŋk","ukphone":"bæŋk"},{"name":"buy","trans":["vt. Buy; Get; Bribe; Trust vi. Buying, purchasing n. Purchasing, trading; purchased items; affordable goods n. (Buy) name of person; (French) Bee"],"usphone":"baɪ","ukphone":"baɪ"},{"name":"crayon","trans":["n. Crayons, colored chalk vt. Draw with crayons, use colored chalk to draw n. (Crayon) names; (English) Crane"],"usphone":"ˈkreɪən; ˈkreɪɒn","ukphone":"ˈkreɪən; ˈkreɪɒn"},{"name":"furniture","trans":["n. Furniture; equipment; storage"],"usphone":"ˈfɜːnɪtʃə(r)","ukphone":"ˈfɜːnɪtʃə(r)"},{"name":"cricket","trans":["n. Cricket, cricket; cricket"],"usphone":"ˈkrɪkɪt","ukphone":"ˈkrɪkɪt"},{"name":"flea","trans":["n. Fleas; cheap hotels; flea animals"],"usphone":"fliː","ukphone":"fliː"},{"name":"grub","trans":["n. Maggots (insects), larvae; small caterpillars; food v. excavate, search; excavate (from the soil); exhume (ground) roots and tree stumps; clumsy search; work hard; work hard to get n. (Grub) (American) Grub (name of person)"],"usphone":"ɡrʌb","ukphone":"ɡrʌb"},{"name":"ten","trans":["num. Ten, ten n. (Ten) (American, Russian, Canada, German, Dutch, Spanish, English) (name)"],"usphone":"ten","ukphone":"ten"},{"name":"dunk","trans":["v. (especially food) Soak, dip; (kidding) push someone into the water; dunk n. Dunk, dunk n. (Dunk) (US, UK, Canada) Dunk (name of person)"],"usphone":"dʌŋk","ukphone":"dʌŋk"},{"name":"paddle","trans":["n. Paddling; paddle wing vt. Stir; stir; use a paddle to stroke vi. Paddling; playing in the water; wading"],"usphone":"ˈpædl","ukphone":"ˈpædl"},{"name":"practice","trans":["n. Practice; Practice; Practice vi. Practice; internship; implementation vt. practice; internship; practice"],"usphone":"ˈpræktɪs","ukphone":"ˈpræktɪs"},{"name":"mouth","trans":["n. Mouth, mouth; estuary vt. Say it playfully, say it in a pretentious manner; say vi in a whisper. pretend to speak"],"usphone":"maʊθ","ukphone":"maʊθ"},{"name":"nose","trans":["n. Nose; sense of smell; prominent part; inquiry vt. Smell; touch with your nose vi. Carefully explore and move forward; inquire"],"usphone":"nəʊz","ukphone":"nəʊz"},{"name":"snowman","trans":["n. Snowman n. (Snowman) name; (English) Snowman"],"usphone":"ˈsnəʊmæn","ukphone":"ˈsnəʊmæn"},{"name":"soup","trans":["n. Soup, soup; horsepower vt. Accelerate; increase horsepower"],"usphone":"suːp","ukphone":"suːp"},{"name":"choice","trans":["n. Choices; Choices; Selected Products adj. Selected; carefully curated"],"usphone":"tʃɔɪs","ukphone":"tʃɔɪs"},{"name":"healthy","trans":["adj. Healthy, robust; beneficial to the body and mind; wise, reasonable; well-functioning, thriving and developed; numerous, impressive"],"usphone":"ˈhelθi","ukphone":"ˈhelθi"},{"name":"bug","trans":["n. Bugs, bugs; malfunctions; eavesdropping devices vt. Disturb, disturb; install an eavesdropping device vi. install an eavesdropping device; disrupt"],"usphone":"bʌɡ","ukphone":"bʌɡ"},{"name":"fish","trans":["n. Fish; Fish; Pisces; Joint Board; (informal) weirdo; (informal) torpedo v. Fishing, fishing; searching; asking for news; salvage; patching n. (Fish) (American, Love) Fish (name of person) with a junction board"],"usphone":"fɪʃ","ukphone":"fɪʃ"},{"name":"seed","trans":["n. Seed; basis; semen; germination; offspring; origin vt. Sowing; fruiting; maturing; leaving... seeds vi. Sowing; (plant) fruiting n. (Seed) person's name; (English) seed"],"usphone":"siːd","ukphone":"siːd"},{"name":"ghost","trans":["n. Ghost, ghost vt. Commit to work; catch a knife for...; write for people vi. Ghostwriting for someone else"],"usphone":"ɡəʊst","ukphone":"ɡəʊst"},{"name":"Halloween","trans":["n. Eve of Halloween (refers to the night of October 31)"],"usphone":"ˌhæləʊˈiːn","ukphone":"ˌhæləʊˈiːn"},{"name":"mummy","trans":["n. Mom; mummy; dry person"],"usphone":"ˈmʌmi","ukphone":"ˈmʌmi"},{"name":"pale","trans":["adj. pale; weak; dim n. Outpost; fence; range vt. Discolor; make pale; use a fence vi. Loss of color; turning pale; becoming dull n. (Pale) person's name; (Se) Pale"],"usphone":"peɪl","ukphone":"peɪl"},{"name":"shiny","trans":["adj. smooth, shiny, shiny"],"usphone":"ˈʃaɪni","ukphone":"ˈʃaɪni"},{"name":"sweet","trans":["adj. Sweet; sweet; aromatic; kind; fun; aromatic; baby () cool name; (English) Sweet; (English) Sweet"],"usphone":"swiːt","ukphone":"swiːt"},{"name":"draw","trans":["vt. Draw; pull; attract vi. Pull; drag n. Draw; Draw n. (Draw) person's name; (English) Delau"],"usphone":"drɔː","ukphone":"drɔː"},{"name":"fluffy","trans":["adj. fluffy; fluffy; furry; contentless"],"usphone":"ˈflʌfi","ukphone":"ˈflʌfi"},{"name":"hairy","trans":["adj. Hairy; hairy; long haired n. (Hairy) name; (French) Airy"],"usphone":"ˈheəri","ukphone":"ˈheəri"},{"name":"heap","trans":["n. Heap; many; cumulative vt. Heap; stack vi. Pile up n. (Heap) names; (Finn) Haiyap; (Southeast Asian Chinese) Association; (English) Shipp"],"usphone":"hiːp","ukphone":"hiːp"},{"name":"shower","trans":["n. Showers; a burst (appearing like a pouring), a large number; showers vt. Give in large quantities; get... wet vi. Showers; showers"],"usphone":"ˈʃaʊə(r)","ukphone":"ˈʃaʊə(r)"},{"name":"together","trans":["Adv. together; simultaneously; each other; continuously; in total adj. Trendy; emotionally stable, efficient"],"usphone":"təˈɡeðə(r)","ukphone":"təˈɡeðə(r)"},{"name":"chest","trans":["n. Chest, chest; wardrobe; chest; vault"],"usphone":"tʃest","ukphone":"tʃest"},{"name":"heart","trans":["n. Heart; Feelings; Courage; Heart Shape; Key points vt. Encourage; remember vi. Name of the person who made up the knot n. (Heart); (English) Hart"],"usphone":"hɑːt","ukphone":"hɑːt"},{"name":"smile","trans":["v. Smile; express with a smile; show (some kind of smile) n. Smile, smile; happy color n. (Smile) (Russian, Indian, American) Smiley (name of person)"],"usphone":"smaɪl","ukphone":"smaɪl"},{"name":"waist","trans":["n.Waist, waist"],"usphone":"weɪst","ukphone":"weɪst"},{"name":"wear","trans":["v. Wear, wear; save (hair, whiskers); exposure; wear and tear; durability; accept (especially things you disapprove of); (boat) raise (flag); (poetry, text) wear and tear (time); (make) the bow turn (downwind) n. Clothing; wear and tear; durability"],"usphone":"weə(r)","ukphone":"weə(r)"},{"name":"wrist","trans":["n. Wrist; wrist joint vt. Move with wrist strength"],"usphone":"rɪst","ukphone":"rɪst"},{"name":"lift","trans":["v. Lift; lift; raise (voice) volume; raise (voice) volume; lift (price); air transport; be lifted; spread; perform cosmetic surgery; dig; pick up and place; get rid of an unhappy mood; advance; win; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; lift; (cricket) fly high; free lift; (cricket) fly high; free lift; (cricket) lift; free lift; free lift; (cricket)"],"usphone":"lɪft","ukphone":"lɪft"},{"name":"push","trans":["vt. Push, increase; pressure, persecute...; press; persuade vi. Advance; Increase; Strive for n. Push; Determination; Large-scale Offensive; Committed Pursuit"],"usphone":"pʊʃ","ukphone":"pʊʃ"},{"name":"something","trans":["pron Something; something; something important (or noteworthy) to think of; (number) something, roughly, left or right; something similar; really nice; (idea or suggestion)) that makes sense; something like that adv. Very, very; a little, a little"],"usphone":"ˈsʌmθɪŋ","ukphone":"ˈsʌmθɪŋ"},{"name":"wind","trans":["n. Wind; Breathing; Odor; Circumference vt. Winding; twisting; bending; blowing a horn; wrapping or entangling someone vi. Winding; Clockwork; Blowing the horn n. (Wind) name; (English, Germany, Sweden) Wind"],"usphone":"wɪnd","ukphone":"wɪnd"},{"name":"dream","trans":["n. Sleep; dreams, wishes; trance; very beautiful people (or things); fantasies; dreamlike things v. dreaming, dreaming; dreaming; wasting time; thinking; going out of business; imagining adj. ideal, perfect"],"usphone":"driːm","ukphone":"driːm"},{"name":"love","trans":["n. Love; Love; Preference; (nickname) Dear; Loving You; Loving Someone; Favorite Thing; Zero Score v. Love (someone); Caring; Liking (something or something); Loving n. (Love) (English, Philippines, United States) Love (name of person)"],"usphone":"lʌv","ukphone":"lʌv"},{"name":"want","trans":["vt. need; hope; should; lack n. Need; Lack; Poverty; Necessity vi. required; missing"],"usphone":"wɒnt","ukphone":"wɒnt"},{"name":"giraffe","trans":["n.Giraffes"],"usphone":"dʒəˈrɑːf","ukphone":"dʒəˈrɑːf"},{"name":"monkey","trans":["n. Monkeys; urchins vi. Bullshit; trick or treat vt. mockery"],"usphone":"ˈmʌŋki","ukphone":"ˈmʌŋki"},{"name":"tiger","trans":["n. Tiger; Violent person n. (Tiger) name; (English) Tiger; (French) Tigre; (Sweden) Teague"],"usphone":"ˈtaɪɡə(r)","ukphone":"ˈtaɪɡə(r)"},{"name":"winter","trans":["n. Winter; age; depression period vi. Winter adj. Winter's; n. (Winter) person's name for wintering; (English, German, German, German, Russian, Czech, West, Finland, Sweden, France) Winter"],"usphone":"ˈwɪntə(r)","ukphone":"ˈwɪntə(r)"},{"name":"bacon","trans":["n. Bacon; cured meat; smoked pork"],"usphone":"ˈbeɪkən","ukphone":"ˈbeɪkən"},{"name":"breakfast","trans":["n. Breakfast; breakfast vi. Have breakfast vt. Serves breakfast for..."],"usphone":"ˈbrekfəst","ukphone":"ˈbrekfəst"},{"name":"cereal","trans":["n. Cereals, grains; cereal foods; cereal plants adj. Cereals; made from cereals"],"usphone":"ˈsɪəriəl","ukphone":"ˈsɪəriəl"},{"name":"muffin","trans":["n. English muffins (eaten hot with butter), cup-shaped muffins (often containing small pieces of fruit, etc.); muffins"],"usphone":"ˈmʌfɪn","ukphone":"ˈmʌfɪn"},{"name":"toast","trans":["n. Cheers; toasts; people receiving toasts; people who are acclaimed (in some field) vt. Toast to... cheers for... vi. Roast a fire, warm; warm; bake (slices of bread, etc.)"],"usphone":"təʊst","ukphone":"təʊst"},{"name":"yogurt","trans":["n. sour cheese, [food] sour milk (equal to yoghurt)"],"usphone":"ˈjɒɡət","ukphone":"ˈjɒɡət"},{"name":"art","trans":["n. Art (including sculpture, painting, music, etc.), fine art (work); art (work); (performance) art; technology, skill; adj. Artistic; artistic; artistic v. be's present singular second person form, outdated usage"],"usphone":"ɑːt","ukphone":"ɑːt"},{"name":"boss","trans":["n. Boss; boss; foreman vt. Command, dispatch; be the leader of... vi. Be the leader, issue command n. (Boss) name; (English, French, German, Western, Swedish) Boss"],"usphone":"bɒs","ukphone":"bɒs"},{"name":"drive","trans":["v. Driving; (motor vehicle) being driven; owning... a car; driving someone; driving; driving; driving; driving; driving; driving; driving; driving; driving (organized); driving; driving (organized); driving; driving (organized); driving; driving (an organized); driving (an organized); driving (an organized); driving (an organized) activity; driving (a fast lane); pumping; driving (aggressive); driving (aggressive) Attack, mass attack; party to play cards"],"usphone":"draɪv","ukphone":"draɪv"},{"name":"job","trans":["n. Work; occupation vt. Contracting; valet trading vi. Name of person doing odd jobs n. (Job); (English) Job; (French, Portuguese) Rube; (? -1605) Job the Moscow Patriarch of the Russian Orthodox Church. ; (Germany, Serbia, Czech Republic, Netherlands, Italy) Job"],"usphone":"dʒɒb","ukphone":"dʒɒb"},{"name":"teacher","trans":["n. Teacher; tutor n. (Teacher) name; (English) teacher"],"usphone":"ˈtiːtʃə(r)","ukphone":"ˈtiːtʃə(r)"},{"name":"women","trans":["n.Woman (plural of woman)"],"usphone":"'wɪmɪn","ukphone":"'wɪmɪn"},{"name":"blink","trans":["vt. Blink; make... blink vi. Blink; blink n. Blink; moment; flash n. (Blink) person's name; (German) Blink"],"usphone":"blɪŋk","ukphone":"blɪŋk"},{"name":"nighttime","trans":["n. Nighttime adj. nocturnal"],"usphone":"'naɪttaɪm","ukphone":"'naɪttaɪm"},{"name":"rise","trans":["v. Climb; rise; rise; adjourn; (quantity) increase; become more successful; (sound) improve; (wind) blow up; (emotion) increase; (hair) erect; (land) bulge; origin; fermentation n. (quantity or level) increase; increase (rights, etc.); rise; hill; (bait) swim to the surface; source; rank (of stairs); promotion; appearance"],"usphone":"raɪz","ukphone":"raɪz"},{"name":"shine","trans":["vi. emitting light; reflecting light, shining; outstanding, outstanding performance; exposure; shining; revealing; outstanding vt. Irradiate, polish; cast light on...; (mouth) make... shiny or shiny by wiping n. Bright, shiny; good weather; polish; clear; clean leather shoes; ghost trick or trick n. (English) Xian (name of person); (Japanese) Xinrong (name of person)"],"usphone":"ʃaɪn","ukphone":"ʃaɪn"},{"name":"North Pole","trans":["n. Arctic"]},{"name":"reindeer","trans":["n. [spine] [animal husbandry] reindeer"],"usphone":"ˈreɪndɪə(r)","ukphone":"ˈreɪndɪə(r)"},{"name":"Santa","trans":["n. Santa Claus (equivalent to Santa Claus)"],"usphone":"'sæntə","ukphone":"'sæntə"},{"name":"fly","trans":["vi. fly; fly; fly vt. flight; overflight; make it fly n. Fly; fly; two-winged insect adj. An agile n. (Fly) name; (French) Foley; (English) Fry"],"usphone":"flaɪ","ukphone":"flaɪ"},{"name":"floppy","trans":["adj. Soft; crackling; laid-back, sloppy n. Soft disk"],"usphone":"ˈflɒpi","ukphone":"ˈflɒpi"},{"name":"funny","trans":["adj. Funny, funny, funny; (oral) strange, bizarre; sick, uncomfortable; cunning, deceptive (sexual), suspicious, unclear n. Funny characters; jokes, funny stories; funny comic book columns; (English) (for racing) single paddle boats"],"usphone":"ˈfʌni","ukphone":"ˈfʌni"},{"name":"furry","trans":["adj. Furry; fur-covered; fur-like n. (Furry) name; (English) Frey"],"usphone":"ˈfɜːri","ukphone":"ˈfɜːri"},{"name":"fuzzy","trans":["adj. vague; distorted; fuzzy n. (Fuzzy) name; (English) Fuzzy"],"usphone":"ˈfʌzi","ukphone":"ˈfʌzi"},{"name":"hat","trans":["n. Hat vt. Put a hat on... vi. Hat supply; name of the person who made the hat n. (Hat); (Chinese) nuclear (Cantonese, Weitama)"],"usphone":"hæt","ukphone":"hæt"},{"name":"silly","trans":["adj. stupid; unreasonable; dumb n. (Silly) person's name; () Xi; (France) Sealy"],"usphone":"ˈsɪli","ukphone":"ˈsɪli"},{"name":"banjo","trans":["n. Banjo; 5 Strings n. (Banjo) person's name; (Se) Bagno"],"usphone":"ˈbændʒəʊ","ukphone":"ˈbændʒəʊ"},{"name":"fiddle","trans":["n. Violin vi. Just kidding; play the violin vt. Wasting time; playing the violin"],"usphone":"ˈfɪdl","ukphone":"ˈfɪdl"},{"name":"fife","trans":["n. Fife (played with drums in military music) vi. Play yokobue vt. Play n. (Fife) name with a fife; (Italian, Portuguese) Fifi; (English) Fife"],"usphone":"faɪf","ukphone":"faɪf"},{"name":"jam","trans":["n. Jam; overcrowding; dilemma; dunk vt. Block; squeeze in to make full; mix; crush vi. Blocked; knocked on n. (Jam) person's name; (Iran, Baki) Jam"],"usphone":"dʒæm","ukphone":"dʒæm"}]