[{"name":"boat","trans":["n. Small boat; ship vi. rowing"],"usphone":"bəʊt","ukphone":"bəʊt"},{"name":"dock","trans":["n. Wharf; dock; dock; dock; bone and flesh of the tail vt. Let's rely on the pier; shorten vi. Dock in Dock n. (Dock) Program Dock n. (Dock) Name; (Old) Duo; (English, French, Swedish) Dock"],"usphone":"dɒk","ukphone":"dɒk"},{"name":"fish","trans":["n. Fish; Fish; Pisces; Joint Board; (informal) weirdo; (informal) torpedo v. Fishing, fishing; searching; asking for news; salvage; patching n. (Fish) (American, Love) Fish (name of person) with a junction board"],"usphone":"fɪʃ","ukphone":"fɪʃ"},{"name":"lake","trans":["n.Lake; dark red pigment; carmine vt. (Make) hemolytic vi. (To) dissolve blood cells n. (Lake) name; (Germany, Serbia, Sweden) Lark; (English) Lake"],"usphone":"leɪk","ukphone":"leɪk"},{"name":"rock","trans":["n.Rock; rock; rock; reef vt. Shake; shake vi. Shake; shake n. (Rock) name; (English, German, Italian, Swedish) Rock"],"usphone":"rɒk","ukphone":"rɒk"},{"name":"swimsuit","trans":["n.Swimsuit (women)"],"usphone":"ˈswɪmsuːt; ˈswɪmsjuːt","ukphone":"ˈswɪmsuːt; ˈswɪmsjuːt"},{"name":"backyard","trans":["n. Backyard; backyard"],"usphone":"ˌbækˈjɑːd","ukphone":"ˌbækˈjɑːd"},{"name":"ball","trans":["n. Ball; prom vi. Clumps vt. Form a ball n. (Ball) name; (Earth) Baler; (English, Spanish) Ball; (French, German, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Russian, Czech)"],"usphone":"bɔːl","ukphone":"bɔːl"},{"name":"dog","trans":["n. Dogs; scumbags; () friends vt. tracking; trailing"],"usphone":"dɒɡ","ukphone":"dɒɡ"},{"name":"fence","trans":["n. Fences; fences; swordsmanship vt. Protect; use a fence; practice sword fighting vi. Fencing; forging; fencing; jumping over fences"],"usphone":"fens","ukphone":"fens"},{"name":"flower","trans":["n.Flowers; essences; flowering plants vi. maturity, development; flowering; prosperity vt. Make flowers bloom; decorate n. (Flower) people's names with flowers; (English) Flower"],"usphone":"ˈflaʊə(r)","ukphone":"ˈflaʊə(r)"},{"name":"hose","trans":["n. Hoses; stockings; leggings worn by men vt. Use a hose to water; hit"],"usphone":"həʊz","ukphone":"həʊz"},{"name":"swing","trans":["v. Swing; hang; jump; rotate; rotate (on the axis); move (boat, plane) to all positions; (abruptly) turn; walk with a big swing; hang; walk; walk; jump; throw at...; fly (cricket) sideways; change (mood or opinion); gain; have a decisive influence on...; successfully completed; strong sense of rhythm n. Swing; swing; rhythm; light action (cricket) Side flying ball; (politician) A trip with multiple stays; hitting; ups and downs adj. Strong rhythm jazz music; decisive n. (Swing) (American, Swedish, English), Swain (personal name)"],"usphone":"swɪŋ","ukphone":"swɪŋ"},{"name":"tree","trans":["n. Trees; lumber; tree-like objects vt. Catch up... to the tree vi. Climb up a tree; run away from a tree n. (Tree) person's name; (English) Terry"],"usphone":"triː","ukphone":"triː"},{"name":"base","trans":["n. Basis; foundation; base; basic component; base; base (of a transistor); root; base (of a number system); base (of baseball) adj. Despicable; lowly v. uses... as a foundation; places the center of activity of... somewhere n. (Base) (England, America, Ireland) Mase (name of person)"],"usphone":"beɪs","ukphone":"beɪs"},{"name":"baseball","trans":["n. Baseball; baseball sport"],"usphone":"ˈbeɪsbɔːl","ukphone":"ˈbeɪsbɔːl"},{"name":"bat","trans":["n. Bats; bats; rackets; batch file extensions vt. Hit the ball with a bat; the batting rate reached... vi. It's your turn to hit the ball; hit the ball with a bat n. (Bat) name; (Mongolian, English) Bart"],"usphone":"bæt","ukphone":"bæt"},{"name":"helmet","trans":["n. Steel helmet, helmet n. (Helmet) person's name; (Germany) Helmett"],"usphone":"ˈhelmɪt","ukphone":"ˈhelmɪt"},{"name":"team","trans":["n. Team; Group vt. Make cooperation vi. Cooperation n. (Team) name; ()"],"usphone":"tiːm","ukphone":"tiːm"},{"name":"uniform","trans":["adj. Uniform; consistent; identical; balanced; consistent n. Uniform vt. make uniform; make the same"],"usphone":"ˈjuːnɪfɔːm","ukphone":"ˈjuːnɪfɔːm"},{"name":"big","trans":["adj. Big; important; large adv. Massive land; smooth; exaggerating n. (Big) people's names; (Earth) Big"],"usphone":"bɪɡ","ukphone":"bɪɡ"},{"name":"bus","trans":["n. Bus by bus"],"usphone":"bʌs","ukphone":"bʌs"},{"name":"car","trans":["n. Car; car n. (Car) person's name; (Earth) Jarr; (French, Western) Carl; (Se) Tsar"],"usphone":"kɑː(r)","ukphone":"kɑː(r)"},{"name":"dinosaur","trans":["n. Dinosaurs; people or things that are out of date or outdated"],"usphone":"ˈdaɪnəsɔː(r)","ukphone":"ˈdaɪnəsɔː(r)"},{"name":"elephant","trans":["n. Elephant; large drawing paper"],"usphone":"ˈelɪfənt","ukphone":"ˈelɪfənt"},{"name":"house","trans":["n. Homes; households; institutions; parliaments; buildings for a certain purpose vt. Cover; live in... the house; store... in the room vi. Name of person staying in n. (House); (English) House"],"usphone":"haʊs","ukphone":"haʊs"},{"name":"plane","trans":["n. Aircraft; plane; degree, level vi. planing; traveling by plane; soaring vt. Flatten; use a grater; skim over the surface of the water adj. Flat; flat n. (Plane) person's name; (Serbia, Sweden, France) Plane"],"usphone":"pleɪn","ukphone":"pleɪn"},{"name":"cape","trans":["n. [Geography] Cape, cape; cape n. (Cape) name; (Cape) name; (English) Cape"],"usphone":"keɪp","ukphone":"keɪp"},{"name":"sheet","trans":["n. Flakes, paper; sheets vt. Cover; cover with a sheet; make a large sheet vi. It flows in pieces; falls in large pieces adj. Flaky n. (Sheet) person's name; (English) Hitt"],"usphone":"ʃiːt","ukphone":"ʃiːt"},{"name":"stage","trans":["n. Stage; stage; drama; post station vt. Holding; staging; planning vi. Held; suitable for staging; travel by train n. (Stage); (English) Sturge"],"usphone":"steɪdʒ","ukphone":"steɪdʒ"},{"name":"suit","trans":["n. Suit, suit; clothing set (worn for a specific activity); all cards of the same color (in a playing card); a pair of armor; a set of sails; lawsuits; (informal) (influential) senior management; pursuit (particularly marriage proposal); (poetry, writing) (submitted to an authority) v. satisfy (someone) needs; match, fit; fit; fit; fit; (particularly for a specific activity) wear"],"usphone":"suːt; sjuːt","ukphone":"suːt; sjuːt"},{"name":"tie","trans":["v. (use of wire, rope, etc.) tie; tie, tie; tie; tie; tie with..., make a draw; use a cable to connect (note) n. tie; shoelaces; bow ties; rope, wire; relationships, ties; restraint; tie; tie; draw; regardless of victory or loss; (English) knockout tournament (especially soccer); sustain the sound line n. (Tie) (US, Australia, Malaysia) (name of person)"],"usphone":"taɪ","ukphone":"taɪ"},{"name":"wand","trans":["n. Magic wand; wand; scepter; twig; identification pen (equal to wand reader) vt. Use a scanner to scan the barcode n. (Wand) person's name; (English, German) Wand"],"usphone":"wɒnd","ukphone":"wɒnd"},{"name":"bench","trans":["n. Benches; workbenches; substitutes vt. Give... a seat; set up a bench for... n. (Bench) names; (English) Bench; (Germany) Bench; (Dan) Benke"],"usphone":"bentʃ","ukphone":"bentʃ"},{"name":"bike","trans":["n. Bicycles; bicycles vi. Cyclist (or motorcycle) n. (Bike) name; (Dukou, Sai) Bick"],"usphone":"baɪk","ukphone":"baɪk"},{"name":"blue","trans":["adj. Blue; melancholy, pessimistic; bluish (due to cold or trouble breathing), blue-violet; (movie, joke, or story) erotic, yellow; (meat) unripe; (politically) conservative n. blue; blue items; (Oxford or Cambridge University athletes) blue honors; mistakes; redheads; fights vt. (Make) Blue; Dye... Blue; Give... Blue Bleach; Splurge (money) n. (Blue) (UK, US, Canada, Australia, New Zealand) Blue (name of person)"],"usphone":"bluː","ukphone":"bluː"},{"name":"bottle","trans":["n. Bottle; volume of one bottle vt. Control; put... into the bottle vi. Collect coins (after street performers perform)"],"usphone":"ˈbɒtl","ukphone":"ˈbɒtl"},{"name":"playground","trans":["n. Playgrounds, playgrounds; playgrounds"],"usphone":"ˈpleɪɡraʊnd","ukphone":"ˈpleɪɡraʊnd"},{"name":"sky","trans":["n. Sky; vertex vt. Throw... into the air; hang... too high vi. Kick or hit a high-altitude ball; tilt the paddle too high; soar n. (Sky) person's name; (English) Sky"],"usphone":"skaɪ","ukphone":"skaɪ"},{"name":"slide","trans":["v. Slide; walk smoothly; move quietly; gradually deteriorate; depreciate; decline; fall unwittingly; fall; slide; slide; avalanche; slide; avalanche; slide; slide; slide; avalanche; slide device (of a machine or musical instrument); hairpins; light shoes"],"usphone":"slaɪd","ukphone":"slaɪd"},{"name":"letter","trans":["n. Letters; letters, letters; certificates; literature, scholarship; literal meaning vt. Write the letter vi. Write the printed letters n. (Letter) (American, English, Brazil) and Wright (personal name)"],"usphone":"ˈletə(r)","ukphone":"ˈletə(r)"},{"name":"number","trans":["n. Numbers; periods (magazines, etc.); numbers; numbers; arithmetic vi. Included; total reached vt. Number; count; number...; limit the number"],"usphone":"ˈnʌmbə(r)","ukphone":"ˈnʌmbə(r)"},{"name":"page","trans":["n. pages; records; major events, periods; historical chapters; male waiters; youth assistants (to US legislators) vt. Give... page number vi. Go through the pages of the book and browse n. (Page) names; (West) Pach; (English) Paige; (Italy) Paige; (France) Paige"],"usphone":"peɪdʒ","ukphone":"peɪdʒ"},{"name":"title","trans":["n. Championship; title; title; rights; subtitles vt. Add title to; give title; call... adj. Of the champion; of the title; of the title"],"usphone":"ˈtaɪtl","ukphone":"ˈtaɪtl"},{"name":"bookstore","trans":["n. Bookstore (equal to bookshop)"],"usphone":"'bʊkstɔː","ukphone":"'bʊkstɔː"},{"name":"chair","trans":["n. Chairs; lectures; presidency (of conferences); positions of university professors vt. Acting as chairman (of a conference); seating...; name of person taking office n. (Chair); (France) Schell"],"usphone":"tʃeə(r)","ukphone":"tʃeə(r)"},{"name":"helper","trans":["n. Assistant, Helper n. (Helper) person's name; (German) Helper"],"usphone":"ˈhelpə(r)","ukphone":"ˈhelpə(r)"},{"name":"room","trans":["n. Room; space; leeway; opportunity; everyone in the room vt. Provide accommodation for...; rent, share; stay, stay... vi. Residence; Accommodation n. (English) Rum (name); (Russian) Roma (name)"],"usphone":"ruːm; rʊm","ukphone":"ruːm; rʊm"},{"name":"snack","trans":["n. Snacks, snacks; fast food; easy to do, small things v. Eat snacks (or fast food, snacks)"],"usphone":"snæk","ukphone":"snæk"},{"name":"story","trans":["n. Story; novel; description; news report; origin; false story; layer; a unit of measurement (1 story equals 3.3 meters) vt. Decorate with historical story paintings vi. Lying n. (Story) Story (person name)"],"usphone":"ˈstɔːri","ukphone":"ˈstɔːri"},{"name":"beak","trans":["n. [bird] bird's beak; hawk's nose; local law enforcement officer; name of male teacher n. (Beak); (English, Spanish) Beak"],"usphone":"biːk","ukphone":"biːk"},{"name":"chicken","trans":["n. Chicken; chick; coward, coward adj. Chicken's; timid; young"],"usphone":"ˈtʃɪkɪn","ukphone":"ˈtʃɪkɪn"},{"name":"egg","trans":["n.Eggs; eggs; guys; eggs vt. Inciting; instigating n. (Egg) name; (French, English) Egg"],"usphone":"eɡ","ukphone":"eɡ"},{"name":"feather","trans":["n. Feathers vt. Decorate with feathers vi. Long Feather n. (Feather) person's name; (English) Feather"],"usphone":"ˈfeðə(r)","ukphone":"ˈfeðə(r)"},{"name":"feet","trans":["n. Foot (plural form of foot); foot; rhyme"],"usphone":"fiːt","ukphone":"fiːt"},{"name":"leg","trans":["n. leg; pillar"],"usphone":"leɡ","ukphone":"leɡ"},{"name":"tail","trans":["n. Tails; trails; braids; tuxedo vt. Trailing; attaching the tail vi. Track; reduce or decrease adj. coming from behind; tail"],"usphone":"teɪl","ukphone":"teɪl"},{"name":"wings","trans":["n. [Kun] wings (plural form of wing); flight badge; a wing-shaped badge worn by Girl Scouts n. (Wings) name; (de) Wings"]},{"name":"cookie","trans":["n.Cookies; small desserts"],"usphone":"ˈkʊki","ukphone":"ˈkʊki"},{"name":"eggnog","trans":["n.Eggnog"],"usphone":"ˈeɡnɒɡ","ukphone":"ˈeɡnɒɡ"},{"name":"light","trans":["n. Light; light; lamp; lighter; understanding; light color; sunroof adj. Light; light-colored; bright; relaxed; easy; light vi. Light; brighten; ignite vt. Illuminate; ignite; ignite adv. Lightly; clearly; lightly n. (Light) (English) Wright (personal name)"],"usphone":"laɪt","ukphone":"laɪt"},{"name":"meal","trans":["n. One meal, one meal; meal vi. dined"],"usphone":"miːl","ukphone":"miːl"},{"name":"present","trans":["adj. present; present; present; present; present; n. gift; present; present; present; present; present; (verb) present tense; aim (of firing a gun) v. give; present; present; present; make; describe; appear; host (program); perform; present; present; express (check or bill); submit (check or bill); thank you; (church) to take office as pastor who has been recommended by the bishop; formally submitted to the court; aim at a gun; reveal (disease) symptoms"],"usphone":"ˈpreznt","ukphone":"ˈpreznt"},{"name":"stocking","trans":["n. Women's stockings; (men's) stockings; sock-like elastic bandages (especially for the treatment of varicose veins): white spots (on horse calves); Christmas stocking (Christmas stocking) n. (US) Stocking (US) Stocking (name of person)"],"usphone":"ˈstɒkɪŋ","ukphone":"ˈstɒkɪŋ"},{"name":"building","trans":["n. Architecture; Building v. Building; Building; Addition (form of building)"],"usphone":"ˈbɪldɪŋ","ukphone":"ˈbɪldɪŋ"},{"name":"city","trans":["n. City, city adj. urban; metropolitan"],"usphone":"ˈsɪti","ukphone":"ˈsɪti"},{"name":"food","trans":["n. Food; nutrients"],"usphone":"fuːd","ukphone":"fuːd"},{"name":"people","trans":["n. People; humans; nations; citizens vt. live in; fill the occupancy"],"usphone":"ˈpiːpl","ukphone":"ˈpiːpl"},{"name":"sidewalk","trans":["n.Sidewalks"],"usphone":"ˈsaɪdwɔːk","ukphone":"ˈsaɪdwɔːk"},{"name":"step","trans":["n. Steps, steps; steps; steps; steps vi. Step, step; walk vt. Go, take a step"],"usphone":"step","ukphone":"step"},{"name":"street","trans":["n. Street adj. n. (Street) name of the street; (English, Portuguese) Street; (German) Strait"],"usphone":"striːt","ukphone":"striːt"},{"name":"taxi","trans":["n. Taxi; minibus (in Africa); taxi steamer v. (plane) taxiing; taxi delivery"],"usphone":"ˈtæksi","ukphone":"ˈtæksi"},{"name":"noise","trans":["n. [Environmental] noise; noise; noise vt. Rumors vi. Make a sound; talk loudly about n. (Noise) people's names; (English) Neuss"],"usphone":"nɔɪz","ukphone":"nɔɪz"},{"name":"park","trans":["n. Park; [Interchange] Parking lot vt. Parking; placement; storage vi. n. (Park) name of the person who parked the vehicle; (English, Finland, Sweden) Park"],"usphone":"pɑːk","ukphone":"pɑːk"},{"name":"store","trans":["n. Stores; reserves, storage; warehouses vt. Storage, storage n. (Store) name of person; (DE) Storey"],"usphone":"stɔː(r)","ukphone":"stɔː(r)"},{"name":"backpack","trans":["n. Backpacks, backpacks; hiking backpacks vt. Pick up; put... in a backpack vi. Travel with easy luggage; carry"],"usphone":"ˈbækpæk","ukphone":"ˈbækpæk"},{"name":"book","trans":["n. Books; Volumes; Books of Accounts; Roster; Workbooks vt. Reservation; registration n. (Book) name; (Chinese) Bu (Cantonese, Waitama); (North); (English) Booker; (Sweden) Bock"],"usphone":"bʊk","ukphone":"bʊk"},{"name":"classroom","trans":["n. Classroom"],"usphone":"ˈklɑːsruːm; ˈklɑːsrʊm","ukphone":"ˈklɑːsruːm; ˈklɑːsrʊm"},{"name":"desk","trans":["n. Desk; service desk; editorial office; (US) pulpit; music stand adj. The one on the desk; the one used on the desk; the one made from the desk"],"usphone":"desk","ukphone":"desk"},{"name":"eraser","trans":["n. Eraser; eraser; [meter] eraser"],"usphone":"ɪˈreɪzə(r)","ukphone":"ɪˈreɪzə(r)"},{"name":"paper","trans":["n. Paper; paper; document; newspaper adj. Made of paper vt. Use paper paste; wrap with paper vi. Paste the wallpaper; issue a traffic violation summons n. (Paper) name; (Russian) Papel"],"usphone":"ˈpeɪpə(r)","ukphone":"ˈpeɪpə(r)"},{"name":"pencil","trans":["n. Pencils; pen-like objects vt. Write with a pencil; apply vi with an eyebrow pencil. In the shape of a pencil"],"usphone":"ˈpensl","ukphone":"ˈpensl"},{"name":"beach","trans":["n. Beaches; lakeside vt. Drag... ashore vi. Stranded; name of person who settled n. (Beach); (English) Beach"],"usphone":"biːtʃ","ukphone":"biːtʃ"},{"name":"bird","trans":["n. Birds; guys; badminton vt. Cheer for...; cheer vi. Bird hunting; observational study of wild birds n. (Bird) name; (English, Spanish) Bird"],"usphone":"bɜːd","ukphone":"bɜːd"},{"name":"cliff","trans":["n. Cliff; cliff n. (Cliff) name; (English) Cliff"],"usphone":"klɪf","ukphone":"klɪf"},{"name":"coast","trans":["n. Coast; gliding v. gliding; (means of transportation) moving quickly and smoothly; getting past and doing things effortlessly; coastal sailing v. (Coast) (British, American) Coster (name of person)"],"usphone":"kəʊst","ukphone":"kəʊst"},{"name":"lighthouse","trans":["n.Lighthouse"],"usphone":"ˈlaɪthaʊs","ukphone":"ˈlaɪthaʊs"},{"name":"ocean","trans":["n. Ocean; Massive; Broad n. (Ocean) name; (Luo) Ocian"],"usphone":"ˈəʊʃn","ukphone":"ˈəʊʃn"},{"name":"wave","trans":["v. Waving; waving; waving; fluttering; making (hair) slightly wavy n. Ocean waves; heartbeat; emerging person (or object); waving; waves; (hair) curling; (emotional) outbursts"],"usphone":"weɪv","ukphone":"weɪv"},{"name":"colorful","trans":["adj. colorful; interesting; colorful"],"usphone":"ˈkʌləfl","ukphone":"ˈkʌləfl"},{"name":"green","trans":["adj. green; youthful n. green; youth vt. Make... green vi. Turn green n. (Green) person's name; (English, Italian) Greene; (Sweden, Finn) Glenn"],"usphone":"ɡriːn","ukphone":"ɡriːn"},{"name":"orange","trans":["n. Orange, tangerine; orange juice, tangerine drink; orange tree, orange tree; orange, orange; orange yellow butterfly adj. Orange-red, orange-yellow; n. (Orange) (American, French, Russian, English) of the Orange Party or Society; Olinch (personal name)"],"usphone":"ˈɒrɪndʒ","ukphone":"ˈɒrɪndʒ"},{"name":"pink","trans":["adj. pink; homosexual; slightly left-leaning, more aggressive; caryophyllaceae; ruddy; excited-n. pink; pink; (informal) left-leaning people; elite, model; caryophyllaceae; pointed sailboats; (old) yellowish pigment v. (car engine) explodes; turns pink; jagged; punches, stabs, pokes; ridicule, criticism; (close fit) cut (wool) n. (Pink) (pink) (pink) Canada, Germany, Philippines) Pink (personal name)"],"usphone":"pɪŋk","ukphone":"pɪŋk"},{"name":"purple","trans":["adj. purple; imperial; flashy n. purple; purple robe vi. Turned purple vt. Make purple"],"usphone":"ˈpɜːpl","ukphone":"ˈpɜːpl"},{"name":"red","trans":["adj. Red, red; (hair) reddish brown; (face) reddish; (eyes) red; (eyes) red; revolutionary, aggressive; (human) red; red (wine) red; (wine) red; (indicating stop) red (light), red (flag); prohibited, dangerous; (indicated by red signs on ski trails) second most difficult; (physical) red, one of the three colors of quark; red (especially when used in the Cold War); stained with blood; (ancient or poetry/literature) bleeding; (Xhosa) n. red, red pigment from traditional tribal culture ; red coat; red wine; red thing (or person); deficit, deficit; activist n. (Red) Red (person name)"],"usphone":"red","ukphone":"red"},{"name":"yellow","trans":["adj. Yellow; yellow-skinned adj. timid n. Yellow; yellow people; yellow pigment vi. Yellowing or yellowing vt. Yellowing or yellowing"],"usphone":"ˈjeləʊ","ukphone":"ˈjeləʊ"},{"name":"bug","trans":["n. Bugs, bugs; malfunctions; eavesdropping devices vt. Disturb, disturb; install an eavesdropping device vi. install an eavesdropping device; disrupt"],"usphone":"bʌɡ","ukphone":"bʌɡ"},{"name":"five","trans":["n. Five, five; five dollar bill num. Five, five adj. Five's; five n. (five) names; () Fifer"],"usphone":"faɪv","ukphone":"faɪv"},{"name":"four","trans":["num. Four, four n. A group of four people (or things); (cricket) one hit in four; (clothes, etc.) number four; four-point cards; four-bar rowing, four-person rowing team adj. Four; four n. (Four) (French, US) Faure (personal name)"],"usphone":"fɔː(r)","ukphone":"fɔː(r)"},{"name":"many","trans":["det. A lot of prons. Many; many people adj. Many n. Most people n. (Many) (US, France, Canada, India) Mani (name of person)"],"usphone":"ˈmeni","ukphone":"ˈmeni"},{"name":"one","trans":["num. One; one; one year old; one hour pron. A person; any person, people (general term); that person; that kind of person (specified) det. one (emphasizes someone or something); one (for a more similar person or thing); some (before the name of someone you don't know) adj. unique; one n. 1; one dollar note n. (One) (India, Malaysia, US) Wen (name of person)"],"usphone":"wʌn","ukphone":"wʌn"},{"name":"seven","trans":["num. Seven, seven n. Seven people; seven o'clock; seven-year-old adj. Seven; seven n. (Seven) (Turkish, French, Russian), Xie Wen (personal name)"],"usphone":"ˈsevn","ukphone":"ˈsevn"},{"name":"six","trans":["num. Number 6; six; a group of six people (or things); six years old; six o'clock n. (six) (American, German) six (name)"],"usphone":"sɪks","ukphone":"sɪks"},{"name":"three","trans":["n. Three, three num. Three adj. Three, three"],"usphone":"θriː","ukphone":"θriː"},{"name":"two","trans":["n. Two adj. Two nums. two"],"usphone":"tuː","ukphone":"tuː"},{"name":"word","trans":["n. [language] words; words; messages; promises; orders vt. Use words to express n. (Word) person's name; (English) Ward"],"usphone":"wɜːd","ukphone":"wɜːd"},{"name":"animal","trans":["n. Animals Animal's"],"usphone":"ˈænɪml","ukphone":"ˈænɪml"},{"name":"cow","trans":["n. Cows, cows; mother beasts vt. threats, intimidation"],"usphone":"kaʊ","ukphone":"kaʊ"},{"name":"duck","trans":["n. Duck; duck meat; (English) baby; zero point vi. Evade; submerge in water vt. Dodge; press... to enter the water n. (Duck) name; (German, Portuguese,) Duke"],"usphone":"dʌk","ukphone":"dʌk"},{"name":"goat","trans":["n. Goats; scapegoats (beauty ghosts); color ghosts (beauty ghosts)"],"usphone":"ɡəʊt","ukphone":"ɡəʊt"},{"name":"pig","trans":["n. Pigs; pork vi. Give birth to a little pig; live like a pig n. Police (slang, aggressive)"],"usphone":"pɪɡ","ukphone":"pɪɡ"},{"name":"sheep","trans":["n. Sheep, sheep; cowards"],"usphone":"ʃiːp","ukphone":"ʃiːp"},{"name":"boot","trans":["n. Boots; kick; car suitcase; dismissal; wheel clamp lock; v. kick; start; install brakes on wheels; dismissal; (make) wear boots; lock (wheels parked illegally) n. (Boot) (American, English, Dutch, Canadian, German, Italian, Russian) Boot (person name)"],"usphone":"buːt","ukphone":"buːt"},{"name":"mask","trans":["n. Mask; mask; disguise vi. Disguise; wear a mask; dress up vt. disguise; wear a mask; blur"],"usphone":"mɑːsk","ukphone":"mɑːsk"},{"name":"scarf","trans":["n. Scarves; inlays, joints; headscarves, scarves vt. inlay; use a scarf to surround n. (scarf) person's name; (English) scarf [plural scarves or scarves]"],"usphone":"skɑːf","ukphone":"skɑːf"},{"name":"sunglasses","trans":["n. Sunglasses; convex lenses (plural of sunglasses)"],"usphone":"ˈsʌnɡlɑːsɪz","ukphone":"ˈsʌnɡlɑːsɪz"},{"name":"sweater","trans":["n. Sweaters, sweatshirts; people who sweat a lot, diaphoretics"],"usphone":"ˈswetə(r)","ukphone":"ˈswetə(r)"},{"name":"blanket","trans":["n. Blanket, blanket; blanket-like object, covering layer adj. All in one; unlimited vt. cover, cover up; cover with a blanket"],"usphone":"ˈblæŋkɪt","ukphone":"ˈblæŋkɪt"},{"name":"fort","trans":["n. Forts; fortresses; (US) border trading posts vt. Set up a fortress to defend vi. Name of person who built the fortress n. (Fort); (France) Faure; (German, English, Spanish, Portuguese, Russian) Ford"],"usphone":"fɔːt","ukphone":"fɔːt"},{"name":"friend","trans":["n. Friend; Assistant; Sponsor n. (Friend) Name; (English) Flanders"],"usphone":"frend","ukphone":"frend"},{"name":"game","trans":["n. Games; contests; prey adj. Brave vi. Gambling n. (Game) name; (English) Gam; (French) Gam; (West) Game"],"usphone":"ɡeɪm","ukphone":"ɡeɪm"},{"name":"pillow","trans":["n. Pillows vt. Pad; place a pillow on...; place... on vi. Pilling; resting on a pillow n. (Pillow) person's name; (English) Pillow"],"usphone":"ˈpɪləʊ","ukphone":"ˈpɪləʊ"},{"name":"bean","trans":["n. Beans; spout; worthless things vt. Click on the head of... n. (Bean) person's name; (English) Bean"],"usphone":"biːn","ukphone":"biːn"},{"name":"corn","trans":["n. (US) corn; (English) grains; [skin] corns vt. Marinate; granulate n. (Corn) person's name; (English, French, Swedish) Cohn"],"usphone":"kɔːn","ukphone":"kɔːn"},{"name":"garden","trans":["n. Garden; vegetable garden vt. Cultivated flowers and trees vi. Engaged in gardening; planting n. (Garden) name in the garden; (English, Italian, Baki) Garden"],"usphone":"ˈɡɑːdn","ukphone":"ˈɡɑːdn"},{"name":"melon","trans":["n. Melon; melon; big belly; round drum like a melon n. (Melon) name; (Italian, Spanish, Portuguese) Meron"],"usphone":"ˈmelən","ukphone":"ˈmelən"},{"name":"onion","trans":["n.Onions; onion heads"],"usphone":"ˈʌnjən","ukphone":"ˈʌnjən"},{"name":"peas","trans":["n. [crop] pea (plural of pea)"]},{"name":"potato","trans":["n. [crop] potato, [crop] potato"],"usphone":"pəˈteɪtəʊ","ukphone":"pəˈteɪtəʊ"},{"name":"tomato","trans":["n.Tomato, tomato"],"usphone":"təˈmɑːtəʊ","ukphone":"təˈmɑːtəʊ"},{"name":"cat","trans":["n.Cats, feline animals"],"usphone":"kæt","ukphone":"kæt"},{"name":"go","trans":["vi. Go; reach; run; tend to n. Go; carry on; try vt. endure; give birth; bet on..."],"usphone":"ɡəʊ","ukphone":"ɡəʊ"},{"name":"dream","trans":["n. Sleep; dreams, wishes; trance; very beautiful people (or things); fantasies; dreamlike things v. dreaming, dreaming; dreaming; wasting time; thinking; going out of business; imagining adj. ideal, perfect"],"usphone":"driːm","ukphone":"driːm"},{"name":"kiss","trans":["v. Kiss, kiss; (wind, etc.) lightly flick, touch; (ball) gently wipe (another ball) n. Kiss; (wind, etc.) lightly flick; (one ball to another); shortbread n. (Kiss) (Hungary, US, Romania) Kish (name of person)"],"usphone":"kɪs","ukphone":"kɪs"},{"name":"Moon","trans":["n. Moon; Moon; Moonlight; Satellites vi. Laid-back; astonished vt. Hudu n. (Moon) name; (Sweden) Meng; () Meng; (English) Moon; (Myanmar) Meng"],"usphone":"muːn","ukphone":"muːn"},{"name":"forest","trans":["n. Forest, wooded area; a thicket (similar to a forest); royal woodland, hunting grounds v. planted in; covered by forest n. (Forest) Forest (name of person)"],"usphone":"ˈfɒrɪst","ukphone":"ˈfɒrɪst"},{"name":"frog","trans":["n. Frog; [Railway] fork; buckle vi. Frog catcher n. (Frog) name; (Russian) Frog"],"usphone":"frɒɡ","ukphone":"frɒɡ"},{"name":"insect","trans":["n.Insects; scumbags"],"usphone":"ˈɪnsekt","ukphone":"ˈɪnsekt"},{"name":"leaf","trans":["n. A leaf; a sheet (of a book, etc.); fan page vi. Fresh leaves; turning book pages vt. Turn the page of... and hurriedly read n. (Leaf) person's name; (English) Leaf"],"usphone":"liːf","ukphone":"liːf"},{"name":"lizard","trans":["n. Lizard; lizard-like reptile n. (Lizard) name; (France) Rizal"],"usphone":"ˈlɪzəd","ukphone":"ˈlɪzəd"},{"name":"moss","trans":["n. Moss; quagmire vt. Name of the person who made moss n. (Moss); (English, German, Italian, Spanish, Portuguese, Poland, Norway, Sweden) Moss"],"usphone":"mɒs","ukphone":"mɒs"},{"name":"snake","trans":["n. Snakes; insidious people vi. Take a detour vt. Pull (timber, etc.); take a detour"],"usphone":"sneɪk","ukphone":"sneɪk"},{"name":"bathtub","trans":["n.Bathtub"],"usphone":"ˈbɑːθtʌb","ukphone":"ˈbɑːθtʌb"},{"name":"grass","trans":["n. Grass; grass, lawn vt. Graze; make... grow grass; make... eat grass vi. Long grass n. (Grass) name; (French, German, Russian, Swedish, English) Glass"],"usphone":"ɡrɑːs","ukphone":"ɡrɑːs"},{"name":"in","trans":["prep. In...; in...; in...; during...; in...; in...; in...; included in...; engaged in...; engaged...; used in... language, with... medium; in the process of (activity); in... years; when...; (derives the name of a person with a certain quality); in... (used between larger and lesser numbers); in... quantity; in... color; in... manner; has characteristics; according to (representation) adv. Entering; inside; arriving; elected; high tide; in the house; at the station; receiving; submitting, delivering; filling in, coloring; facing inward, in the middle; hitting; (ball) falling within the boundary; (clothing, etc.) fashionable adj. Inside; fashionable; n. rulers within the (ball) world; doorway"],"usphone":"ɪn; ˈɪn ðət","ukphone":"ɪn; ˈɪn ðət"},{"name":"mud","trans":["n. Mud; slander; (informal) cheers v. Stain, paint with mud"],"usphone":"mʌd","ukphone":"mʌd"},{"name":"wagon","trans":["n. Trucks, four-wheeled carriages vt. Carrying goods in a wagon n. (Wagon) name; (France, Germany) Wagon"],"usphone":"ˈwæɡən","ukphone":"ˈwæɡən"},{"name":"water","trans":["n. Water; seawater; rainwater; ocean, large areas of water vt. Moisten; supply water; water... vi. Adding water; crying; drooling n. (Water) person's name; (English) Water"],"usphone":"ˈwɔːtə(r)","ukphone":"ˈwɔːtə(r)"},{"name":"acorn","trans":["n. [Plant] acorns; [Forest] acorns"],"usphone":"ˈeɪkɔːn","ukphone":"ˈeɪkɔːn"},{"name":"apple","trans":["n. An apple, an apple tree, something like an apple; [American] bombs, grenades, (baseball) balls; [American] people, guys."],"usphone":"ˈæpl","ukphone":"ˈæpl"},{"name":"jacket","trans":["n. Down ski shirts; short suit jackets; short blouses, jackets; potato skins; book covers; document holders, briefcases vt. Put on... a jacket; put a jacket on...; put a protective seal on...; hit the 'mouth'"],"usphone":"ˈdʒækɪt","ukphone":"ˈdʒækɪt"},{"name":"pumpkin","trans":["n.Pumpkin"],"usphone":"ˈpʌmpkɪn","ukphone":"ˈpʌmpkɪn"},{"name":"rake","trans":["n. Rake, target; prodigal; inclination (especially of a theater stage); front blade surface (of a cutting tool); bus cabin v. raking with a rake; shooting; searching; scratching (with branches or fingernails); (with a rake) to slant (the mast or chimney) towards the stern of the stern; determining the degree of inclination (especially of the stage) n. (Rake) (American, Indian) Lake (name of person)"],"usphone":"reɪk","ukphone":"reɪk"},{"name":"deer","trans":["n. Deer n. (Deer) person's name; (English) Deer"],"usphone":"dɪə(r)","ukphone":"dɪə(r)"},{"name":"fox","trans":["n. Fox; cunning person; fox skin; vixen, sexy woman v. Can't guess; deceive, confuse; use cunning methods n. (Fox) (England, America, Germany, Dan, Love) Fox (name of person)"],"usphone":"fɒks","ukphone":"fɒks"},{"name":"girl","trans":["n. Girl; girl, unmarried woman; female employee, actress; (man's) girlfriend n. (Girl) (Jie) Jill (personal name)"],"usphone":"ɡɜːl","ukphone":"ɡɜːl"},{"name":"jump","trans":["v. Jumping; crossing; moving fast; surging, skyrocketing; abrupt change; omitting; running a red light; raid; having sex; boosting starting (vehicle) n. Jump; skyrocket; drastic change; shock jump; obstacle (in an equestrian game); (bridge) jumping; sexual intercourse n. (Jump) (US) Jiang Pu (name of person)"],"usphone":"dʒʌmp","ukphone":"dʒʌmp"},{"name":"over","trans":["Adv. fall; flip; pass through; fully covered; above; greater than; again; end; change; finish; carefully prep. Above...; above...; crossing; on the other side of...; at the far end of...; falling from...; all over; more than; during; passing; passing; over; because; about; using; passing; sound greater than; above; above...; priority; over; over n. (cricket) of pitching in a round adj. Fallen; folded; finished; remaining v. crossing n. (Over) (American, English, German) Orwell (name of person)"],"usphone":"ˈəʊvə(r)","ukphone":"ˈəʊvə(r)"},{"name":"jungle","trans":["n. Jungle, dense forest; dangerous zone adj. of the jungle; wild"],"usphone":"ˈdʒʌŋɡl","ukphone":"ˈdʒʌŋɡl"},{"name":"monkey","trans":["n. Monkeys; urchins vi. Bullshit; trick or treat vt. mockery"],"usphone":"ˈmʌŋki","ukphone":"ˈmʌŋki"},{"name":"tiger","trans":["n. Tiger; Violent person n. (Tiger) name; (English) Tiger; (French) Tigre; (Sweden) Teague"],"usphone":"ˈtaɪɡə(r)","ukphone":"ˈtaɪɡə(r)"},{"name":"baby","trans":["n. Babies, babies; childish people vt. Indulge, treat... like a baby adj. Baby's; baby's n. (Baby) name; (French, Portuguese) Bobby; (English) Bobby, Barbie (female name); (Russian) Babi"],"usphone":"ˈbeɪbi","ukphone":"ˈbeɪbi"},{"name":"little","trans":["adj. Small; few; short; small and cute adv. Not at all n. Few; not many; short term n. (Little) person's name; (English) Little"],"usphone":"ˈlɪtl","ukphone":"ˈlɪtl"},{"name":"mouse","trans":["n. Mouse; mouse; timid and shy person vt. Discovery vi. Mousetraking; spying"],"usphone":"maʊs","ukphone":"maʊs"},{"name":"bag","trans":["n. Bags; bags; prey; () a bottle of beer vt. Hunt; bag...; give up; score points; seize, misappropriate; expand; destroy vi. sagging; deformation"],"usphone":"bæɡ","ukphone":"bæɡ"},{"name":"carrot","trans":["n.Carrot bait"],"usphone":"ˈkærət","ukphone":"ˈkærət"},{"name":"lunch","trans":["n. Lunch v. Eat lunch; provide lunch vi. Eat lunch; provide lunch"],"usphone":"lʌntʃ","ukphone":"lʌntʃ"},{"name":"milk","trans":["n. Milk; emulsion vt. Extracting; squeezing the milk of... vi. Milking n. (Milk) name; (English) Milk"],"usphone":"mɪlk","ukphone":"mɪlk"},{"name":"napkin","trans":["n. Napkins; napkins; diapers"],"usphone":"ˈnæpkɪn","ukphone":"ˈnæpkɪn"},{"name":"noodle","trans":["n.Noodles; idiot"],"usphone":"ˈnuːdl","ukphone":"ˈnuːdl"},{"name":"farmer","trans":["n. Farmer, farmer n. (Farmer) name; (English) Farmer; (French) Farmer; (West) Farmer"],"usphone":"ˈfɑːmə(r)","ukphone":"ˈfɑːmə(r)"},{"name":"jam","trans":["n. Jam; overcrowding; dilemma; dunk vt. Block; squeeze in to make full; mix; crush vi. Blocked; knocked on n. (Jam) person's name; (Iran, Baki) Jam"],"usphone":"dʒæm","ukphone":"dʒæm"},{"name":"market","trans":["n. Market; market; stock market; market; bazaar; sales channel; store vt. Selling on the market vi. Name of person doing business n. (Market); (Ce) Marquette"],"usphone":"ˈmɑːkɪt","ukphone":"ˈmɑːkɪt"},{"name":"tent","trans":["n. Tents; residences; curtains vt. Cover it with a tent; make it possible to stay in a tent vi. Living in a tent; name of a person temporarily residing n. (Tent); (Russia, Sweden) tent"],"usphone":"tent","ukphone":"tent"},{"name":"vegetable","trans":["n. Vegetables; plants; plant people adj. vegetable; vegetable"],"usphone":"ˈvedʒtəbl","ukphone":"ˈvedʒtəbl"},{"name":"eye","trans":["n. Eyes; Sight; Vision; Opinions, Opinions vt. Watch and see n. (Eye) names; (German) Aye; (English) Ai"],"usphone":"aɪ","ukphone":"aɪ"},{"name":"help","trans":["vt. help; promote; cure; remedy n. Help; remedy; helper; something beneficial vi. help; useful; welcome n. (Help) person's name; (Fen) Help"],"usphone":"help","ukphone":"help"},{"name":"love","trans":["n. Love; Love; Preference; (nickname) Dear; Loving You; Loving Someone; Favorite Thing; Zero Score v. Love (someone); Caring; Liking (something or something); Loving n. (Love) (English, Philippines, United States) Love (name of person)"],"usphone":"lʌv","ukphone":"lʌv"},{"name":"smile","trans":["v. Smile; express with a smile; show (some kind of smile) n. Smile, smile; happy color n. (Smile) (Russian, Indian, American) Smiley (name of person)"],"usphone":"smaɪl","ukphone":"smaɪl"},{"name":"tuck","trans":["vt. Roll up; squeeze in; wrap something comfortably; fold; fold; fold; stink; hide vi. Pleats; constricted; comfortably wrapped inside; large mouth n. Food; Protruding stern; creases; knee-hugging diving; vitality; drumming n. (Tuck) (English, American, Ai) Tuck (name of person); (Southeast Asia) Germany (name of person)"],"usphone":"tʌk","ukphone":"tʌk"},{"name":"voice","trans":["n. Voice; Voice; Right to Speak; Wish vt. Expression; disclosure"],"usphone":"vɔɪs","ukphone":"vɔɪs"},{"name":"line","trans":["n. Route, route; row; rope vt. Line up; line up; mark with lines; make... wrinkle vi. Line up; stand in a row n. (Line) names; (English) Ryan; (Russian) Ligne"],"usphone":"laɪn","ukphone":"laɪn"},{"name":"movie","trans":["n. Film; cinema; film industry adj. Of the movie"],"usphone":"ˈmuːvi","ukphone":"ˈmuːvi"},{"name":"popcorn","trans":["n.Popcorn, popcorn"],"usphone":"ˈpɒpkɔːn","ukphone":"ˈpɒpkɔːn"},{"name":"screen","trans":["n. Screen, curtain; screen vt. Screening; filming; screening; masking vi. Name of person who made the movie n. (Screen); (English) Skrin"],"usphone":"skriːn","ukphone":"skriːn"},{"name":"seat","trans":["n. Seat; location; position vt. Sit down...; accommodate...; put into office"],"usphone":"siːt","ukphone":"siːt"},{"name":"ticket","trans":["n. Tickets; entrance tickets, labels; (US) candidate lists; certificates; traffic fines vt. Tag; assign; issue a traffic violation ticket against..."],"usphone":"ˈtɪkɪt","ukphone":"ˈtɪkɪt"},{"name":"bath","trans":["n. Bathing; bathroom; bidet vt. Bathing vi. showering"],"usphone":"bɑːθ","ukphone":"bɑːθ"},{"name":"bubble","trans":["n. Bubbles, bubbles, bubbles; transparent round cover, round top vi. Boiling, bubbling; making a bubbling sound vt. make bubbles; talk nonstop"],"usphone":"ˈbʌbl","ukphone":"ˈbʌbl"},{"name":"shampoo","trans":["n. Shampoo; shampoo vt. shampoo"],"usphone":"ʃæmˈpuː","ukphone":"ʃæmˈpuː"},{"name":"soap","trans":["n. Soap vt. Spread soap on...; pat... (slang) vi. Scrub with soap"],"usphone":"səʊp","ukphone":"səʊp"},{"name":"towel","trans":["n. Towel, hand towel; [paper] tissue vt. Wipe off with a towel vi. Dry your body with a towel"],"usphone":"ˈtaʊəl","ukphone":"ˈtaʊəl"},{"name":"tub","trans":["n. Tub; bucket vt. Put... in a bucket; take a bath for... vi. Tub bath; (clothes, etc.) are washed in a bucket"],"usphone":"tʌb","ukphone":"tʌb"},{"name":"belt","trans":["n. Belt; belt; zone vt. Fasten it with a strap; hit it with a belt vi. Attack n. (Belt) person's name; (English, French, German, Spanish) Belt"],"usphone":"belt","ukphone":"belt"},{"name":"closet","trans":["n. Closets; conference rooms, secret rooms; small rooms adj. Secret, private; empty talk vt. Lock... in a private room n. (Closet) person's name; (France) Clause"],"usphone":"ˈklɒzɪt","ukphone":"ˈklɒzɪt"},{"name":"hanger","trans":["n. Clothes hanger; hook; name of person who executed the hanging n. (Hanger); (English) hanger"],"usphone":"ˈhæŋə(r)","ukphone":"ˈhæŋə(r)"},{"name":"pants","trans":["n.Pants"],"usphone":"pænts","ukphone":"pænts"},{"name":"shoe","trans":["n. Shoes; horseshoes; outer tube vt. Put on... shoes; wear... shoes n. (Shoe) name of person; (English) Hugh"],"usphone":"ʃuː","ukphone":"ʃuː"},{"name":"basket","trans":["n. Basket; score (in a basketball game); amount of basket; basket vt. Load into basket"],"usphone":"ˈbɑːskɪt","ukphone":"ˈbɑːskɪt"},{"name":"candy","trans":["n. Candy, chocolate; rock sugar; drugs (packaged in candy); things you don't see and use; v. make... into compote; cook with sugar; crystallize"],"usphone":"ˈkændi","ukphone":"ˈkændi"},{"name":"dress","trans":["n. Dress; (specific type) clothing v. (for...) dressing; wearing formal clothing; providing clothing for...; cleaning up (wounds); decorating; processing, treating (ingredients, wood, etc.); arranging neatly '; design (hairstyle) n. (dress) (beauty, bar) dress (name of person)"],"usphone":"dres","ukphone":"dres"},{"name":"Easter","trans":["n. Easter"],"usphone":"ˈiːstə(r)","ukphone":"ˈiːstə(r)"},{"name":"family","trans":["n. Family; Relatives; Family; Children; [Family] Family; Language Group; [Chemical] Family adj. Family's; family's; suitable for the whole family"],"usphone":"ˈfæməli","ukphone":"ˈfæməli"},{"name":"brother","trans":["n. Brothers; Colleagues; Comrades int. My dude! n. (Brother) name; (English) Blazer"],"usphone":"ˈbrʌðə(r)","ukphone":"ˈbrʌðə(r)"},{"name":"father","trans":["n. Father, father; priest; ancestor; senior vt. Invented, founded; being the father of..."],"usphone":"ˈfɑːðə(r)","ukphone":"ˈfɑːðə(r)"},{"name":"grandfather","trans":["n. Grandfather; ancestor v. Not subject to new regulations"],"usphone":"ˈɡrænfɑːðə(r)","ukphone":"ˈɡrænfɑːðə(r)"},{"name":"grandmother","trans":["n. Grandmother; female ancestor vt. Being the grandmother of... vi. Being a grandmother"],"usphone":"ˈɡrænmʌðə(r)","ukphone":"ˈɡrænmʌðə(r)"},{"name":"me","trans":["pron I (binger) n. self; an extremely selfish person; part of the self n. (Me) name; (Japanese) Ma (surname); (North Korea); (Arabic, Chinese, old) Mei"],"usphone":"miː","ukphone":"miː"},{"name":"mother","trans":["n. Mother; Maiden; abbot vt. Give birth; nurture; care or care like a mother adj. Mother's; birthplace"],"usphone":"ˈmʌðə(r)","ukphone":"ˈmʌðə(r)"},{"name":"my","trans":["pron My int. Oops (indicates surprise, etc.); Uh-huh n. (My) name; (Yue) beauty; (Lao, Kan) Mi"],"usphone":"maɪ","ukphone":"maɪ"},{"name":"sister","trans":["n. Sisters; (called like-minded people) sisters; nuns; nurses adj. sisterly; same type"],"usphone":"ˈsɪstə(r)","ukphone":"ˈsɪstə(r)"},{"name":"hoe","trans":["n. Hoe, (long handle) hoe v. hoe, hoeing (or weeding) with a hoe n. (Hoe) Ho (name of person)"],"usphone":"həʊ","ukphone":"həʊ"},{"name":"plant","trans":["n. Factories, workshops; plants; equipment; crops vt. Plant; cultivate; cultivate; place vi. Name of the person who planted n. (Plant); (English, Spanish, Italian) Plant; (France) Prand"],"usphone":"plɑːnt","ukphone":"plɑːnt"},{"name":"seed","trans":["n. Seed; basis; semen; germination; offspring; origin vt. Sowing; fruiting; maturing; leaving... seeds vi. Sowing; (plant) fruiting n. (Seed) person's name; (English) seed"],"usphone":"siːd","ukphone":"siːd"},{"name":"shovel","trans":["n. Shovel; quantity of a shovel; forklift vt. Eradicate; dig with a shovel; tuck... randomly into vi. shovel"],"usphone":"ˈʃʌvl","ukphone":"ˈʃʌvl"},{"name":"bow","trans":["n. Bow; bow; bow; bow; bow v. bow, nod; lower (head); submit; (make) bend; pull (string instrument) with a bow n. (Bow) (American, English, Ireland) Bow (name of person)"],"usphone":"baʊ","ukphone":"baʊ"},{"name":"bowl","trans":["n. Bowls; wooden balls; wine glasses vi. Play bowling; slide; move smoothly and quickly vt. Pitching; rotation; smooth and fast movement"],"usphone":"bəʊl","ukphone":"bəʊl"},{"name":"box","trans":["n. Box, box; private room; one punch vi. Boxing vt. Boxing; packed... in a box; slap n. (Box) person's name; (English, French, Spanish) box"],"usphone":"bɒks","ukphone":"bɒks"},{"name":"day","trans":["n. Day; period; daytime adv. Every day; often during the day adj. Daytime; daily n. (Day) names; (English, French, Spanish) Dai; (Vietnamese) Dai; (Arabic, Turkish) Dai"],"usphone":"deɪ","ukphone":"deɪ"},{"name":"gift","trans":["n. Gifts; Talents; Freebies vt. give; give to... n. (Gift) person's name; (English) gift"],"usphone":"ɡɪft","ukphone":"ɡɪft"},{"name":"hug","trans":["v. Hug; hold tight; hold tight; hold tight; hold, hold on; hold (your body or something) n. Hug; (in wrestling) hold n. (Hug) (US, Mexico, West) Rain Ge (person's name)"],"usphone":"hʌɡ","ukphone":"hʌɡ"},{"name":"bread","trans":["n. Bread; livelihoods vt. Sprinkle bread crumbs on..."],"usphone":"bred","ukphone":"bred"},{"name":"candle","trans":["n. Candles; candlelight; candle-shaped objects vt. Check against light"],"usphone":"ˈkændl","ukphone":"ˈkændl"},{"name":"Hanukkah","trans":["n. Hanukah (Jewish holiday, equivalent to Chanukah)"],"usphone":"ˈhænʊkə; ˈxænʊkə","ukphone":"ˈhænʊkə; ˈxænʊkə"},{"name":"toy","trans":["n. Toys; small ornaments; worthless items vi. Play; flirt; treat adj casually. As a toy; n. (Toy) (US) Toy (name of person) that looks like a toy"],"usphone":"tɔɪ","ukphone":"tɔɪ"},{"name":"door","trans":["n. Door; home, door; doorway; channel n. (Door) person's name; (English) Dole"],"usphone":"dɔː(r)","ukphone":"dɔː(r)"},{"name":"school","trans":["n. School; college; school; fish group vt. education"],"usphone":"skuːl","ukphone":"skuːl"},{"name":"walk","trans":["v. Walking, walking; walking; walking; walking; accompanying... walking; being stolen; (ghost) infestation; (informal) release from suspicion; (baseball) free entry; (ancient) life; guide...; (informal) abandon n. walk, walk; path; (postman's) delivery route; forest area (ranger); forest area under the jurisdiction of (rangers); cockfighting farm; beagle breeding farm; leisurely pace; (baseball) free landing (n) walk (n) US) Walker (name)"],"usphone":"wɔːk","ukphone":"wɔːk"},{"name":"window","trans":["n. window; window; window"],"usphone":"ˈwɪndəʊ","ukphone":"ˈwɪndəʊ"},{"name":"giraffe","trans":["n.Giraffes"],"usphone":"dʒəˈrɑːf","ukphone":"dʒəˈrɑːf"},{"name":"horse","trans":["n. Horses; cavalry; tripods; heroin vt. Make a horse ride; tie a horse to; tease vi. Horseback riding; making fun of person n. (Horse); (Sweden) Holser"],"usphone":"hɔːs","ukphone":"hɔːs"},{"name":"nap","trans":["n. Take a nap, take a nap; fine hair; do whatever you want vt. Pull hair vi. Take a nap; omission n. (Nap) name; (North Korea, Vietnam) Na"],"usphone":"næp","ukphone":"næp"},{"name":"bed","trans":["n. Bed; foundation; river bottom, seabed vt. Make it sleep; place it; embed it; plant vi. Going to bed; layering"],"usphone":"bed","ukphone":"bed"},{"name":"rug","trans":["n. Small rug; fur rug; men's wig n. (Rug) name; (Se) Ruger"],"usphone":"rʌɡ","ukphone":"rʌɡ"},{"name":"bee","trans":["n. Honeybee, bee; hardworking person n. (Bee) name; (); (Chinese in Southeast Asian countries) US; (English) bee (female educational names Beatrix and Beatrice)"],"usphone":"biː","ukphone":"biː"},{"name":"kid","trans":["n. Kids; Little Goats vt. Deceive; make fun of; tease vi. deceive; make fun of; make fun of adj. Made of small goatskin; younger n. (Kid) name; (English) Kidd"],"usphone":"kɪd","ukphone":"kɪd"},{"name":"bear","trans":["v. endure, bear; be unfit for something; bear responsibility; bear responsibility; bear (emotion, especially bad mood); support; display; carry; (car, boat) transport; birth (child); actually, blossom (formal); turn; take a turn; be proportionate (by name, title); perform; have (mark, characteristics); blow; have (name or title); write; have (similarity or relationship); generate (interest) n. bear; bear (interest) n. bear; sell (stock) Empty person; (informal) uneducated person; heavy man; (informal) “polar bear” (Russian nickname); ( informal) police; tricky things; grumpy n. (Bear) (US) Bell (name)"],"usphone":"beə(r)","ukphone":"beə(r)"},{"name":"camel","trans":["n. [animal husbandry] [spine] camel; salvage buoy; work style bureaucratic adj. Camel; dark brown vi. Job stereotypical and mediocre n. (Camel) name; (French) Carmel; (Arabic) Kamal"],"usphone":"ˈkæml","ukphone":"ˈkæml"},{"name":"lion","trans":["n. Lions; celebrities; brave people; social celebrities n. (Lion) names; (Western, Portuguese) Leon; (Germany, France, Italy, Czech, Sweden) Leon; (English) Leon"],"usphone":"ˈlaɪən","ukphone":"ˈlaɪən"},{"name":"panda","trans":["n. Panda; cat bear n. (Panda) name; (Indo, Sai) panda"],"usphone":"ˈpændə","ukphone":"ˈpændə"},{"name":"airplane","trans":["n. Aircraft"],"usphone":"ˈeəpleɪn","ukphone":"ˈeəpleɪn"},{"name":"cart","trans":["n. Two-wheeled wagons vt. Load vi with a car. Driving a wagon; using a van to transport n. (Cart) name of person; (France) Carl; (English, Finn) Carter"],"usphone":"kɑːt","ukphone":"kɑːt"},{"name":"truck","trans":["n. Trucks; Deals; Trolleys vi. Driving a truck; bartering vt. transaction; transportation by truck adj. (US) truck's n. (Truck) name; (German) Truk"],"usphone":"trʌk","ukphone":"trʌk"},{"name":"van","trans":["n. Pioneer; van; value-added network vt. Name of person carrying n. (Van) by car; (Lao, Thai, Jian, Myanmar) Wan"],"usphone":"væn","ukphone":"væn"},{"name":"cup","trans":["n. Cups; trophies; wine glasses vt. Shape it into a cup; for... a cupping pot"],"usphone":"kʌp","ukphone":"kʌp"},{"name":"fork","trans":["n. Forks; forks; rakes vt. Fork; make into a fork vi. Fork; disagreement n. (Fork) person's name; (English, German) Falk"],"usphone":"fɔːk","ukphone":"fɔːk"},{"name":"pan","trans":["n. Pans; dish-shaped utensils; scouring plates, gold plates, weighing pans vt. Gold mining; cooking (food) in a shallow pan; [informal term] severe criticism vi. Gold mining; harvesting gold in scavenging"],"usphone":"pæn","ukphone":"pæn"},{"name":"plate","trans":["n. Disc; metal plate; metal plate; photosensitive negative vt. Electroplating; name for... armored n. (Plate); (English, German, Russian, Spanish, Italian, Sweden) Platt"],"usphone":"pleɪt","ukphone":"pleɪt"},{"name":"spoon","trans":["n. Spoons, spoons; the amount of one ladle vt. Use a spoon; make spoon-shaped vi. Gently hit up"],"usphone":"spuːn","ukphone":"spuːn"},{"name":"coat","trans":["n. Coat vt. Cover the surface of... n. (Coat) person's name; (France) Koa"],"usphone":"kəʊt","ukphone":"kəʊt"},{"name":"glove","trans":["n. Gloves vt. Give... wear gloves"],"usphone":"ɡlʌv","ukphone":"ɡlʌv"},{"name":"hat","trans":["n. Hat vt. Put a hat on... vi. Hat supply; name of the person who made the hat n. (Hat); (Chinese) nuclear (Cantonese, Weitama)"],"usphone":"hæt","ukphone":"hæt"},{"name":"shirt","trans":["n. Shirts; undershirts, underwear"],"usphone":"ʃɜːt","ukphone":"ʃɜːt"},{"name":"shorts","trans":["n. Shorts n. (Shorts) Name; (English) Shorts"],"usphone":"ʃɔːts","ukphone":"ʃɔːts"},{"name":"sock","trans":["n. Short socks; one-hit vt. Hit hard; put on... socks adv. On the ground; unbiased adj. A very successful n. (Sock) name; (German) Zock"],"usphone":"sɒk","ukphone":"sɒk"},{"name":"ladybug","trans":["n.Ladybugs"],"usphone":"'leɪdɪbʌg","ukphone":"'leɪdɪbʌg"},{"name":"snail","trans":["n. Snails; sluggish people vi. Move slowly vt. trundle"],"usphone":"sneɪl","ukphone":"sneɪl"},{"name":"spider","trans":["n. Spiders; trap setters; tripods"],"usphone":"ˈspaɪdə(r)","ukphone":"ˈspaɪdə(r)"},{"name":"turtle","trans":["n. Turtle, turtle; turtle n. (Turtle) name; (English) Turtle"],"usphone":"ˈtɜːtl","ukphone":"ˈtɜːtl"},{"name":"worm","trans":["n. Bugs, worms; worms; threads; little people vt. Make it peristaltic; exterminate insects; move slowly vi. Move slowly; crawl n. (Worm) name; (Germany, Denmark, Portugal) Worm"],"usphone":"wɜːm","ukphone":"wɜːm"},{"name":"eight","trans":["num. Eight; eight; eighth; eight years old; eight point adj. Eight's n. 8-person rowing team"],"usphone":"eɪt","ukphone":"eɪt"},{"name":"hotdog","trans":["v. (while surfing or skiing) selling (fancy movements) n. Dexterous performers (skiing or surfing); hot dogs (bread); Frankfurter smoked sausage"],"usphone":"ˈhɒtˌdɒɡ","ukphone":"ˈhɒtˌdɒɡ"},{"name":"raincoat","trans":["n. (US) raincoat"],"usphone":"ˈreɪnkəʊt","ukphone":"ˈreɪnkəʊt"},{"name":"stick","trans":["vt. Stab; poke; stick; paste vi. insist; stick out; stick to n. stick; walking stick; dumb person n. (Stick) (Finn) stick (name of person)"],"usphone":"stɪk","ukphone":"stɪk"},{"name":"bull","trans":["n. Bulls; people who are optimistic about the stock market; people who are as strong as bulls; nonsense; seal adj. Large; bull-like; male vt. Attempt to raise the price of securities; frighten; forcefully achieve vi. Price increase; luck; push forward; brag n. (Bull) name; (English, Portuguese, Sweden, Finland, Norway, Germany) Bull"],"usphone":"bʊl","ukphone":"bʊl"},{"name":"geese","trans":["n. Goose (plural goose) n. (Geese) (German) Geze (personal name)"],"usphone":"ɡiːs","ukphone":"ɡiːs"},{"name":"nine","trans":["n. Nine, nine num. Nine; nine adj. Nine, nine n. (Nine) names; (Sai) Niney"],"usphone":"naɪn","ukphone":"naɪn"},{"name":"beet","trans":["n.Beets; beetroot vt. Start a fire; repair; change"],"usphone":"biːt","ukphone":"biːt"},{"name":"lemon","trans":["n. Lemon; lemon juice; lemon tree; lemon color; waste; idiot adj. Light yellow, lemon-colored n. (Lemon) (US) lemon (name)"],"usphone":"ˈlemən","ukphone":"ˈlemən"},{"name":"pear","trans":["n. [Horticulture] Pear Tree; Pear n. (Pear) Name; (English) Peel"],"usphone":"peə(r)","ukphone":"peə(r)"},{"name":"strawberry","trans":["n.Strawberry; strawberry color"],"usphone":"ˈstrɔːbəri","ukphone":"ˈstrɔːbəri"},{"name":"ten","trans":["num. Ten, ten n. (Ten) (American, Russian, Canada, German, Dutch, Spanish, English) (name)"],"usphone":"ten","ukphone":"ten"},{"name":"balloon","trans":["n. Balloons; hot air balloons; large spherical wineglasses; white circles; (informal) idiot; extremely large payment at the end of the installment; (informal) big trouble v. surge; sudden weight gain; expansion; (kick the ball); travel in a hot air balloon adj. n. (Balloon) (US, India, Thailand, Russia, Pakistan) balon (name of person) that blows up like a balloon"],"usphone":"bəˈluːn","ukphone":"bəˈluːn"},{"name":"card","trans":["n. Cards; cards; postcards vt. Write n. (Card) name on the card; (English) card"],"usphone":"kɑːd","ukphone":"kɑːd"},{"name":"cupcake","trans":["n. Paper tray cake; cupcake"],"usphone":"ˈkʌpkeɪk","ukphone":"ˈkʌpkeɪk"},{"name":"eleven","trans":["n. Eleven; eleven adj. Eleven's; eleven's num. eleven; eleven"],"usphone":"ɪˈlevn","ukphone":"ɪˈlevn"},{"name":"pizza","trans":["n. Pizza (an Italian-style pancake with filling covered with cheese and ketchup) n. (Pizza) name; (Italian) pizza"],"usphone":"ˈpiːtsə","ukphone":"ˈpiːtsə"},{"name":"apron","trans":["n. Apron; [aviation] apron; stage entrance vt. Wearing an apron; surrounded by n. (Apron) names; (Russian) Apron"],"usphone":"ˈeɪprən","ukphone":"ˈeɪprən"},{"name":"twelve","trans":["n. Twelve; twelve num. Twelve; twelve adj. Twelve's; twelve's"],"usphone":"twelv","ukphone":"twelv"},{"name":"coral","trans":["n. Coral; coral bug adj. Coral; coral-colored n. (Coral) name; (English, French, Spanish, Portuguese) Coral"],"usphone":"ˈkɒrəl","ukphone":"ˈkɒrəl"},{"name":"crab","trans":["n. Crabs; crab meat; grumpy people; cranes vt. Complain; destroy; cause yaw vi. Crab catching; whining; complaining"],"usphone":"kræb","ukphone":"kræb"},{"name":"sand","trans":["n. Sand; sand; sandbar; beach; sand vt. Sprinkle sand on; cover with sand; use sandpaper or the like to flatten or polish something; cover the ground with sand; mix... with sand vi. Name of person blocked by sand n. (Sand); (England, Germany, Italy, Finn, Luo, Jie, No) Sander; (Sweden) Sander; (France) Sang"],"usphone":"sænd","ukphone":"sænd"},{"name":"seaweed","trans":["n.Seaweed, seaweed"],"usphone":"ˈsiːwiːd","ukphone":"ˈsiːwiːd"},{"name":"starfish","trans":["n.Starfish"],"usphone":"ˈstɑːfɪʃ","ukphone":"ˈstɑːfɪʃ"},{"name":"computer","trans":["n. Computers; computers; electronic computers"],"usphone":"kəmˈpjuːtə(r)","ukphone":"kəmˈpjuːtə(r)"},{"name":"couch","trans":["n. Sleeper chair, couch; bed; daybed vi. crouching, ambush; lying vt. Lie down; express; bend down n. (Couch) name; (English) Couch"],"usphone":"kaʊtʃ","ukphone":"kaʊtʃ"},{"name":"off","trans":["Adv. Departure; disconnection; departure, start; end, cancellation; (electricity) not connected; no; leaving work; price reduction; prep at the back of the theater stage. Leave; deviate from; leave work; cut prices; quit; abstain; (informal) stay away; (informal, usually temporarily) hate adj. far away; idle; (food) not fresh; unacceptable; abnormal performance; right side (of a wheel or other object); offside (in certain sports games); (informal) uncomfortable; (informal) uncomfortable; (informal) uncomfortable; (informal) unfriendly n. (informal) start; (cricket) half of the field opposite the batter; (informal) rest day; v. (informal) kill (someone); (informal) leave"],"usphone":"ɒf","ukphone":"ɒf"},{"name":"on","trans":["prep. On top of...; towards; towards; about; when; supported by; (on); (on); when; eating, drinking; approaching; earning... money; paying; using... as fuel; in...; as a member; using (instruments or devices); compared to; increasing; taking medication; broadcasting (by radio or television); busy with adv. On top; moving forward; continuing, in action; wearing; performing (entertainment, etc.); (electrical appliances) on the ground; on duty adj. Open; happening; ongoing; after; coverage; attachment (especially in the right position); written; n. (On) (Chinese, Filipino) (name of person) currently being broadcast"],"usphone":"ɒn","ukphone":"ɒn"},{"name":"skates","trans":["n. Skates; skates (plural of skate) v. ice skating; sliding; slightly touching (three single forms of skating)"],"usphone":"skeits","ukphone":"skeits"},{"name":"table","trans":["n. Tables; tables; level ground vt. watch-making; shelving; embedding adj. n. (Table) name of the person at the table; (Luo) Tablai"],"usphone":"ˈteɪbl","ukphone":"ˈteɪbl"},{"name":"pilot","trans":["n. Pilots; pilots adj. Pilot v. driving; piloting; trial n. (Pilot) name; (Italian, Indian) Pilot; (France) Pilot"],"usphone":"ˈpaɪlət","ukphone":"ˈpaɪlət"},{"name":"body","trans":["n. Body; subject; mass; group; main part vt. Name a person with a physical n. (Body); (English, French, Luo) Bodie"],"usphone":"ˈbɒdi","ukphone":"ˈbɒdi"},{"name":"head","trans":["n. Head; headache; upper end; front part; comprehension vt. Move forward; use the top of your head; be the leader of...; stand in front of...; title... vi. Departure; end up; boat sails to adj. Head; main; n. (Head) name at the top; (English) Head"],"usphone":"hed","ukphone":"hed"},{"name":"butterfly","trans":["n. Butterflies; butterfly swimmers; people with frivolous manners; people who seek pleasure"],"usphone":"ˈbʌtəflaɪ","ukphone":"ˈbʌtəflaɪ"},{"name":"field","trans":["n. Field; Pasture; Wilderness; Battlefield; Stadium; Field vi. As a field player adj. Scanning field; field game; wild vt. Expose yourself on the field; put on the field n. (Field) name; (English, French, German, Portuguese) field"],"usphone":"fiːld","ukphone":"fiːld"},{"name":"sunset","trans":["n. Sunset, evening"],"usphone":"ˈsʌnset","ukphone":"ˈsʌnset"},{"name":"out","trans":["Adv. Appearance; outward; outdoors; release from prison; remote; going out to sea; low tide; distance from the goal line or finish line; in a public place of entertainment; in public; in a loud place; exhaustion; until completed; completely; extinguished; removed; exit prep. Get out of... and leave adj. Extinguished; blooming; marketable; out of the game; unacceptable; out of date; inaccurate; intended to do...; knocked down and stunned by public v.; disclosing (someone) as homosexual; expelled; rejected; removing n. A way out; a way out of the game; (baseball) a way out of the game; an opposition party"],"usphone":"aʊt","ukphone":"aʊt"},{"name":"doll","trans":["n. Dolls; dolls; beautiful women without brains vt. Dress up... as a flower branch and display n. (Doll) names; (English) Doll (female educational names Dorothea and Dorothy nicknames); (West) Dolly"],"usphone":"dɒl","ukphone":"dɒl"},{"name":"hole","trans":["n. Holes, holes; caves, holes; breakthroughs vi. Drilling a hole, piercing a hole; (golf, etc.) into a hole vt. Name of person who drilled a hole n. (Hole); (Sweden, Norway) Holle; (English) Hall"],"usphone":"həʊl","ukphone":"həʊl"},{"name":"log","trans":["n. Logs; logs (navigation or flight); (regular or systematic) observation records; ship speedometers; logarithms v. load (situation) into navigation (or flight) logs; (ship, aircraft) reach (a certain range, speed); (pilot) flight (a certain period of time); make a systematic record of...; harvest (forest area) trees"],"usphone":"lɒɡ","ukphone":"lɒɡ"},{"name":"pot","trans":["n. Pot; pot; can vt. Canning...; Shoot; Abbreviate vi. Shoot n. (Pot) person's name; (card) Bout; (Czech) Potter; (France) Wave"],"usphone":"pɒt","ukphone":"pɒt"},{"name":"curly","trans":["adj. curly; curly; (wood) wrinkled; curled"],"usphone":"ˈkɜːli","ukphone":"ˈkɜːli"},{"name":"long","trans":["adj. Long; long term; long term; long sound; (human) high; continuous; lengthy; long term; long term (profitable) adv. Over a long period of time; (before or after something) for a long time; (after the noun of time); far away n. Long; long sound; forward securities; long size (of clothing); long pants v. desire, hope n. (long) (US, UK, Ireland) long (name of person)"],"usphone":"lɒŋ","ukphone":"lɒŋ"},{"name":"pasta","trans":["n. Italian pasta; dough n. (Pasta) name; (English, Italian) pasta"],"usphone":"ˈpæstə","ukphone":"ˈpæstə"},{"name":"short","trans":["adj. short; insufficient; short, low n. short; lack; short circuit; shorts adv. Insufficient; suddenly; suddenly n. (Short) (English) Short (name)"],"usphone":"ʃɔːt","ukphone":"ʃɔːt"},{"name":"thin","trans":["adj. Thin; skinny; thin; weak vt. Make thin; make thin; make thin vi. Get thinner; get thinner; become thinner adv. sparsely; faintly n. Small part n. (Thin) person's name; (Yue) Chen; () Ting"],"usphone":"θɪn","ukphone":"θɪn"},{"name":"wide","trans":["adj. Extensive; broad, expansive; expansive; far from the target adv. Extensively; broadly; fully n. The Great Thousand Worlds n. (Wide) people's names; (Sweden, Fern) Vader"],"usphone":"waɪd","ukphone":"waɪd"},{"name":"yummy","trans":["adj. Delicious; tasty; pleasant n. Delicious; lovable"],"usphone":"ˈjʌmi","ukphone":"ˈjʌmi"},{"name":"bunny","trans":["n. Bunnies (especially bunnies); cute girl n. (Bunny) name; (English) Bonnie; () Benny"],"usphone":"ˈbʌni","ukphone":"ˈbʌni"},{"name":"goldfish","trans":["n.Goldfish"],"usphone":"ˈɡəʊldfɪʃ","ukphone":"ˈɡəʊldfɪʃ"},{"name":"hamster","trans":["n. Hamsters; hamster fur"],"usphone":"ˈhæmstə(r)","ukphone":"ˈhæmstə(r)"},{"name":"ladder","trans":["n. Stairs; pathways; ladders vi. Fame; trajectory vt. Install ladders on..."],"usphone":"ˈlædə(r)","ukphone":"ˈlædə(r)"},{"name":"tractor","trans":["n. Tractors; tractors"],"usphone":"ˈtræktə(r)","ukphone":"ˈtræktə(r)"},{"name":"crocodile","trans":["n. Crocodiles"],"usphone":"ˈkrɒkədaɪl","ukphone":"ˈkrɒkədaɪl"},{"name":"ostrich","trans":["n. Ostriches; people who escape reality"],"usphone":"ˈɒstrɪtʃ","ukphone":"ˈɒstrɪtʃ"},{"name":"plains","trans":["n. Flat ground, plain (plural of plain)"],"usphone":"pleinz","ukphone":"pleinz"},{"name":"zebra","trans":["n. [spine] zebra adj. Zebra (stationery brand); Zebra (refers to a profitable and responsible company)"],"usphone":"ˈzebrə; ˈziːbrə","ukphone":"ˈzebrə; ˈziːbrə"},{"name":"dirt","trans":["n. Dirt, dirt; dust, dust; dirty talk"],"usphone":"dɜːt","ukphone":"dɜːt"},{"name":"rain","trans":["n. Rain; rain; rainy day; rainy season vi. Rain; rainfall vt. Give in large quantities; leave behind n. (Rain) names; (France) Lan; (English) Rain; (Luo, Jie) Ryan"],"usphone":"reɪn","ukphone":"reɪn"},{"name":"sunshine","trans":["n. Sunshine; Happy; Clear; Happy n. (Sunshine) Name; (English) Sun Shane"],"usphone":"ˈsʌnʃaɪn","ukphone":"ˈsʌnʃaɪn"},{"name":"basketball","trans":["n. Basketball; basketball sport"],"usphone":"ˈbɑːskɪtbɔːl","ukphone":"ˈbɑːskɪtbɔːl"},{"name":"football","trans":["n. Soccer, rugby vi. Play soccer; play rugby"],"usphone":"ˈfʊtbɔːl","ukphone":"ˈfʊtbɔːl"},{"name":"golf","trans":["n. Golf; golf sport vi. Name of person playing golf n. (Golf); (West, North) Golf"],"usphone":"ɡɒlf","ukphone":"ɡɒlf"},{"name":"soccer","trans":["n. English football, soccer"],"usphone":"ˈsɒkə(r)","ukphone":"ˈsɒkə(r)"},{"name":"tennis","trans":["n. Tennis (sport) n. (English) Tanis (personal name)"],"usphone":"ˈtenɪs","ukphone":"ˈtenɪs"},{"name":"volleyball","trans":["n.Volleyball"],"usphone":"ˈvɒlibɔːl","ukphone":"ˈvɒlibɔːl"},{"name":"bridge","trans":["n. Bridges; Bridges; Bridges; Ship Bridges vt. Building a bridge; crossing n. (Bridge) name; (English) Bridge"],"usphone":"brɪdʒ","ukphone":"brɪdʒ"},{"name":"gate","trans":["n. Gates; entrances and exits; doorways vt. Name of person who installed the gate n. (Gate); (English) Gate; (France, Sweden) Gart"],"usphone":"ɡeɪt","ukphone":"ɡeɪt"},{"name":"wheel","trans":["n. Wheel; steering wheel; rotation vt. Rotate; change direction; install wheels for... vi. Rotation; abrupt change of direction; circling flight"],"usphone":"wiːl","ukphone":"wiːl"},{"name":"mailbox","trans":["n. Mailboxes; mailboxes"],"usphone":"ˈmeɪlbɒks","ukphone":"ˈmeɪlbɒks"},{"name":"scale","trans":["n. Scale; scale; scale; scale; scale; numerical range vi. Measurement; climbing; peeling; scale vt. Measurement; climbing; scraping scales; determining n. (Scale) people's names according to proportion; (Italy) Scales"],"usphone":"skeɪl","ukphone":"skeɪl"},{"name":"stamp","trans":["n. Stamps; imprints; signs; stomps vt. Remember; mark; stamp on...; put a stamp on...; step on with your foot vi. Stomp; smash; destroy n. (Stamp) name; (German) Stump; (English) Stamp"],"usphone":"stæmp","ukphone":"stæmp"},{"name":"worker","trans":["n. Worker; worker; worker ant n. (Worker) name; (English) Walker"],"usphone":"ˈwɜːkə(r)","ukphone":"ˈwɜːkə(r)"},{"name":"bucket","trans":["n. Bucket, bucket; bucket; volume of a bucket v. pouring down; moving bumpy n. (Bucket) name of person; (German) Buckett"],"usphone":"ˈbʌkɪt","ukphone":"ˈbʌkɪt"},{"name":"fairy","trans":["n. Fairies, elves; pretty girls adj. fictional; fairy"],"usphone":"ˈfeəri","ukphone":"ˈfeəri"},{"name":"leaves","trans":["n. Leaves, leaves; petals; (paper) pages, sheets; thin sheet of metal; movable table, folding table; fan (window, door, etc.); inside (or outside) of a hollow wall (plural of leaf) v. leave; let... leave (3rd person singular of leave)"],"usphone":"liːvz","ukphone":"liːvz"},{"name":"roof","trans":["n. Roof; highest point, top; maximum vt. Build a roof for... and cover n. (Roof) person's name; (English) Ruff"],"usphone":"ruːf","ukphone":"ruːf"},{"name":"beetle","trans":["n. Beetle; hammer; hammering machine; beetle fighting (a kind of craps game) v. Hurry back and forth; stick out; hit with a hammer; use a hammerer (cloth) adj. (Human eyebrows) Thick and prominent n. (Beetle) (US) Beetle (personal name) n. (Beetle) “Beetle” car (English name for a Volkswagen car)"],"usphone":"ˈbiːtl","ukphone":"ˈbiːtl"},{"name":"parrot","trans":["n. Parrots; learners, vocalizers; people who mechanically imitate others vt. Mechanical imitation of n. (Parrot) name; (English, Russian, Portuguese) Parrot; (France) Parrot"],"usphone":"ˈpærət","ukphone":"ˈpærət"},{"name":"rainforest","trans":["n. (tropical) rainforest"],"usphone":"ˈreɪnfɒrɪst","ukphone":"ˈreɪnfɒrɪst"},{"name":"cherry","trans":["n. Cherry; cherry tree; bright red like a cherry; hymen, virgin n. (Cherry) name; (French, Arabic) Cherie; (English) Cherie (nickname of the female teaching name Charity)"],"usphone":"ˈtʃeri","ukphone":"ˈtʃeri"},{"name":"pepper","trans":["n. pepper; cayenne pepper; pepper vt. Add pepper to; cover n. (Pepper) with name; (English, German, Italian) pepper"],"usphone":"ˈpepə(r)","ukphone":"ˈpepə(r)"},{"name":"radish","trans":["n. Radish, radish n. (Radish) person's name; (Russian) Radish; (Se) Radish"],"usphone":"ˈrædɪʃ","ukphone":"ˈrædɪʃ"},{"name":"art","trans":["n. Art (including sculpture, painting, music, etc.), fine art (work); art (work); (performance) art; technology, skill; adj. Artistic; artistic; artistic v. be's present singular second person form, outdated usage"],"usphone":"ɑːt","ukphone":"ɑːt"},{"name":"gym","trans":["n. Gyms; sports; gymnasiums"],"usphone":"dʒɪm","ukphone":"dʒɪm"},{"name":"library","trans":["n. Library, library; library"],"usphone":"ˈlaɪbrəri; ˈlaɪbri","ukphone":"ˈlaɪbrəri; ˈlaɪbri"},{"name":"lunchroom","trans":["n. Quick restaurants; school or factory cafeterias"],"usphone":"ˈlʌntʃruːm; ˈlʌntʃrʊm","ukphone":"ˈlʌntʃruːm; ˈlʌntʃrʊm"},{"name":"music","trans":["n. Music, songs"],"usphone":"ˈmjuːzɪk","ukphone":"ˈmjuːzɪk"},{"name":"lick","trans":["vt. Lick; roll over; whip vt. (Unofficial) Defeat vi. Lick; gently pat n. Lick; hit; a few n. (Lick) names; (English,) Lick"],"usphone":"lɪk","ukphone":"lɪk"},{"name":"pat","trans":["v. Tap (with the palm of your hand); tap... to get attention; tap... (to) shape n. Tap; tap; (of soft material) adj. Overly simplistic adv. Timely, timely abbr. Patent, patent certificate (patent) n. (Pat) (US) Pat (personal name)"],"usphone":"pæt","ukphone":"pæt"},{"name":"rainbow","trans":["n. Rainbow; colorful arrangement; fantasy adj. Colourful; rainbow-shaped vt. Make a rainbow; decorate like a rainbow vi. Rainbow-shaped n. (Rainbow) person's name; (English) Raynbo"],"usphone":"ˈreɪnbəʊ","ukphone":"ˈreɪnbəʊ"},{"name":"spring","trans":["n. Spring; springs; springs; vitality; jumping adj. Spring vi. Grow; erupt; leap; crack vt. Make it jump; make it explode; suddenly propose; make it pop n. (Spring) name; (Germany) Sprin; (England, Finland, Sweden) Spring"],"usphone":"sprɪŋ","ukphone":"sprɪŋ"},{"name":"stairs","trans":["n. Stairs; steps (plural of stair) n. (Stairs) person's name; (English) Stiles"]},{"name":"subway","trans":["n. Subways; tunnels vi. By subway"],"usphone":"ˈsʌbweɪ","ukphone":"ˈsʌbweɪ"},{"name":"tunnel","trans":["n. Tunnels; tunnels; cave passages vt. Dig; open a channel in...; excavate a tunnel in... vi. Excavate tunnels; open passages"],"usphone":"ˈtʌnl","ukphone":"ˈtʌnl"},{"name":"summer","trans":["n. Summer; heyday vi. escape the heat; spend the summer adj. Summer n. (Summer) names; (German) Zumer; (English) Summer"],"usphone":"ˈsʌmə(r)","ukphone":"ˈsʌmə(r)"},{"name":"camp","trans":["n. Camping; Camp; Holiday Camp; Detention Camp; Military Camp; Camp; Grazing Area; Annual Short-Term Military Service; Prehistoric Camp Ruins; Manipulation v. Camping; Concentrated rest (livestock); Fencing adj. Feminine; exaggerated, (costume) bizarre n. (Camp) (American, English, Canada, French) Kang (name of person)"],"usphone":"kæmp","ukphone":"kæmp"},{"name":"song","trans":["n. Song; Singing; Poetry; Sound n. (Song) Name; (Thai) Song; (Chinese) Song; (English) Song; (Old) Song; (Yue) Shuang; (Southeast Asian Chinese) Song"],"usphone":"sɒŋ","ukphone":"sɒŋ"},{"name":"fun","trans":["vi. Joking (3rd person singular of fun) (informal)"],"usphone":"fʌn","ukphone":"fʌn"},{"name":"picnic","trans":["n. Picnic vi. Go on a picnic"],"usphone":"ˈpɪknɪk","ukphone":"ˈpɪknɪk"},{"name":"Sun","trans":["n. Sun vt. Sunlight vi. Sun basking n. (Sun) name; (Chinese) Sun (Mandarin, Witma); () Sun; (Myanmar) Su; (Tu) Song"],"usphone":"sʌn","ukphone":"sʌn"},{"name":"cereal","trans":["n. Cereals, grains; cereal foods; cereal plants adj. Cereals; made from cereals"],"usphone":"ˈsɪəriəl","ukphone":"ˈsɪəriəl"},{"name":"fruit","trans":["n. Fruit; Product vi. The results are real vt. Make... result n. (Fruit) person's name; (French) Freud; (English) Fruitt"],"usphone":"fruːt","ukphone":"fruːt"},{"name":"meat","trans":["n.Meat, meat (edible)"],"usphone":"miːt","ukphone":"miːt"},{"name":"dry","trans":["adj. Dry; thirsty; boring and tasteless; prohibited vt. Dry... vi. Dry n. Dry n. (Dry) person's name; (France) Delhi"],"usphone":"draɪ","ukphone":"draɪ"},{"name":"flat","trans":["adj. Flat; monotonous; sluggish; plain; flat; flat; shallow adv. (Especially when attached to another surface) Flat; flat; flat; flat; directly, completely n. Flat; flat vt. Flattens; [music] lowers (pitch), especially by lowering a semitone vi. Gradually leveled off; [music] later sing (or play) n. (French) Flatt (person's name); (English) Flatt (person's name)"],"usphone":"flæt","ukphone":"flæt"},{"name":"hot","trans":["adj. Hot; spicy; passionate; exciting; urgent adv. Hot; urgently vi. Getting hot vt. Add; warm up... n. (Hot) names; (Se) Holt; (France) Ott"],"usphone":"hɒt","ukphone":"hɒt"},{"name":"round","trans":["adj. round; curved; integer; perfect; approximate; obese; (sound) round; (ancient, money) large; (ancient, human, or way of speaking) straightforward adv. Spin; around; around; everywhere; in a detour; in the opposite direction; one by one; prep somewhere. Around; around; around; around...; at... stages; round; round; regular activity; circle, round object; fixed route v. (make) round; complete; round off; round off; round off; round off; progress; circumnavigate; gain weight n. (Round) (US, UK, Canada, Australia, India, Germany) Round (name of person)"],"usphone":"raʊnd","ukphone":"raʊnd"},{"name":"small","trans":["adj. Few, small; weak; almost none; unimportant; young adv. Tiny Land; Despicable n. Small Items; Short Person n. (Small) Name; (English) Small"],"usphone":"smɔːl","ukphone":"smɔːl"},{"name":"wet","trans":["adj. [Meteorology] [Object] Humid; rainy n. Rainy days; humidity vt. Get wet vi. Wet n. (Wet) person's name; (English, Nano, South Africa) Wete"],"usphone":"wet","ukphone":"wet"},{"name":"crow","trans":["n. Crow; chirping; (informal) ugly woman; crowbar v. clapping; smug; cheering"],"usphone":"krəʊ","ukphone":"krəʊ"},{"name":"dove","trans":["n. Pigeons; doves (participants); moderates; brown-gray v. diving (past tense of dive) n. (Dove) (US) duff (personal name)"],"usphone":"dʌv","ukphone":"dʌv"},{"name":"eagle","trans":["n. Eagle; eagle logo n. (Eagle) name; (English) Eagle"],"usphone":"ˈiːɡl","ukphone":"ˈiːɡl"},{"name":"hawk","trans":["n. Eagles; hawks; predators; plaster pallets v. hawking; clear throat; close surveillance; hawk attacks; flying foraging n. (Hawk) Oak (name of person)"],"usphone":"hɔːk","ukphone":"hɔːk"},{"name":"owl","trans":["n. Owls; lords; people accustomed to night activities"],"usphone":"aʊl","ukphone":"aʊl"},{"name":"turkey","trans":["n. Turkey; idiot; failure"],"usphone":"ˈtɜːki","ukphone":"ˈtɜːki"},{"name":"counter","trans":["n. Counter; counter; counter; chips (for some board games) vt. Fight back, fight back; move in reverse, face to face; refute, answer vi. Move in the opposite direction, facing the stem; refute adj. The opposite adv. in the opposite direction; in the opposite direction"],"usphone":"ˈkaʊntə(r)","ukphone":"ˈkaʊntə(r)"},{"name":"cupboard","trans":["n. Cupboards; cupboards"],"usphone":"ˈkʌbəd","ukphone":"ˈkʌbəd"},{"name":"fridge","trans":["n. Fridge n. (Fridge) person's name; (English) Fritch"],"usphone":"frɪdʒ","ukphone":"frɪdʒ"},{"name":"sink","trans":["v. sink (in water or mud); sink (ship); fall; infiltrate; be fully understood; make sharp objects penetrate the surface; settle (object); disappear; reduce; make (sound) quieter; excavate; bury; sink, suppress; close to death; hide; hit the ball into a hole; (informally) drink n. sink, sink; sink; sink; (technical) sink, valley; school (or property) in poor areas; nest, place to hide dirt adj. n. (Sink) (American, English, Romania) sink (name) of a slum located in a poor area with poor social conditions"],"usphone":"sɪŋk","ukphone":"sɪŋk"},{"name":"stove","trans":["n. Stoves; kilns; greenhouses vt. Grilling on a stove n. (Stove) name; Stove (Sweden)"],"usphone":"stəʊv","ukphone":"stəʊv"},{"name":"toaster","trans":["n. Toaster; host with impromptu speeches accompanied by reggae music"],"usphone":"ˈtəʊstə(r)","ukphone":"ˈtəʊstə(r)"},{"name":"belly","trans":["n. Abdomen; Stomach; Appetite vi. Overwhelming; boosting vt. Raise n. (Belly) name; (French, Italian, Portuguese) Bailey"],"usphone":"ˈbeli","ukphone":"ˈbeli"},{"name":"brownie","trans":["n. Chocolate cake, brownies; brown fairy (legendary elf who helps with housework at night)"],"usphone":"ˈbraʊni","ukphone":"ˈbraʊni"},{"name":"pie","trans":["n. Pies; pie charts; people who love to talk vt. clutter"],"usphone":"paɪ","ukphone":"paɪ"},{"name":"block","trans":["n. Blocks; blocks; buildings; obstacles vt. block; block; limit; block adj. Batch, large; n. (Block) names of people in traffic jams; (English, French, German, Spanish, Portuguese, Finnish, Russian) Brock"],"usphone":"blɒk","ukphone":"blɒk"},{"name":"drum","trans":["n. Drums; drums; drums; drums (on the machine); drums; drummer; bag; (informal) house, one suite; (informal) brothel; inside news; afternoon tea; mountain ridges v. drumming; nonstop knocking; (woodpecker) pecking rapidly with the mouth; messaging...; vigorously fighting for n. (Drum) (American, Russian, Australian, etc.) drum (name of person)"],"usphone":"drʌm","ukphone":"drʌm"},{"name":"kite","trans":["n. Kite vi. Use an empty check; fly like a kite; move briskly vt. Money fraud; falsification (check) n. (Kite) name; (Sai) Kit; (English) Kate"],"usphone":"kaɪt","ukphone":"kaɪt"},{"name":"paint","trans":["n. Paint; paint; (informal) makeup; three-second zone; painting function (especially simulating real painting effects); flower horse v. paint; apply makeup (face, skin); apply (liquid) to...; paint with a drawing program; display (aircraft, etc.) (on a radar screen); paint (picture); describe n. (Paint) (US) Pan (name of person)"],"usphone":"peɪnt","ukphone":"peɪnt"},{"name":"robot","trans":["n. Robots; remote control devices, automatic machines; people who work like machines"],"usphone":"ˈrəʊbɒt","ukphone":"ˈrəʊbɒt"},{"name":"clothes","trans":["n. Clothes"],"usphone":"kləʊðz; kləʊz","ukphone":"kləʊðz; kləʊz"},{"name":"grandparent","trans":["n. Grandparents; grandparents; grandparents; maternal grandparents; maternal grandparents or grandmothers"],"usphone":"ˈɡrænpeərənt","ukphone":"ˈɡrænpeərənt"},{"name":"map","trans":["n. Maps; celestial maps; diagrams, distribution maps; chromosome maps; (informal) faces v. Draw maps; understand information; plan; map; map; relate to...; determine the location of genes in the chromosome n. (Map) (US) map (name of person)"],"usphone":"mæp","ukphone":"mæp"},{"name":"seatbelt","trans":["n. Seat belts"],"usphone":"si:tbelt","ukphone":"si:tbelt"},{"name":"suitcase","trans":["n. [light] suitcase; suitcase"],"usphone":"ˈsuːtkeɪs; ˈsjuːtkeɪs","ukphone":"ˈsuːtkeɪs; ˈsjuːtkeɪs"},{"name":"umbrella","trans":["n. Umbrellas; umbrellas; shelters; umbrella-shaped structures"],"usphone":"ʌmˈbrelə","ukphone":"ʌmˈbrelə"},{"name":"under","trans":["prep. Below...; below the surface; behind...; (position, rank) below; younger than...; controlled by; according to; in the process; influenced by; endured; under (a word); under...; under (a system); during...; under... living conditions; planted; during...; under... living conditions; planted; during...; while in power; working under... adv. below; under water; less than; younger; in a coma; adj. lower; below"],"usphone":"ˈʌndə(r)","ukphone":"ˈʌndə(r)"},{"name":"chocolate","trans":["n. Chocolate, chocolate candy; chocolate color adj. Chocolate-colored; chocolate-flavored n. (Chocolate) name; (Portuguese) Saukorat"],"usphone":"ˈtʃɒklət","ukphone":"ˈtʃɒklət"},{"name":"valentine","trans":["n. lover; Valentine's Day gift"],"usphone":"ˈvæləntaɪn","ukphone":"ˈvæləntaɪn"},{"name":"ice","trans":["n. Ice; ice cream; restraint; () diamond vt. Ice; freeze vi. freezing adj. Ice's n. (Ice) name; (English) Ace; (French) Ice"],"usphone":"aɪs","ukphone":"aɪs"},{"name":"river","trans":["n. River, River n. (River) person's name; (English) River"],"usphone":"ˈrɪvə(r)","ukphone":"ˈrɪvə(r)"},{"name":"snow","trans":["n. Snow, snow; snow vi. Snowfall vt. Make one fall one after another; make white n. (Snow) person's name; (English) Snow"],"usphone":"snəʊ","ukphone":"snəʊ"},{"name":"draw","trans":["vt. Draw; pull; attract vi. Pull; drag n. Draw; Draw n. (Draw) person's name; (English) Delau"],"usphone":"drɔː","ukphone":"drɔː"},{"name":"drill","trans":["n. Training; drilling machines; drills; planters; exercises vi. Drilling; training vt. Drilling; training; broadcast n. (Drill) person name; (German, English) Drill"],"usphone":"drɪl","ukphone":"drɪl"},{"name":"glue","trans":["n. Glue, glue v. (with glue) bonding; (informal) focus on"],"usphone":"ɡluː","ukphone":"ɡluː"},{"name":"hammer","trans":["n. Hammer; chain ball; hammer; hammer; hammer; pitch hammer; heavy blow v. hammering; repeated hitting; hitting; easy to break; indoctrination; (informal) severe criticism; (stock trading) declaring (someone or company) insolvent n. (Hammer) (US, Germany, Russia, Dan, Canada, Pakistan) Ame (name of person)"],"usphone":"ˈhæmə(r)","ukphone":"ˈhæmə(r)"},{"name":"hang","trans":["vt. hang, hang; decorate; hang; leave unresolved vi. Suspended, hanged; hanged; suspended, suspended n. (Hang) name; (Luo) Han; (Chinese in Southeast Asian countries) Kang; (old) Han; () Han (used in the first section of the name), hang"],"usphone":"hæŋ","ukphone":"hæŋ"},{"name":"saw","trans":["n. Saw; motto v. saw; saw; cut; use a saw; cut randomly; move back and forth like a tug saw v. see; understand, understand (past tense of see)"],"usphone":"sɔː","ukphone":"sɔː"},{"name":"drive","trans":["v. Driving; (motor vehicle) being driven; owning... a car; driving someone; driving; driving; driving; driving; driving; driving; driving; driving; driving (organized); driving; driving (organized); driving; driving (organized); driving; driving (an organized); driving (an organized); driving (an organized); driving (an organized) activity; driving (a fast lane); pumping; driving (aggressive); driving (aggressive) Attack, mass attack; party to play cards"],"usphone":"draɪv","ukphone":"draɪv"},{"name":"spot","trans":["n. Location; spot vt. Recognize; stain; illuminate with light vi. Stained; full of spots adj. Onsite; spot trading adv. accurately; exactly"],"usphone":"spɒt","ukphone":"spɒt"},{"name":"tool","trans":["n. Tools, utensils; instruments, machine tools; means vi. Use tools; equip the factory with machine tools vt. Use tools to process..."],"usphone":"tuːl","ukphone":"tuːl"},{"name":"igloo","trans":["n. Dome buildings; dome huts made of snow blocks; igloo; Eskimo dome huts"],"usphone":"ˈɪɡluː","ukphone":"ˈɪɡluː"},{"name":"seal","trans":["n. Seal; seal; seal; seal; logo vt. Seal; seal vi. Cheetah n. (Seal) name; (English) Seal"],"usphone":"siːl","ukphone":"siːl"},{"name":"whale","trans":["n. Whales; huge things v. (informal) beating; whaling; causing fiasco n. (Whale) (love) Wheeler (name of person)"],"usphone":"weɪl","ukphone":"weɪl"},{"name":"fire","trans":["n. Fire; fire; gunfire; fire; passion; suffering vt. Ignite; fire; fire; shine; fire; excite; fire; fire a gun vi. ignition; shooting; shooting; excitement; burning"],"usphone":"ˈfaɪə(r)","ukphone":"ˈfaɪə(r)"},{"name":"mittens","trans":["n. Baseball gloves, boxing gloves; gloves; mittens (plural of mitten, common plural)"],"usphone":"'mɪt(ə)nz","ukphone":"'mɪt(ə)nz"},{"name":"sled","trans":["n. Sleigh vi. Ride a sleigh; use a sleigh to transport vt. Use a cotton picker to pick; use a sleigh to transport"],"usphone":"sled","ukphone":"sled"},{"name":"snowman","trans":["n. Snowman n. (Snowman) name; (English) Snowman"],"usphone":"ˈsnəʊmæn","ukphone":"ˈsnəʊmæn"},{"name":"winter","trans":["n. Winter; age; depression period vi. Winter adj. Winter's; n. (Winter) person's name for wintering; (English, German, German, German, Russian, Czech, West, Finland, Sweden, France) Winter"],"usphone":"ˈwɪntə(r)","ukphone":"ˈwɪntə(r)"},{"name":"cab","trans":["n. Cab; taxi; horse-drawn carriage vi. By taxi (or car)"],"usphone":"kæb","ukphone":"kæb"},{"name":"sign","trans":["n. Signs; symbols; signs; gestures; signs vi. Signed; signed vt. Signed; signalled"],"usphone":"saɪn","ukphone":"saɪn"},{"name":"vest","trans":["n. Vest; undershirt vt. Grant; dress vi. Belonging; wearing clothes n. (Vest) name; (English) West; () Westt"],"usphone":"vest","ukphone":"vest"}]