[{"name":"care","trans":["n. Care; Care; Prudence; Concern vi. care; care; love; concern vt. Care; hope or like n. (Care) name; (English) Kyle; (Se) Tsarey"],"usphone":"keə(r)","ukphone":"keə(r)"},{"name":"dad","trans":["n. Dad; Dad n. (Dad) name; (Meng, Baki, Afu) Dade; (Tai) Da"],"usphone":"dæd","ukphone":"dæd"},{"name":"grow","trans":["vi. Develop; grow; gradually become... vt. Make grow; grow; expand n. (Grow) person's name; (English) Grow"],"usphone":"ɡrəʊ","ukphone":"ɡrəʊ"},{"name":"guard","trans":["n. Guards; Vigilance; Guards; Protective Devices vi. Be wary vt. Defend; monitor n. (Guard) person's name; (English) Gerd"],"usphone":"ɡɑːd","ukphone":"ɡɑːd"},{"name":"help","trans":["vt. help; promote; cure; remedy n. Help; remedy; helper; something beneficial vi. help; useful; welcome n. (Help) person's name; (Fen) Help"],"usphone":"help","ukphone":"help"},{"name":"young","trans":["adj. young; early; inexperienced n. young person; (animal) cub, child n. (Young) name; (Chinese) Yang (Cantonese, Waituma); (Chinese) Yong; (English, Portuguese) Yang"],"usphone":"jʌŋ","ukphone":"jʌŋ"},{"name":"bill","trans":["n. [Act] Act; Advertisements; Bills; [Financial] Notes; Banknotes; Inventory vt. Announcements; Billing; Promoting with Posters"],"usphone":"bɪl","ukphone":"bɪl"},{"name":"Brazil","trans":["n. Brazil (Latin American countries)"],"usphone":"brəˈzɪl","ukphone":"brəˈzɪl"},{"name":"insect","trans":["n.Insects; scumbags"],"usphone":"ˈɪnsekt","ukphone":"ˈɪnsekt"},{"name":"mane","trans":["n. Mane (horse, etc.) mane n. (Mane) name; (France, Sai, Oka, Italy, Angola, Guinea-Bissau) Mane; (Japanese) true root (name)"],"usphone":"meɪn","ukphone":"meɪn"},{"name":"poison","trans":["n. Poisons; extremely harmful ideas; inhibitors; neutron absorbers; toxic people (or actions, etc.) vt. Poisoning; poisoning; spoilage; pollution (region, air, etc.); inhibits the activity of... adj. Poison n. (Poison) (American, Ai, English) Poisson (name of person)"],"usphone":"ˈpɔɪzn","ukphone":"ˈpɔɪzn"},{"name":"rodent","trans":["n. Rodents (such as mice, etc.) adj. (Related to) rodents"],"usphone":"ˈrəʊdnt","ukphone":"ˈrəʊdnt"},{"name":"coat","trans":["n. Coat vt. Cover the surface of... n. (Coat) person's name; (France) Koa"],"usphone":"kəʊt","ukphone":"kəʊt"},{"name":"famous","trans":["adj. famous; excellent, very satisfying"],"usphone":"ˈfeɪməs","ukphone":"ˈfeɪməs"},{"name":"India","trans":["n. India (South Asian country)"],"usphone":"'ɪndɪə","ukphone":"'ɪndɪə"},{"name":"shaggy","trans":["adj. Fluffy; rough surface; thick, messy hair"],"usphone":"ˈʃæɡi","ukphone":"ˈʃæɡi"},{"name":"snout","trans":["n. Nose; pig's mouth; tobacco; mouth of nose; mouthfeel"],"usphone":"snaʊt","ukphone":"snaʊt"},{"name":"spot","trans":["n. Location; spot vt. Recognize; stain; illuminate with light vi. Stained; full of spots adj. Onsite; spot trading adv. accurately; exactly"],"usphone":"spɒt","ukphone":"spɒt"},{"name":"fell","trans":["n. Hills, hilly areas; timber harvested in one season; animal skins; creases v. fall, fall (past tense of fall); cut down; knock down, knock down; flatten (the edge of the seam) adj. Evil, ferocious; destructive, fatal n. (Fell) (US, UK, Germany, France) Phil (name of person)"],"usphone":"fel","ukphone":"fel"},{"name":"hook","trans":["n. Hook, hook vt. Hook; lead to hook vi. Hooked; bent into a hook n. (Hook) name; (German, Dutch) Hawke; (English) Hook"],"usphone":"hʊk","ukphone":"hʊk"},{"name":"hung","trans":["adj. No majority party; (jury) unagreed; annoyed, confused; v. hanging; hanging; hanging; (making) sagging, hanging; (making) sagging, hanging; (making) hanging on a wall; wallpapering (on the wall); mounting (door); levitating (in the air); (causing) death (past tense and past participle of hang) n. (Hung) (US) Hung (name of person)"],"usphone":"hʌŋ","ukphone":"hʌŋ"},{"name":"okay","trans":["int. OK, adj. Yes; yes; good; safe adv. Yes; yes; very well n. Agree, approve v. Agree, approve"],"usphone":"'əʊ'keɪ","ukphone":"'əʊ'keɪ"},{"name":"recess","trans":["n. Rest; adjournment; recess vt. Make a recess; place... in a hidden place vi. Rest; vacation"],"usphone":"ˈriːses; rɪˈses","ukphone":"ˈriːses; rɪˈses"},{"name":"airline","trans":["n. Airlines; routes adj. Of the route"],"usphone":"ˈeəlaɪn","ukphone":"ˈeəlaɪn"},{"name":"airport","trans":["n. Airports; air terminals"],"usphone":"ˈeəpɔːt","ukphone":"ˈeəpɔːt"},{"name":"check in","trans":["Check-in, recording; arrival and registration"],"usphone":"ˈtʃek ɪn","ukphone":"ˈtʃek ɪn"},{"name":"plane","trans":["n. Aircraft; plane; degree, level vi. planing; traveling by plane; soaring vt. Flatten; use a grater; skim over the surface of the water adj. Flat; flat n. (Plane) person's name; (Serbia, Sweden, France) Plane"],"usphone":"pleɪn","ukphone":"pleɪn"},{"name":"search","trans":["v. Search, search; investigation, search; body search; search; search (on computer) n. Search; search n. (Search) (India, US) Search n. (Search) (India, US) Sage (name of person)"],"usphone":"sɜːtʃ","ukphone":"sɜːtʃ"},{"name":"traveler","trans":["n. Travellers; travelers; travel salesmen (equal to travelers)"],"usphone":"'trævələ","ukphone":"'trævələ"},{"name":"behave","trans":["vi. Performance; (machine, etc.) operation; proper behavior; (thing) playing a certain role vt. Follow the rules; act..."],"usphone":"bɪˈheɪv","ukphone":"bɪˈheɪv"},{"name":"cheer","trans":["n. Cheers, cheers; happy, joyful atmosphere; reasons to be happy; cheering songs, cheering poems; wine dishes (served on festive occasions) v. cheers, cheers; comfort, encouragement; (makes) happy n. (Cheer) (US, UK, Canada, Australia) Scher (name of person)"],"usphone":"tʃɪə(r)","ukphone":"tʃɪə(r)"},{"name":"movies","trans":["n. (US) [movie] movie (plural of movie)"],"usphone":"mu:vɪz","ukphone":"mu:vɪz"},{"name":"ready","trans":["adj. Ready; ready; quick; willing; n. cash soon; ready condition adv. promptly; in advance vt. Make ready n. (Ready) person's name; (English) Reddy"],"usphone":"ˈredi","ukphone":"ˈredi"},{"name":"theater","trans":["n. Cinemas, theaters, theaters; plays; operating rooms"],"usphone":"'θɪətə","ukphone":"'θɪətə"},{"name":"ticket","trans":["n. Tickets; entrance tickets, labels; (US) candidate lists; certificates; traffic fines vt. Tag; assign; issue a traffic violation ticket against..."],"usphone":"ˈtɪkɪt","ukphone":"ˈtɪkɪt"},{"name":"drink","trans":["v. Drink, drink; drink; after drinking..., cheers; (metaphor) revel in; (informally) absorb (moisture); drink (alcohol) to have a certain flavor; raise a glass to celebrate n. Wine; drink (drink or wine); drink, drink, be greedy, abuse alcohol"],"usphone":"drɪŋk","ukphone":"drɪŋk"},{"name":"flock","trans":["n. Group; cotton bundle (equal to floc) vt. Fill vi with cotton bundles. Gathering; walking in groups n. (Flock) name; (Germany, Sweden) Flock"],"usphone":"flɒk","ukphone":"flɒk"},{"name":"pack","trans":["n. Package; group; backpack; package; a pair of vt. Packing; pressing; bundling; picking; stuffing vi. Crowded; packaged goods; packaged; cluster n. (Pack) person's name; (English, German) Parker"],"usphone":"pæk","ukphone":"pæk"},{"name":"parade","trans":["n. Parade; military parade; show off; march; parade ground vt. Parade; show off; line up vi. Parade; showing off; parade in line n. (Parade) name; (France, Germany) Parade"],"usphone":"pəˈreɪd","ukphone":"pəˈreɪd"},{"name":"savanna","trans":["n. [Ecology] Savanna; tropical savanna"],"usphone":"sə'vænə","ukphone":"sə'vænə"},{"name":"broken","trans":["adj. broken; broken v. broken; broken; damaged (past participle of break)"],"usphone":"ˈbrəʊkən","ukphone":"ˈbrəʊkən"},{"name":"fix","trans":["v. (make) fix; determine (price, date, etc.); repair; arrange; (make) (paint, impact, etc.) last; (unofficial) dilemma; (informal) one dose of narcotics; something exciting and addictive; extreme feeling; (informal) hasty solution; (informal) approach; (informal) fraud n. (Fix) (US) Fix (name of person)"],"usphone":"fɪks","ukphone":"fɪks"},{"name":"tart","trans":["adj. sour; sharp; sharp n. flan; prostitute vt. Dress up n. (Tart) person's name; (English) Tart"],"usphone":"tɑːt","ukphone":"tɑːt"},{"name":"treat","trans":["vt. Treat; treat; discuss; treat as vi. Discuss; Invite; Negotiate n. Invite; Treat n. (Treat) Name; (English) Treat"],"usphone":"triːt","ukphone":"triːt"},{"name":"upset","trans":["vt. Annoying; disrupting; disrupting vi. Falling over adj. Annoying; chaotic; disorienting n. Confusion; overturning; subversive"],"usphone":"ʌpˈset","ukphone":"ʌpˈset"},{"name":"beautiful","trans":["adj. Beautiful, excellent, charming, charming"],"usphone":"ˈbjuːtɪfl","ukphone":"ˈbjuːtɪfl"},{"name":"flag","trans":["n. Flags, national flags; (sporting) signal flags, flags; irises, irises; thick slate for paving the road; countries they are loyal to; small paper emblems; flagship flags; flag devices; empty taxi displays; characteristic positions; indicators; prominent deer tail markings; plants with slender leaves v. signs; fatigue, weakness; decline in enthusiasm; draw attention to...; wave a flag to indicate a certain direction; indicate a car to stop; use a label to mark"],"usphone":"flæɡ","ukphone":"flæɡ"},{"name":"free","trans":["adj. free; free, unfettered; [chemical] free vt. free, liberate; release adv. Freely; free n. (Free) person's name; (English) Frey"],"usphone":"friː","ukphone":"friː"},{"name":"national","trans":["adj. of a country; of a nation; of a nation; of a nation n. Nationals"],"usphone":"ˈnæʃnəl","ukphone":"ˈnæʃnəl"},{"name":"symbol","trans":["n. Symbols; symbols; signs"],"usphone":"ˈsɪmbl","ukphone":"ˈsɪmbl"},{"name":"battery","trans":["n. [electric] battery, battery n. [law] beating n. [military] batteries, gun positions"],"usphone":"ˈbætri; ˈbætəri","ukphone":"ˈbætri; ˈbætəri"},{"name":"charge","trans":["n. Expenses; Charges; Control; Complaints; Orders; Load vt. Charge; blame; load; charge...; charge...; rush to... vi. Charging; suing; asking for a price; rushing forward; recording n. (Charge) name; (France) Charles; (English) Chach"],"usphone":"tʃɑːdʒ","ukphone":"tʃɑːdʒ"},{"name":"chemical","trans":["n. Chemicals, chemicals adj. chemical"],"usphone":"ˈkemɪkl","ukphone":"ˈkemɪkl"},{"name":"electricity","trans":["n. Electricity; electric current; strong nervousness"],"usphone":"ɪˌlekˈtrɪsəti","ukphone":"ɪˌlekˈtrɪsəti"},{"name":"energy","trans":["n. [physical] energy; energy; vitality; spirit"],"usphone":"ˈenədʒi","ukphone":"ˈenədʒi"},{"name":"power","trans":["n. Power, ability; electricity, power, performance; regime, power; [number] power vt. Motivate; motivate; empower... vi. Move fast adj. N. (Power) name of a person who manipulates power by influencing powerful people; (English, Portuguese) Bauer"],"usphone":"ˈpaʊə(r)","ukphone":"ˈpaʊə(r)"},{"name":"different","trans":["adj. different; individual, unique"],"usphone":"ˈdɪfrənt","ukphone":"ˈdɪfrənt"},{"name":"enemy","trans":["n. Enemy, enemy; enemy army adj. Enemy's, enemy's"],"usphone":"ˈenəmi","ukphone":"ˈenəmi"},{"name":"friend","trans":["n. Friend; Assistant; Sponsor n. (Friend) Name; (English) Flanders"],"usphone":"frend","ukphone":"frend"},{"name":"hiss","trans":["vi. Booing; booing n. Booing; hissing n. (Hiss) name; (English, German) Heath; (France) Isse"],"usphone":"hɪs","ukphone":"hɪs"},{"name":"race","trans":["n. Genus, species; race, race; family, category; events, racing vt. Make them participate in the race; and... race; make them run fast and move at full speed vi. Compare speed, participate in the race; run at full speed n. (Race) name; (English) Race; (Se) Lace"],"usphone":"reɪs","ukphone":"reɪs"},{"name":"wake","trans":["vi. wake up; wake up; alert vt. Wake up; inspire n. Trail; Vigil; Mourner n. (Wake) name; (English) Wake"],"usphone":"weɪk","ukphone":"weɪk"},{"name":"celebrate","trans":["vt. celebrate; hold; praise; congratulate; proclaim vi. Celebrate; celebrate holidays; hold religious ceremonies"],"usphone":"ˈselɪbreɪt","ukphone":"ˈselɪbreɪt"},{"name":"confetti","trans":["n. Confetti (thrown at a wedding or carnival); candy (thrown at an old carnival or celebration) n. (Confetti) person's name; (Italian) Confetti"],"usphone":"kənˈfeti","ukphone":"kənˈfeti"},{"name":"crack","trans":["v. Breaking; cracking; cracking (grain); cracking (a safe); successfully obtained; heavy impact (audible); (making) a bursting sound; (suddenly) hoarse; giving in; (informal) being unable to eat; (informal) suddenly laughing; (informally) finding a solution; stopping; opening a bottle; saying (jokes); cracking (hydrocarbons) n. Crack; crack; crack; crack; crack; burst sound; (audible); heavy impact Potent cocaine; jokes (at bitter people); good times; flaws (in opinions or systems); voice changes adj. Well-trained, highly skilled, the best n. (Crack) (English, Canada, US) Clark (name)"],"usphone":"kræk","ukphone":"kræk"},{"name":"eggshell","trans":["n. Eggshell; something thin and brittle"],"usphone":"ˈeɡʃel","ukphone":"ˈeɡʃel"},{"name":"fill","trans":["vt. Fill up, fill; satisfy; block; serve vi. Filled, expanded n. Satisfied; filled volume; filler n. (Fill) name of person; (German, Russian,) Phil"],"usphone":"fɪl","ukphone":"fɪl"},{"name":"painted","trans":["adj. drawn; colored; painted v. paint (past tense and past participle of paint) n. (Painted) person's name; (Sweden) Painted"],"usphone":"'peɪntɪd","ukphone":"'peɪntɪd"},{"name":"cycle","trans":["n. Cycle; cycle; bicycle; complete set; a period of time vt. Make a cycle; make a rotation vi. Cycling; Biking; Rotation"],"usphone":"ˈsaɪkl","ukphone":"ˈsaɪkl"},{"name":"fall","trans":["v. Falling; falling; sagging; kneeling; falling down (ground); falling (in quantity, etc.); falling (rain or snow); falling; falling (in a certain state); falling; falling (of snow, rock, etc.); falling (in quantity, etc.); fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; fall; collapse, decay adj. n. (Fall) (West) Fowler (name of person) of autumn"],"usphone":"fɔːl","ukphone":"fɔːl"},{"name":"season","trans":["n. Period; season; season vt. Season...; adapt vi. becomes mature; becomes dry"],"usphone":"ˈsiːzn","ukphone":"ˈsiːzn"},{"name":"spring","trans":["n. Spring; springs; springs; vitality; jumping adj. Spring vi. Grow; erupt; leap; crack vt. Make it jump; make it explode; suddenly propose; make it pop n. (Spring) name; (Germany) Sprin; (England, Finland, Sweden) Spring"],"usphone":"sprɪŋ","ukphone":"sprɪŋ"},{"name":"summer","trans":["n. Summer; heyday vi. escape the heat; spend the summer adj. Summer n. (Summer) names; (German) Zumer; (English) Summer"],"usphone":"ˈsʌmə(r)","ukphone":"ˈsʌmə(r)"},{"name":"winter","trans":["n. Winter; age; depression period vi. Winter adj. Winter's; n. (Winter) person's name for wintering; (English, German, German, German, Russian, Czech, West, Finland, Sweden, France) Winter"],"usphone":"ˈwɪntə(r)","ukphone":"ˈwɪntə(r)"},{"name":"clothes","trans":["n. Clothes"],"usphone":"kləʊðz; kləʊz","ukphone":"kləʊðz; kləʊz"},{"name":"find","trans":["vt. Find, find; discover; think; feel; obtain vi. ruling n. Find n. (Find) person's name; (Dan) Finn"],"usphone":"faɪnd","ukphone":"faɪnd"},{"name":"pile","trans":["n. Heaps; large numbers; building complexes vt. Accumulated; piling in vi. crowding; accumulation; accumulation n. (Pile) person's name; (West) Pillay; (English) Pyle"],"usphone":"paɪl","ukphone":"paɪl"},{"name":"room","trans":["n. Room; space; leeway; opportunity; everyone in the room vt. Provide accommodation for...; rent, share; stay, stay... vi. Residence; Accommodation n. (English) Rum (name); (Russian) Roma (name)"],"usphone":"ruːm; rʊm","ukphone":"ruːm; rʊm"},{"name":"sort","trans":["n. Type; Method; Quality vi. Classification; Coordination; Interaction vt. categorize...; sort...; pick out something"],"usphone":"sɔːt","ukphone":"sɔːt"},{"name":"cheek","trans":["n. Cheeks, cheeks; hips vt. Speak disrespectfully to..., be bold and rude to... n. (Cheek) person's name; (English) Cheek"],"usphone":"tʃiːk","ukphone":"tʃiːk"},{"name":"eyebrow","trans":["n. Eyebrows v. Draw eyebrows for...; force by frowning and raising one's forehead"],"usphone":"ˈaɪbraʊ","ukphone":"ˈaɪbraʊ"},{"name":"eyelid","trans":["n. [Anatomy] eyelids; eyelids"],"usphone":"ˈaɪlɪd","ukphone":"ˈaɪlɪd"},{"name":"face","trans":["n. Face; Face; Face; Face; Appearance; Prestige vi. Toward; morning vt. face; face; acknowledge; erase n. (Face) person's name; (France) Faith; (Italy) Fache"],"usphone":"feɪs","ukphone":"feɪs"},{"name":"mouth","trans":["n. Mouth, mouth; estuary vt. Say it playfully, say it in a pretentious manner; say vi in a whisper. pretend to speak"],"usphone":"maʊθ","ukphone":"maʊθ"},{"name":"nose","trans":["n. Nose; sense of smell; prominent part; inquiry vt. Smell; touch with your nose vi. Carefully explore and move forward; inquire"],"usphone":"nəʊz","ukphone":"nəʊz"},{"name":"complementary","trans":["adj. Complementary; complementary (genetic sequence, etc.); complementary medicine; auxiliary; complementary color; surplus"],"usphone":"ˌkɒmplɪˈmentri","ukphone":"ˌkɒmplɪˈmentri"},{"name":"shade","trans":["n. Shade of trees; shadows; cool places; shade; brightness (such as photographs); small amount, slight; slight differences vt. To darken; to make gradients; to shade...; to disguise; to cover up vi. (Color, color, etc.) Gradient n. (Shade) person's name; (English, German) Shedd"],"usphone":"ʃeɪd","ukphone":"ʃeɪd"},{"name":"tint","trans":["n. Color; light color vt. Dye (hair); color... n. (Tint) person's name; (Myanmar) ding"],"usphone":"tɪnt","ukphone":"tɪnt"},{"name":"community","trans":["n. Communities; [ecological] communities; communities; groups"],"usphone":"kəˈmjuːnəti","ukphone":"kəˈmjuːnəti"},{"name":"deliver","trans":["vt. Deliver; publish; deliver; release; give (hit); deliver... vi. Realize; transfer; fulfill; deliver n. Pitching"],"usphone":"dɪˈlɪvə(r)","ukphone":"dɪˈlɪvə(r)"},{"name":"firefighter","trans":["n. Firefighters"],"usphone":"ˈfaɪəfaɪtə(r)","ukphone":"ˈfaɪəfaɪtə(r)"},{"name":"healthy","trans":["adj. Healthy, robust; beneficial to the body and mind; wise, reasonable; well-functioning, thriving and developed; numerous, impressive"],"usphone":"ˈhelθi","ukphone":"ˈhelθi"},{"name":"thermometer","trans":["n. Thermometer; thermometer"],"usphone":"θəˈmɒmɪtə(r)","ukphone":"θəˈmɒmɪtə(r)"},{"name":"worker","trans":["n. Worker; worker; worker ant n. (Worker) name; (English) Walker"],"usphone":"ˈwɜːkə(r)","ukphone":"ˈwɜːkə(r)"},{"name":"cork","trans":["n. Cork oak bark; bottle stopper; cork stopper vt. Seal it with a bottle stopper"],"usphone":"kɔːk","ukphone":"kɔːk"},{"name":"float","trans":["v. Float, float; drift; float; drift; arrange (loan) for consideration (idea or plan); issue (stock) listing; implement (currency exchange rate) free floating (currency exchange rate); spare change (used by bars, etc. to find change for customers); floats, floats; floats; drinks with ice cream; floats; drinks with ice cream; floating period; sitting in a floating box (treatment of illness, healing, or relaxation); lifebuoy n. (Float) (US, UK, Germany) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Float) (US, UK, Germany) (Float) (Person's name)"],"usphone":"fləʊt","ukphone":"fləʊt"},{"name":"marble","trans":["n. Marble; marble products; marbles adj. Marbled; ruthless n. (Marble) name; (English) Marble"],"usphone":"ˈmɑːbl","ukphone":"ˈmɑːbl"},{"name":"sink","trans":["v. sink (in water or mud); sink (ship); fall; infiltrate; be fully understood; make sharp objects penetrate the surface; settle (object); disappear; reduce; make (sound) quieter; excavate; bury; sink, suppress; close to death; hide; hit the ball into a hole; (informally) drink n. sink, sink; sink; sink; (technical) sink, valley; school (or property) in poor areas; nest, place to hide dirt adj. n. (Sink) (American, English, Romania) sink (name) of a slum located in a poor area with poor social conditions"],"usphone":"sɪŋk","ukphone":"sɪŋk"},{"name":"watermelon","trans":["n.Watermelon"],"usphone":"ˈwɔːtəmelən","ukphone":"ˈwɔːtəmelən"},{"name":"climb","trans":["v. Climbing; climbing; climbing; (plants growing along a wall or shelf); promotion; (road) inclination upward; climbing; climbing in (or climbing out) with effort n. Climbing; adding value; improving (position or social status); climbing (ranking); mountain (to be climbed in mountaineering or climbing); mountain trail; (of an airplane) climbing"],"usphone":"klaɪm","ukphone":"klaɪm"},{"name":"cried","trans":["v. crying; shouting; barking; (birds or other animals) chirping; (hawkers) hawking along the street (past tense and past participle of cry)"],"usphone":"kraɪd","ukphone":"kraɪd"},{"name":"double","trans":["adj. Twice, double; in pairs; for two; two-faced; double sided; double level; (letters, numbers) connecting two; (flower) double; (dominoes) with the same number of points on both sides; (music) det with the same number of points on both sides; (music) det with an octave lower. It's twice n. Twice; double; a very similar counterpart; a living human soul; something for two; (plural) doubles (especially tennis); (in the same season or year) double champion, winning twice v. doubling; folding in half; common use (especially the bedroom); (bridge) is called doubling; (snooker) bounces (the ball) back; (sailing) sailing around (headland); (person, object) concurrently; also playing adv. Double ground, in pairs; double ground; bowed ground pron. Double (or amount) n. (Double) (US) Duble (personal name)"],"usphone":"ˈdʌbl","ukphone":"ˈdʌbl"},{"name":"look","trans":["vt. Look; expect; pay attention; aim; look like vi. Look; look; pay attention; look at n.; look; face n. (Look) name; (Sweden) Locke; (English) Luke"],"usphone":"lʊk","ukphone":"lʊk"},{"name":"trouble","trans":["n. Trouble; Trouble; Trouble; Unrest vt. Trouble; annoy; torment vi. Worry, worry"],"usphone":"ˈtrʌbl","ukphone":"ˈtrʌbl"},{"name":"grab","trans":["vt. Seize; seize; profoundly attract... vi. seize; seize n. Seize; seize; seize what"],"usphone":"ɡræb","ukphone":"ɡræb"},{"name":"manners","trans":["n. Courtesy (plural of manner) n. (Manners) name; (English, Swedish) Manners"],"usphone":"'mænəz","ukphone":"'mænəz"},{"name":"napkin","trans":["n. Napkins; napkins; diapers"],"usphone":"ˈnæpkɪn","ukphone":"ˈnæpkɪn"},{"name":"sip","trans":["v. Drink in small sips, n. One small sip (drink), one sip n. (Sip) (US, Netherlands) sip (name of person)"],"usphone":"sɪp","ukphone":"sɪp"},{"name":"slurp","trans":["vt. Eat or drink aloud vi. Eating or drinking loudly n. The sound of eating; the sound of slurping"],"usphone":"slɜːp","ukphone":"slɜːp"},{"name":"wipe","trans":["vt. Wipe; erase; paint vi. wipe; hit n. Wipe; hit hard"],"usphone":"waɪp","ukphone":"waɪp"},{"name":"booth","trans":["n. Stall; public telephone booth n. (Booth) name; (English) Booth; (Germany, Sweden) Bot"],"usphone":"buːð","ukphone":"buːð"},{"name":"change","trans":["v. Change, transform, (make) different; (make) transform; replace, replace; exchange; currency exchange; exchange... for change; refund n. Change, change; substitute; change for laundry; change, change; change; transfer; new experience; emergence of a new phase of the moon"],"usphone":"tʃeɪndʒ","ukphone":"tʃeɪndʒ"},{"name":"count","trans":["v. Counting; calculating the total number; counting..., including; important; formally accepted; considered as n. total; count; count; count of quantity; matters, charges; opinions; count (of yarn) n. (count) (US) count (US) count (name of person)"],"usphone":"kaʊnt","ukphone":"kaʊnt"},{"name":"sticker","trans":["n. Pasting labels, posters; persistent people; sharp knives; difficult problems n. (Sticker) (US, Germany, France, Australia) Stike (name of person)"],"usphone":"ˈstɪkə(r)","ukphone":"ˈstɪkə(r)"},{"name":"vote","trans":["n. Voting, election; ballot; number of votes obtained vt. Propose; vote; vote; accept vi. Election, name of person voting n. (Vote); (English, French) Walter"],"usphone":"vəʊt","ukphone":"vəʊt"},{"name":"come","trans":["vi. come; begin; appear; occur; become; arrive vt. Do; pretend; will be (... years old) int. Hi there! n. (Come) person's name; (English) Comme; (Alba) Jomey"],"usphone":"kʌm","ukphone":"kʌm"},{"name":"cookie","trans":["n.Cookies; small desserts"],"usphone":"ˈkʊki","ukphone":"ˈkʊki"},{"name":"farm","trans":["n. Farms; farmhouses; farms, feedlots; production (or processing) enterprises v. farming, farming, animal husbandry; outsourcing...; putting (someone) in foster care; (temporarily) transfer, rent out; subcontract (taxation)"],"usphone":"fɑːm","ukphone":"fɑːm"},{"name":"fence","trans":["n. Fences; fences; swordsmanship vt. Protect; use a fence; practice sword fighting vi. Fencing; forging; fencing; jumping over fences"],"usphone":"fens","ukphone":"fens"},{"name":"growl","trans":["v. (animals, especially dogs) barking low; barking in a low voice; (object) rumbling n. Low bark (especially from dogs); roar (made by humans); rumbling (from machines or engines)"],"usphone":"ɡraʊl","ukphone":"ɡraʊl"},{"name":"mall","trans":["n. Shopping malls, shopping malls; pedestrian commercial areas; walking trails; circus courts n. (Mall) (US, Switzerland) Myler (name of person)"],"usphone":"mɔːl; mæl","ukphone":"mɔːl; mæl"},{"name":"helicopter","trans":["n. [aviation] helicopter vi. [Sailing] By helicopter vt. Delivered by helicopter"],"usphone":"ˈhelɪkɒptə(r)","ukphone":"ˈhelɪkɒptə(r)"},{"name":"machine","trans":["n. Machinery, machines; institutions; people who work like machines vt. Using a machine to make n. (Machine) person's name; (Italian) Makine"],"usphone":"məˈʃiːn","ukphone":"məˈʃiːn"},{"name":"mask","trans":["n. Mask; mask; disguise vi. Disguise; wear a mask; dress up vt. disguise; wear a mask; blur"],"usphone":"mɑːsk","ukphone":"mɑːsk"},{"name":"spray","trans":["n. Sprays, sprays; sprayers; water bubbles vt. Jet vi. Spray n. (Spray) person's name; (English) Spray"],"usphone":"spreɪ","ukphone":"spreɪ"},{"name":"tool","trans":["n. Tools, utensils; instruments, machine tools; means vi. Use tools; equip the factory with machine tools vt. Use tools to process..."],"usphone":"tuːl","ukphone":"tuːl"},{"name":"boat","trans":["n. Small boat; ship vi. rowing"],"usphone":"bəʊt","ukphone":"bəʊt"},{"name":"fish","trans":["n. Fish; Fish; Pisces; Joint Board; (informal) weirdo; (informal) torpedo v. Fishing, fishing; searching; asking for news; salvage; patching n. (Fish) (American, Love) Fish (name of person) with a junction board"],"usphone":"fɪʃ","ukphone":"fɪʃ"},{"name":"lake","trans":["n.Lake; dark red pigment; carmine vt. (Make) hemolytic vi. (To) dissolve blood cells n. (Lake) name; (Germany, Serbia, Sweden) Lark; (English) Lake"],"usphone":"leɪk","ukphone":"leɪk"},{"name":"pole","trans":["n. Rod; pole; electrode vt. Use a pole to support n. (Pole) person's name; (English) Pol; (Russian) Bole; (Se) Pole"],"usphone":"pəʊl","ukphone":"pəʊl"},{"name":"worm","trans":["n. Bugs, worms; worms; threads; little people vt. Make it peristaltic; exterminate insects; move slowly vi. Move slowly; crawl n. (Worm) name; (Germany, Denmark, Portugal) Worm"],"usphone":"wɜːm","ukphone":"wɜːm"},{"name":"alien","trans":["adj. foreign; different, different in nature; incompatible n. Alien, alien; alien vt. Extradition, transfer of n. (Alien) person's name; (France) Alien"],"usphone":"ˈeɪliən","ukphone":"ˈeɪliən"},{"name":"astronaut","trans":["n. Astronauts, astronauts; space travelers"],"usphone":"ˈæstrənɔːt","ukphone":"ˈæstrənɔːt"},{"name":"pretend","trans":["vi. pretend, disguise, pretend adj. Pretend vt. Pretend, disguise, simulate"],"usphone":"prɪˈtend","ukphone":"prɪˈtend"},{"name":"submarine","trans":["n. Submarines; undersea organisms adj. Undersea; underwater vt. Attack vi with a submarine. Swipe down; slide down"],"usphone":"ˌsʌbməˈriːn; ˈsʌbməriːn","ukphone":"ˌsʌbməˈriːn; ˈsʌbməriːn"},{"name":"warrior","trans":["n. Warriors, warriors; advocates of war"],"usphone":"ˈwɒriə(r)","ukphone":"ˈwɒriə(r)"},{"name":"flashlight","trans":["n. Flashlights; flashes"],"usphone":"ˈflæʃlaɪt","ukphone":"ˈflæʃlaɪt"},{"name":"flight","trans":["n. Flight; flight; escape vt. Shoot; make a surprise fly vi. Migrant n. (Flight) person's name; (English) Fright"],"usphone":"flaɪt","ukphone":"flaɪt"},{"name":"howl","trans":["v. Howling (dog, wolf, etc.); shouting (due to pain, anger, etc.); (wind) screaming; yelling; crying; howling (dog, wolf, etc.); howling (due to pain, fear, etc.); (strong wind) howling; trembling effect"],"usphone":"haʊl","ukphone":"haʊl"},{"name":"shadow","trans":["n. Shadows; shadows; ghosts; shelters; hideouts vt. Obscure; obscure; trailing; indicate vi. Get dark adj. The shadow cabinet's"],"usphone":"ˈʃædəʊ","ukphone":"ˈʃædəʊ"},{"name":"wiggle","trans":["v. Make it swing, make it wobble n. Swing, twist"],"usphone":"ˈwɪɡl","ukphone":"ˈwɪɡl"},{"name":"directions","trans":["n. Direction; Instructions; Instructions for Use (plural form of direction)"],"usphone":"dɪ'rekʃ(ə)nz","ukphone":"dɪ'rekʃ(ə)nz"},{"name":"follow","trans":["vt. Follow; follow; pursue; pay close attention; watch; pay attention; listen vi. follow; then n. Follow; follow"],"usphone":"ˈfɒləʊ","ukphone":"ˈfɒləʊ"},{"name":"learn","trans":["vt. Learn; Learn; Recognize vi. Learn; learn"],"usphone":"lɜːn","ukphone":"lɜːn"},{"name":"passage","trans":["n. Section (article); Corridors; Passages; Passages; Itinerary; Fares vi. Through channel n. (Passage) (US) Pasic (personal name)"],"usphone":"ˈpæsɪdʒ","ukphone":"ˈpæsɪdʒ"},{"name":"start","trans":["vt. Start; start vi. Departure n. Start; starting point"],"usphone":"stɑːt","ukphone":"stɑːt"},{"name":"work","trans":["n. Work; work; product; operation; occupation; act; career; factory; work; literary, musical or artistic work vt. Make work; operate; operate; move forward slowly vi. Work; operate; function n. (Work) (English, Esse, Dan, Bing, US) Walker (name of person)"],"usphone":"wɜːk","ukphone":"wɜːk"},{"name":"compass","trans":["n. Compass, compass; compass vt. sieges"],"usphone":"ˈkʌmpəs","ukphone":"ˈkʌmpəs"},{"name":"east","trans":["n. East; East; church altars adj. Oriental, eastward; (wind) from the east; eastern end of church altars; eastern (region, etc.) adv. To the east, to the east n. (East) (US, UK, Canada) East (name)"],"usphone":"iːst","ukphone":"iːst"},{"name":"map","trans":["n. Maps; celestial maps; diagrams, distribution maps; chromosome maps; (informal) faces v. Draw maps; understand information; plan; map; map; relate to...; determine the location of genes in the chromosome n. (Map) (US) map (name of person)"],"usphone":"mæp","ukphone":"mæp"},{"name":"north","trans":["n. North, North adj. Northern; north-facing adv. To the north, to the north"],"usphone":"nɔːθ","ukphone":"nɔːθ"},{"name":"south","trans":["n. South; (compass's) south adj. Those located in the south; (wind) those from the south; those who live in the south; adv. South, south v. moving south; (celestial body) crossing the meridian n. (South) (US) Su (name of person)"],"usphone":"saʊθ","ukphone":"saʊθ"},{"name":"west","trans":["n. West; West; West adj. Western-facing; west-facing adv. In the West; to the West; from the West n. (West) name; (English, Germany, Finland, Sweden) West"],"usphone":"west","ukphone":"west"},{"name":"air","trans":["n. Air, atmosphere; sky; appearance; tune vt. Ventilate and dry; brag vi. venting"],"usphone":"eə(r)","ukphone":"eə(r)"},{"name":"animal","trans":["n. Animals Animal's"],"usphone":"ˈænɪml","ukphone":"ˈænɪml"},{"name":"plant","trans":["n. Factories, workshops; plants; equipment; crops vt. Plant; cultivate; cultivate; place vi. Name of the person who planted n. (Plant); (English, Spanish, Italian) Plant; (France) Prand"],"usphone":"plɑːnt","ukphone":"plɑːnt"},{"name":"soil","trans":["n. Land; soil; country; manure; agriculture; hotbed vt. Dirty; humiliate vi. Getting dirty"],"usphone":"sɔɪl","ukphone":"sɔɪl"},{"name":"sunlight","trans":["n. Sunshine n. (Sunlight) person's name; (English) Sunlight"],"usphone":"ˈsʌnlaɪt","ukphone":"ˈsʌnlaɪt"},{"name":"water","trans":["n. Water; seawater; rainwater; ocean, large areas of water vt. Moisten; supply water; water... vi. Adding water; crying; drooling n. (Water) person's name; (English) Water"],"usphone":"ˈwɔːtə(r)","ukphone":"ˈwɔːtə(r)"},{"name":"heard","trans":["v. Hear (past tense and past participle of hear); know n. (Heard)'s name; (English) Heard"],"usphone":"hɜːd","ukphone":"hɜːd"},{"name":"helpful","trans":["adj. helpful; helpful"],"usphone":"ˈhelpfl","ukphone":"ˈhelpfl"},{"name":"noise","trans":["n. [Environmental] noise; noise; noise vt. Rumors vi. Make a sound; talk loudly about n. (Noise) people's names; (English) Neuss"],"usphone":"nɔɪz","ukphone":"nɔɪz"},{"name":"protect","trans":["vt. protection, defense; vigilance"],"usphone":"prəˈtekt","ukphone":"prəˈtekt"},{"name":"shoo","trans":["int. Hush (sound made when chasing away birds, etc.) v. booing will drive... away"],"usphone":"ʃuː","ukphone":"ʃuː"},{"name":"breathe","trans":["vi. Breathe; whisper; breathe; (wind) gently blow vt. Breathe; Breathe; Breathe; Speak in a low voice"],"usphone":"briːð","ukphone":"briːð"},{"name":"hunt","trans":["v. Hunting; searching; hunting; (UK) fox hunting; hunting with (horses and hounds) (especially fox or deer hunting); hunting with dogs (or horses); hunting (animals); (animal) hunting); (machine, instrument pin, or system) swinging; (aircraft or rocket) swinging irregularly n. Searching; hunting; (UK) foxhunting activities; hunting teams (where foxhunting is often held in the United Kingdom); hunting groups; hunting grounds; hunting grounds; hunting n. (American) (American) (American name))"],"usphone":"hʌnt","ukphone":"hʌnt"},{"name":"slither","trans":["v. Gliding, snaking, crawling; stumbling (due to steep or slippery ground, etc.), stumbling n. Sliding; long flakes, debris"],"usphone":"ˈslɪðə(r)","ukphone":"ˈslɪðə(r)"},{"name":"swan","trans":["n. Swan; Swan zodiac sign vi. Wandering, wandering n. (Swan) name; (English, Finn, Germany) Swan"],"usphone":"swɒn","ukphone":"swɒn"},{"name":"wave","trans":["v. Waving; waving; waving; fluttering; making (hair) slightly wavy n. Ocean waves; heartbeat; emerging person (or object); waving; waves; (hair) curling; (emotional) outbursts"],"usphone":"weɪv","ukphone":"weɪv"},{"name":"colony","trans":["n. Colonies; Migrants; Populations; Animal habitats"],"usphone":"ˈkɒləni","ukphone":"ˈkɒləni"},{"name":"gaggle","trans":["n. A swarm; a group of geese; a giggle vi. rattle"],"usphone":"ˈɡæɡl","ukphone":"ˈɡæɡl"},{"name":"murder","trans":["n. Murder, murder; (informal) something difficult, hated; (informal) something that makes one part of the body extremely uncomfortable v. murder, committing murder; bad, vandalism; complete defeat (during a game); (informal) eating (or drinking) with relish; (informal) severe punishment; (informal) severe punishment, losing anger at..."],"usphone":"ˈmɜːdə(r)","ukphone":"ˈmɜːdə(r)"},{"name":"pod","trans":["n. Cocoons; bean pods vi. Knot pod vt. Peel n. (Pod) person's name from the pod; (Ro) Bode"],"usphone":"pɒd","ukphone":"pɒd"},{"name":"smack","trans":["v. Punch, hit; throw, drop; forcefully hit, hit, throw; kick; throw a whip; smell of... n. Punch (); knock (bang); (informal) kiss; taste; signs; () heroin; small fishing boat adv. exactly, unbiased; abruptly"],"usphone":"smæk","ukphone":"smæk"},{"name":"budge","trans":["vi. Move; move slightly; change attitude or opinion; obey vt. make concessions; move; change attitudes or opinions n. Lambskin n. (Budge) name; (English) Bach"],"usphone":"bʌdʒ","ukphone":"bʌdʒ"},{"name":"burst","trans":["v. Explosion; puncture; explosion; burst (organ or blood vessel); full; full; full of emotion; sudden explosion (some kind of feeling); burst; break; paging, breaking paper n. Explosion; burst; burst; sprint; short burst of fire n. (Burst) (US) Boulster (name of person)"],"usphone":"bɜːst","ukphone":"bɜːst"},{"name":"heap","trans":["n. Heap; many; cumulative vt. Heap; stack vi. Pile up n. (Heap) names; (Finn) Haiyap; (Southeast Asian Chinese) Association; (English) Shipp"],"usphone":"hiːp","ukphone":"hiːp"},{"name":"sprout","trans":["vi. Germinate; grow shoots vt. Germinate; sprout n. Sprout; sprout; sprout; sprout n. (Sprout) person's name; (English) Sprout"],"usphone":"spraʊt","ukphone":"spraʊt"},{"name":"turnip","trans":["n.Radishes; turnips, kohlrabi"],"usphone":"ˈtɜːnɪp","ukphone":"ˈtɜːnɪp"},{"name":"bubble","trans":["n. Bubbles, bubbles, bubbles; transparent round cover, round top vi. Boiling, bubbling; making a bubbling sound vt. make bubbles; talk nonstop"],"usphone":"ˈbʌbl","ukphone":"ˈbʌbl"},{"name":"glass","trans":["n. Glass; glass products; mirrors vt. Reflect; add glass to something vi. Glassy n. (Glass) name; (English, French, German, Italian) Glass"],"usphone":"ɡlɑːs","ukphone":"ɡlɑːs"},{"name":"glassblower","trans":["n. A person or machine that blows glass"],"usphone":"'ɡlæs,blor","ukphone":"'ɡlæs,blor"},{"name":"gooey","trans":["adj. adhesive; sentimental n. adhesive; honey"],"usphone":"ˈɡuːi","ukphone":"ˈɡuːi"},{"name":"pipe","trans":["n.Pipe; pipe; flute vi. Play the flute; scream vt. Conveying with pipes; singing loudly; playing n. (Pipe) names with wind instruments; () Pippi; (English) Pip"],"usphone":"paɪp","ukphone":"paɪp"},{"name":"chick","trans":["n. Chicks; birds; young women adj. timid; cowardly n. (Chick) name; (English) Chick"],"usphone":"tʃɪk","ukphone":"tʃɪk"},{"name":"egg","trans":["n.Eggs; eggs; guys; eggs vt. Inciting; instigating n. (Egg) name; (French, English) Egg"],"usphone":"eɡ","ukphone":"eɡ"},{"name":"hatch","trans":["n. Incubation; hatch vt. ; planning vi. Hatching n. (Hatch) name; (Western) Archie; (English) Hatch"],"usphone":"hætʃ","ukphone":"hætʃ"},{"name":"incubator","trans":["n. Thermostats (for the care of frail infants or premature infants), incubators; bacterial incubators; microbial incubators; incubators (for emerging small businesses) (often equipped with logistics personnel and equipment, low rent)"],"usphone":"ˈɪŋkjubeɪtə(r)","ukphone":"ˈɪŋkjubeɪtə(r)"},{"name":"mark","trans":["n. Signs; marks; symbols; marks; scores vi. Mark vt.; mark; score n. Sign; mark; score"],"usphone":"mɑːk","ukphone":"mɑːk"},{"name":"heart","trans":["n. Heart; Feelings; Courage; Heart Shape; Key points vt. Encourage; remember vi. Name of the person who made up the knot n. (Heart); (English) Hart"],"usphone":"hɑːt","ukphone":"hɑːt"},{"name":"hibernate","trans":["vi. Overwinter; (animals) hibernate; (humans, etc.) shelter from the cold"],"usphone":"ˈhaɪbəneɪt","ukphone":"ˈhaɪbəneɪt"},{"name":"safe","trans":["adj. Safe; reliable; safe n. Safe; refrigerator; closet n. (Safe) name of person; (a few) Safi"],"usphone":"seɪf","ukphone":"seɪf"},{"name":"sleep","trans":["vi. Sleep n. Sleep n. Sleep n. (Sleep) person's name; (English) Sleep"],"usphone":"sliːp","ukphone":"sliːp"},{"name":"giggle","trans":["v. giggle, giggle n. Giggle, smirk; joke; (informal) funny person (or thing)"],"usphone":"ˈɡɪɡl","ukphone":"ˈɡɪɡl"},{"name":"kickball","trans":["n.Soccer games for kids"],"usphone":"ˈkɪkbɔːl","ukphone":"ˈkɪkbɔːl"},{"name":"knock","trans":["vi. knock; hit; tap vt. knock; knock; knock; criticism n. Knock; knock; knock; explosion"],"usphone":"nɒk","ukphone":"nɒk"},{"name":"present","trans":["adj. present; present; present; present; present; n. gift; present; present; present; present; present; (verb) present tense; aim (of firing a gun) v. give; present; present; present; make; describe; appear; host (program); perform; present; present; express (check or bill); submit (check or bill); thank you; (church) to take office as pastor who has been recommended by the bishop; formally submitted to the court; aim at a gun; reveal (disease) symptoms"],"usphone":"ˈpreznt","ukphone":"ˈpreznt"},{"name":"shy","trans":["adj. Shy; timid, timid vi. Throw; cringe; retreat; disgust vt. throw; random throw n. throw; shock jump n. (Shy) person's name; (English) Shy"],"usphone":"ʃaɪ","ukphone":"ʃaɪ"},{"name":"sofa","trans":["n. Sofa; Bench n. (Sofa) person's name; (Sai) Sofa"],"usphone":"ˈsəʊfə","ukphone":"ˈsəʊfə"},{"name":"fin","trans":["n. Fin; shark fin; fin vt. Remove the fins; install the wings vi. flapping fins; scuba diving n. (Fin) name; (French) fin"],"usphone":"fɪn","ukphone":"fɪn"},{"name":"flippers","trans":["n. Fins (plural of flipper); fins"]},{"name":"strong","trans":["adj. Strong; strong; firm; good at adv. Strongly; violently n. (Strong) person's name; (English) Strong"],"usphone":"strɒŋ","ukphone":"strɒŋ"},{"name":"wings","trans":["n. [Kun] wings (plural form of wing); flight badge; a wing-shaped badge worn by Girl Scouts n. (Wings) name; (de) Wings"]},{"name":"icy","trans":["adj. Cold; frozen; cold; (tone, attitude) Very unfriendly, hostile"],"usphone":"ˈaɪsi","ukphone":"ˈaɪsi"},{"name":"shower","trans":["n. Showers; a burst (appearing like a pouring), a large number; showers vt. Give in large quantities; get... wet vi. Showers; showers"],"usphone":"ˈʃaʊə(r)","ukphone":"ˈʃaʊə(r)"},{"name":"stormy","trans":["adj. stormy; violent; violent"],"usphone":"ˈstɔːmi","ukphone":"ˈstɔːmi"},{"name":"weather","trans":["n. Weather; Meteorology; Climate; Situation vt. Withstands; weathered; erodes; beaten by wind and rain vi. Weathered; eroded; weathered by wind and rain adj. Open air; n. (Weather) person's name in the wind; (English) Weather"],"usphone":"ˈweðə(r)","ukphone":"ˈweðə(r)"},{"name":"windy","trans":["adj. windy, windy; bloated; bragging"],"usphone":"ˈwɪndi","ukphone":"ˈwɪndi"},{"name":"detail","trans":["n. Details, trivia; specific information; minor parts; detachments, detachments vt. Details; Selection vi. Draw a detailed map"],"usphone":"ˈdiːteɪl","ukphone":"ˈdiːteɪl"},{"name":"frown","trans":["vi. frowned; disagree vt. frowning, frowning n. frowning, frowning"],"usphone":"fraʊn","ukphone":"fraʊn"},{"name":"materials","trans":["n. [material] material; material (plural of material); material science; material cost"],"usphone":"mə'tɪərɪəlz","ukphone":"mə'tɪərɪəlz"},{"name":"middle","trans":["adj. middle, middle; intermediate, medium n. middle, center; waist"],"usphone":"ˈmɪdl","ukphone":"ˈmɪdl"},{"name":"snow","trans":["n. Snow, snow; snow vi. Snowfall vt. Make one fall one after another; make white n. (Snow) person's name; (English) Snow"],"usphone":"snəʊ","ukphone":"snəʊ"},{"name":"supply","trans":["n. Supply, supplies; supplies vt. Supply, provision; supplement vi. supply; substitution"],"usphone":"səˈplaɪ","ukphone":"səˈplaɪ"},{"name":"balance","trans":["n. Balance; balance; proportionality vt. Balance; settle; make proportionate vi. Maintaining balance; proportionality; offsetting n. (Balance) names; (West) Barrance"],"usphone":"ˈbæləns","ukphone":"ˈbæləns"},{"name":"beam","trans":["n. Beams; light; radio waves; ship width; [measurement] scale vt. Send; supported by beams; irradiate with...; reveal vi. Irradiation; full of smiles n. (Beam) names; (Arabic) Bayam; (English) Bim"],"usphone":"biːm","ukphone":"biːm"},{"name":"gymnast","trans":["n. Gymnasts"],"usphone":"ˈdʒɪmnæst","ukphone":"ˈdʒɪmnæst"},{"name":"split","trans":["v. Split, divide (split into different factions); separate, divide, divide (split); split; divide (split); divide; divide; break, break; end a marriage (or relationship, work) relationship; leave quickly; cause (an atom) to nuclear fission; divulge (someone's) secrets and denounce someone; (head) severe pain n. rift, fissure; split (split); split (split); split (the split) the end (of a marriage, relationship, work relationship); a bun (or bread roll, cake) cut in half; Split wicker (for basket making); steel (or bamboo reeds); half a bottle (or half glass) of champagne (or other wine); a layer of animal skin (split in layers); extra columns (in a bocce ball); split-level houses; (racing) the time it takes to complete a distance, which takes time in segments; a draw, a game with consecutive draws adj. divisive"],"usphone":"splɪt","ukphone":"splɪt"},{"name":"stretch","trans":["v. stretching (soft or elastic); stretching; (making) excessive extension; (capital, resources) sufficient; extensive requirements; (making) maximum use (ability); exaggerating; continuing n. (limb or body) stretching; (muscle) stretching; stretching (of materials or clothing); difficult tasks; continuous stretch (of land or water); (time) continuous; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) length of time; (informal) lengthened motor vehicle adj. Elastic, stretchable n. (Stretch) (US) Strage (name of person)"],"usphone":"stretʃ","ukphone":"stretʃ"},{"name":"trampoline","trans":["n. Trampolines; spring pads"],"usphone":"ˌtræmpəˈliːn","ukphone":"ˌtræmpəˈliːn"},{"name":"flake","trans":["n. Small flakes, pieces; strange people; shelves; hard stone chips; v. peeling (of a rope or rope), peeling...; peeling...; turning... into slices; (informally) falling asleep and exhausting; loosening (rope) n. (Flake) (US) Flake (name of person)"],"usphone":"fleɪk","ukphone":"fleɪk"},{"name":"important","trans":["adj. important, significant; having status; having power"],"usphone":"ɪmˈpɔːtnt","ukphone":"ɪmˈpɔːtnt"},{"name":"nervous","trans":["adj. nervous; nervous; nervous; strong"],"usphone":"ˈnɜːvəs","ukphone":"ˈnɜːvəs"},{"name":"run","trans":["vi. Operation; running; operation vt. Management, management; operation; participation n. Running; racing; trends; running route n. (Run) name; (Se) Rune"],"usphone":"rʌn","ukphone":"rʌn"},{"name":"study","trans":["n. Study, research; subject; study room; study vt. Study; consider; study; scrutinize vi. Research; work n. (Study) person's name; (English) study"],"usphone":"ˈstʌdi","ukphone":"ˈstʌdi"},{"name":"subway","trans":["n. Subways; tunnels vi. By subway"],"usphone":"ˈsʌbweɪ","ukphone":"ˈsʌbweɪ"},{"name":"Chinese","trans":["adj. (Chinese) Chinese; Chinese; Chinese n. (Chinese) Chinese, Chinese; Chinese; (informal) Chinese food, Chinese restaurant n. (Chinese) (US, India, Australia, Pakistan) Chineses (name of person)"],"usphone":"ˌtʃaɪˈniːz","ukphone":"ˌtʃaɪˈniːz"},{"name":"garden","trans":["n. Garden; vegetable garden vt. Cultivated flowers and trees vi. Engaged in gardening; planting n. (Garden) name in the garden; (English, Italian, Baki) Garden"],"usphone":"ˈɡɑːdn","ukphone":"ˈɡɑːdn"},{"name":"glad","trans":["adj. Happy; happy vt. Make... happy n. (Glad) name; (Serbia, Sweden) Glade; (English) Glade; (France, Norway) Gera"],"usphone":"ɡlæd","ukphone":"ɡlæd"},{"name":"mirror","trans":["n. Mirrors; realistic portrayals; role models vt. reflect; reflect"],"usphone":"ˈmɪrə(r)","ukphone":"ˈmɪrə(r)"},{"name":"stand","trans":["vi. standing; located; stagnant vt. make stand; endure; resist n. Stand; stand; stand; stop"],"usphone":"stænd","ukphone":"stænd"},{"name":"earn","trans":["vt. Earn, earn; get, earn; make; earn n. (Earn) name; (Thai) yan"],"usphone":"ɜːn","ukphone":"ɜːn"},{"name":"money","trans":["n. Money; Money; Wealth n. (Money) Name; (English) Money; (Spanish, French) Monet"],"usphone":"ˈmʌni","ukphone":"ˈmʌni"},{"name":"proud","trans":["adj. Proud; proud; conceited; prominent n. (Proud) name; (English) Proud"],"usphone":"praʊd","ukphone":"praʊd"},{"name":"rake","trans":["n. Rake, target; prodigal; inclination (especially of a theater stage); front blade surface (of a cutting tool); bus cabin v. raking with a rake; shooting; searching; scratching (with branches or fingernails); (with a rake) to slant (the mast or chimney) towards the stern of the stern; determining the degree of inclination (especially of the stage) n. (Rake) (American, Indian) Lake (name of person)"],"usphone":"reɪk","ukphone":"reɪk"},{"name":"weed","trans":["n. Wild grass; aquatic plants; (informal) tobacco; (informal) cannabis; (informal) frail people; (informal) weak horses v. weeding; exclusion of n. (Weed) (US, UK, Canada, India, Australia) Weed (name of person)"],"usphone":"wiːd","ukphone":"wiːd"},{"name":"cowboy","trans":["n. Cowboys; shepherds; reckless people"],"usphone":"ˈkaʊbɔɪ","ukphone":"ˈkaʊbɔɪ"},{"name":"doctor","trans":["n. Doctor; Doctor; Dentist (title or title) Dentist; Clinic; (informal) Adviser; Knowledgeable person; Artificial flies; Cool ocean breezes; (informal) Chef on board v. Tampering, forgery; adding harmful substances (to food or drink); castrate (animals); treat diseases for...; grant a doctorate degree; repair (machine); interfere (ball); seek medical treatment; practice medicine"],"usphone":"ˈdɒktə(r)","ukphone":"ˈdɒktə(r)"},{"name":"glasses","trans":["n. [light] glasses; glass (plural form of glass); binoculars v. put... in a glass container; fill... with glass (3rd person singular form of glass)"],"usphone":"'glɑːsɪz","ukphone":"'glɑːsɪz"},{"name":"people","trans":["n. People; humans; nations; citizens vt. live in; fill the occupancy"],"usphone":"ˈpiːpl","ukphone":"ˈpiːpl"},{"name":"police officer","trans":["n. Police officers; police officers"],"usphone":"pəˈliːs ɒfɪsə(r)","ukphone":"pəˈliːs ɒfɪsə(r)"},{"name":"dessert","trans":["n. After-meal dessert; sweet snack n. (Dessert) person's name; (France) Dessel"],"usphone":"dɪˈzɜːt","ukphone":"dɪˈzɜːt"},{"name":"gobble","trans":["vi. gluttonous; giggle vt. swallowing n. Turkey screams"],"usphone":"ˈɡɒbl","ukphone":"ˈɡɒbl"},{"name":"invite","trans":["vt. invite, entertain; invite n. Invite"],"usphone":"ɪnˈvaɪt","ukphone":"ɪnˈvaɪt"},{"name":"problem","trans":["n. Difficulties; people causing trouble adj. problematic; difficult to deal with"],"usphone":"ˈprɒbləm","ukphone":"ˈprɒbləm"},{"name":"soar","trans":["vi. Surge; soar; soar; soar; soar; (trees, buildings, etc.) soar; (emotions) soar n. Fly high; soar n. (Soar) name; (English, Portuguese) Sol"],"usphone":"sɔː(r)","ukphone":"sɔː(r)"},{"name":"clue","trans":["n. Clue; plot (story, etc.) vt. Providing clues to...; providing circumstances for..."],"usphone":"kluː","ukphone":"kluː"},{"name":"form","trans":["n. Form, shape; form, appearance; form; table vt. Composition, composition; arrangement, organization; generation, shaping vi. Formation, composition; arrangement n. (Form) names; (English) Form; (France, Germany) Forum"],"usphone":"fɔːm","ukphone":"fɔːm"},{"name":"fossil","trans":["n. Fossils; rigid things; stubborn people adj. fossilized; obsolete, old-fashioned"],"usphone":"ˈfɒsl","ukphone":"ˈfɒsl"},{"name":"living","trans":["adj. Living; existing; used; living; living; living; active; realistic; (poem, text, meaning water) flowing n. livelihood; lifestyle; pastors' position (particularly in the old days) with paid housing; living person v. living; living; living; living; living; continuing to exist, preserve, remember; enjoy a full and exciting life (present participle of live) n. (Living) (English) Levine (name of person)"],"usphone":"ˈlɪvɪŋ","ukphone":"ˈlɪvɪŋ"},{"name":"past","trans":["adj. past, past, past; past; just past, just ended; (verb) past tense; completed, ended n. Past, past; past, past; (someone) past experience (or career); (grammar) past tense, past tense (of verb) prep. Pass by; pass by; (refers to an hour), after...; further away from..., on the other side; more than, over, over adv. pass, pass, from side to side; (time) pass, pass; exceed; later, after (after a certain period of time from a known hour)"],"usphone":"pɑːst","ukphone":"pɑːst"},{"name":"stony","trans":["adj. stone-covered; stone-made; stone-like; ruthless; stony"],"usphone":"ˈstəʊni","ukphone":"ˈstəʊni"},{"name":"ache","trans":["v. Pain (continuous); longing; sorrow, pity; feeling pain n. Pain (in a part of the body); Pain (an annoying or bittersweet emotion) n. (Ache) (US, Indonesia, France) Aceh (name of person)"],"usphone":"eɪk","ukphone":"eɪk"},{"name":"flu","trans":["n. Influenza n. (Flu) person's name; (France) Flu"],"usphone":"fluː","ukphone":"fluː"},{"name":"groan","trans":["vi. moaning; complaining; crackling vt. moaning; complaining n. Moaning; sighing; squeaking"],"usphone":"ɡrəʊn","ukphone":"ɡrəʊn"},{"name":"moan","trans":["vi. Complaining, lamenting; moaning n. Moaning; lamenting vt. Complain; moan and say n. (Moan) name; (France) Moan"],"usphone":"məʊn","ukphone":"məʊn"},{"name":"sneeze","trans":["vi. sneeze n. Sneeze"],"usphone":"sniːz","ukphone":"sniːz"},{"name":"wheeze","trans":["v. Wheezing; speaking out with a breath; walking around panting; (instrument) wheezing n. Gasping sound; (informal) ingenious idea; (no longer funny) outdated joke"],"usphone":"wiːz","ukphone":"wiːz"},{"name":"corner","trans":["n. Corners, corners; regions, remote places; dilemmas, dilemmas vi. Accumulation; intersecting angles vt. Monopoly; forced into a corner; brought into a desperate situation; difficult... n. (Corner) names; (France) Colne; (English) Kona"],"usphone":"ˈkɔːnə(r)","ukphone":"ˈkɔːnə(r)"},{"name":"roller coaster","trans":["roller coasters; roller coasters; sudden changes in mood"],"usphone":"ˈrəʊlə kəʊstə(r)","ukphone":"ˈrəʊlə kəʊstə(r)"},{"name":"tunnel","trans":["n. Tunnels; tunnels; cave passages vt. Dig; open a channel in...; excavate a tunnel in... vi. Excavate tunnels; open passages"],"usphone":"ˈtʌnl","ukphone":"ˈtʌnl"},{"name":"wind","trans":["n. Wind; Breathing; Odor; Circumference vt. Winding; twisting; bending; blowing a horn; wrapping or entangling someone vi. Winding; Clockwork; Blowing the horn n. (Wind) name; (English, Germany, Sweden) Wind"],"usphone":"wɪnd","ukphone":"wɪnd"},{"name":"heavy","trans":["adj. heavy; heavy, huge; overcrowded; gloomy n. Heavy; serious character adv. massively; bulkily"],"usphone":"ˈhevi","ukphone":"ˈhevi"},{"name":"library","trans":["n. Library, library; library"],"usphone":"ˈlaɪbrəri; ˈlaɪbri","ukphone":"ˈlaɪbrəri; ˈlaɪbri"},{"name":"pirate","trans":["n. Pirate, marauders at sea; pirates, patent infringers; persons (or organizations) that illegally produce television or radio programs; corrupt persons, offenders v. piracy, misappropriation; looting (ships); looting (ships) adj. pirated"],"usphone":"ˈpaɪrət","ukphone":"ˈpaɪrət"},{"name":"stack","trans":["n. (tidy) pile; large chimney (especially in a factory); stack (of hay or grain); high-fidelity audio equipment placed upright; a group of high-fidelity audio equipment placed vertically; (conical) gun racks (with several rifles); exhaust pipes (of vehicles); (waved) rock columns; piles (units of wood measurement) v. (make) lay them in a neat stack; (make) stack (unit of measurement of wood) v. (make) lay them on top of each other; (make) lay them on top of each other...; (make an airplane) wait to spin in layers Lu; (shuffling) cheating; falling n. (Stack) (US) Stark (name)"],"usphone":"stæk","ukphone":"stæk"},{"name":"whale","trans":["n. Whales; huge things v. (informal) beating; whaling; causing fiasco n. (Whale) (love) Wheeler (name of person)"],"usphone":"weɪl","ukphone":"weɪl"},{"name":"window","trans":["n. window; window; window"],"usphone":"ˈwɪndəʊ","ukphone":"ˈwɪndəʊ"},{"name":"decorate","trans":["vt. Decorate; arrange; award to vi. Decorate; Arrange"],"usphone":"ˈdekəreɪt","ukphone":"ˈdekəreɪt"},{"name":"scramble","trans":["v. (quickly and effortlessly) climbing; scrambling; finishing hard; rushing; rushing to (clothes); scrambling (eggs); jamming, reversing the frequency (changing phone or radio signals; listeners can only listen with special equipment); disrupting (thinking); ordering (aircraft) to take off urgently; (quarterback) running to the line of contention to avoid interception; disrupt; grow irregularly n. (especially those requiring a combination of hands and feet); difficult walking, climbing, and grabbing; scramble; motocross; (fighter) emergency takeoff; chaos, chaos"],"usphone":"ˈskræmbl","ukphone":"ˈskræmbl"},{"name":"sizzle","trans":["v. hissing (when frying food) n. hissing; enthusiasm (informal)"],"usphone":"ˈsɪzl","ukphone":"ˈsɪzl"},{"name":"sneak","trans":["vi. Jam; work secretly; make a small report to the teacher vt. Do it secretly; secretly obtain n. Sneaky person; sneaky act; whistleblower adj. Ongoing in the dark"],"usphone":"sniːk","ukphone":"sniːk"},{"name":"special","trans":["adj. Special; Important; Special; Special; Special; Special; Special; Special; Special (Subject) In-depth Research; Special (Education); Special (Matrix) n. Special (Event, Program, etc.); Special Price (Product); Special Offer; Special Food; Special Product; Shuttle n. (Special) (Special) (India, US, Russian) Spacia (name of person)"],"usphone":"ˈspeʃl","ukphone":"ˈspeʃl"},{"name":"comfortable","trans":["adj. Comfortable, comfortable n. Cover"],"usphone":"ˈkʌmftəbl; ˈkʌmfətəbl","ukphone":"ˈkʌmftəbl; ˈkʌmfətəbl"},{"name":"helmet","trans":["n. Steel helmet, helmet n. (Helmet) person's name; (Germany) Helmett"],"usphone":"ˈhelmɪt","ukphone":"ˈhelmɪt"},{"name":"motorcycle","trans":["n. Motorcycles; motor vehicles vi. Ride a motorcycle"],"usphone":"ˈməʊtəsaɪkl","ukphone":"ˈməʊtəsaɪkl"},{"name":"track","trans":["n. Track; footprint, trail; path vt. Track; pass; follow the path; use fiber vi. Track; walk; leave footprints"],"usphone":"træk","ukphone":"træk"},{"name":"traffic","trans":["n. Traffic; Transportation; Trade; [Communications] Traffic vt. In exchange for...; pass through... vi. Trade, buy and sell"],"usphone":"ˈtræfɪk","ukphone":"ˈtræfɪk"},{"name":"clothing","trans":["n. (general term) [clothing] clothing; canvas v. cover (in the form of clothe); dress for..."],"usphone":"ˈkləʊðɪŋ","ukphone":"ˈkləʊðɪŋ"},{"name":"lemonade","trans":["n.Lemonade"],"usphone":"ˌleməˈneɪd","ukphone":"ˌleməˈneɪd"},{"name":"pasta","trans":["n. Italian pasta; dough n. (Pasta) name; (English, Italian) pasta"],"usphone":"ˈpæstə","ukphone":"ˈpæstə"},{"name":"storm","trans":["n. Storms; great turmoil vi. Start a storm; go on a rampage; roar furiously vt. Onslaught; scolding n. (Storm) by name; (Sweden) Storm; (Germany) Storm; (English, West, Finn) Storm"],"usphone":"stɔːm","ukphone":"stɔːm"},{"name":"active","trans":["adj. active; active; active; effective; active n. Active voice; activist"],"usphone":"ˈæktɪv","ukphone":"ˈæktɪv"},{"name":"catch","trans":["vt. Catch; catch; infect; understand vi. catch; catch n. Catch; catch; window hook"],"usphone":"kætʃ","ukphone":"kætʃ"},{"name":"nectar","trans":["n. [Plant] nectar; nectar; sacred wine; any delicious drink n. (Nectar) name; (ro) nectar"],"usphone":"ˈnektə(r)","ukphone":"ˈnektə(r)"},{"name":"senses","trans":["n. [physiology] feeling; meaning; reason; judgment (plural of sense) v. understanding; feeling; understanding (the single three forms of sense) n. (Senses) person's name; (English) sense"]},{"name":"crater","trans":["n. Crater; crater vt. Form a pit on...; cancel; destroy vi. Form a pit; die out"],"usphone":"ˈkreɪtə(r)","ukphone":"ˈkreɪtə(r)"},{"name":"footprints","trans":["n. Footprints; footprints (plural of footprint); footprints"]},{"name":"gravity","trans":["n. Gravity, geocentric gravity; severity; solemnity"],"usphone":"ˈɡrævəti","ukphone":"ˈɡrævəti"},{"name":"Moon","trans":["n. Moon; Moon; Moonlight; Satellites vi. Laid-back; astonished vt. Hudu n. (Moon) name; (Sweden) Meng; () Meng; (English) Moon; (Myanmar) Meng"],"usphone":"muːn","ukphone":"muːn"},{"name":"suit","trans":["n. Suit, suit; clothing set (worn for a specific activity); all cards of the same color (in a playing card); a pair of armor; a set of sails; lawsuits; (informal) (influential) senior management; pursuit (particularly marriage proposal); (poetry, writing) (submitted to an authority) v. satisfy (someone) needs; match, fit; fit; fit; fit; (particularly for a specific activity) wear"],"usphone":"suːt; sjuːt","ukphone":"suːt; sjuːt"},{"name":"camping","trans":["n. Camping; Camping v. Camping; Camping; Temporary Settlement (in the form of camping)"],"usphone":"ˈkæmpɪŋ","ukphone":"ˈkæmpɪŋ"},{"name":"fishing","trans":["n. Fisheries; fishing (techniques); testing; assembly adj. fishing; v. fishing (in the form of fishing)"],"usphone":"ˈfɪʃɪŋ","ukphone":"ˈfɪʃɪŋ"},{"name":"picture","trans":["n. Photographs, pictures; videos; scenery; avatars vt. painting; imagining; describing"],"usphone":"ˈpɪktʃə(r)","ukphone":"ˈpɪktʃə(r)"},{"name":"sleeping bag","trans":["sleeping bag"],"usphone":"ˈsliːpɪŋ bæɡ","ukphone":"ˈsliːpɪŋ bæɡ"},{"name":"tent","trans":["n. Tents; residences; curtains vt. Cover it with a tent; make it possible to stay in a tent vi. Living in a tent; name of a person temporarily residing n. (Tent); (Russia, Sweden) tent"],"usphone":"tent","ukphone":"tent"},{"name":"favorite","trans":["adj. Most loved (equal to favorite) n. The most loved person (or thing); the most promising winner (in a competition or competition); Favorite (equal to favorite) v. Add... to a favorite n. (Favorite) (US) Favourite (US) Favourite (name of person)"],"usphone":"'feɪvərɪt","ukphone":"'feɪvərɪt"},{"name":"initials","trans":["n. First letter; abbreviation; capital letter in name (plural of initial)"],"usphone":"i'niʃəls","ukphone":"i'niʃəls"},{"name":"party","trans":["n. Political parties, parties; parties; parties vi. Attend social gatherings"],"usphone":"ˈpɑːti","ukphone":"ˈpɑːti"},{"name":"collar","trans":["n. Collars; collars vt. Grab; put a collar on...; put a collar on... n. (Collar) name; (French) Corral; (West) Collier; (English) Kohler"],"usphone":"ˈkɒlə(r)","ukphone":"ˈkɒlə(r)"},{"name":"dinosaur","trans":["n. Dinosaurs; people or things that are out of date or outdated"],"usphone":"ˈdaɪnəsɔː(r)","ukphone":"ˈdaɪnəsɔː(r)"},{"name":"food","trans":["n. Food; nutrients"],"usphone":"fuːd","ukphone":"fuːd"},{"name":"snake","trans":["n. Snakes; insidious people vi. Take a detour vt. Pull (timber, etc.); take a detour"],"usphone":"sneɪk","ukphone":"sneɪk"},{"name":"piñata","trans":["n. Pinata, painted earthenware pot n. (Pinata) name; (Italian) Pinata"]},{"name":"shape","trans":["n. Shape; Model; Body; Concretization vt. Form; shape, shape; conform to vi. Form; shape; grow n. (Shape) person's name; (Sweden) Sharpe"],"usphone":"ʃeɪp","ukphone":"ʃeɪp"},{"name":"spun","trans":["v. (Make) spin; (make) turn around quickly; spinning; connect to the net; drive to speed (past tense and past participle of spin) adj. Spun"],"usphone":"spʌn","ukphone":"spʌn"},{"name":"swing","trans":["v. Swing; hang; jump; rotate; rotate (on the axis); move (boat, plane) to all positions; (abruptly) turn; walk with a big swing; hang; walk; walk; jump; throw at...; fly (cricket) sideways; change (mood or opinion); gain; have a decisive influence on...; successfully completed; strong sense of rhythm n. Swing; swing; rhythm; light action (cricket) Side flying ball; (politician) A trip with multiple stays; hitting; ups and downs adj. Strong rhythm jazz music; decisive n. (Swing) (American, Swedish, English), Swain (personal name)"],"usphone":"swɪŋ","ukphone":"swɪŋ"},{"name":"confuse","trans":["vt. confuse; confuse"],"usphone":"kənˈfjuːz","ukphone":"kənˈfjuːz"},{"name":"disappear","trans":["vi. disappeared; disappeared; ceased to exist vt. make... not exist; make... disappear"],"usphone":"ˌdɪsəˈpɪə(r)","ukphone":"ˌdɪsəˈpɪə(r)"},{"name":"impossible","trans":["adj. Impossible; impossible to exist; unbearable; unreal n. Impossible; impossible"],"usphone":"ɪmˈpɒsəbl","ukphone":"ɪmˈpɒsəbl"},{"name":"nonsense","trans":["n. Nonsense; nonsense adj. Ridiculous int. nonsense!"],"usphone":"ˈnɒnsns","ukphone":"ˈnɒnsns"},{"name":"overload","trans":["v. (Overload), overload; (overload) the power system; (overload) the power system n. Overload"],"usphone":"ˌəʊvəˈləʊd","ukphone":"ˌəʊvəˈləʊd"},{"name":"prefix","trans":["n. Prefix vt. add a prefix; add something in front"],"usphone":"ˈpriːfɪks","ukphone":"ˈpriːfɪks"},{"name":"award","trans":["n. Award; increase (of income); award (compensation); award (of graduation certificate, etc.); scholarship v. awarding (something) (someone); giving (contract, commission) to (person, organization) n. (Award) (US) Everard (name of person)"],"usphone":"əˈwɔːd","ukphone":"əˈwɔːd"},{"name":"craft","trans":["n. Crafts; craftsmanship; spaceships vt. Exquisitely crafting n. (Craft) names; (English, German, Russian) Kraft"],"usphone":"krɑːft","ukphone":"krɑːft"},{"name":"holiday","trans":["n. Holidays; holidays; days off vi. The name of the person who went on vacation n. (Holiday); (English) Holliday"],"usphone":"ˈhɒlədeɪ; ˈhɒlədi","ukphone":"ˈhɒlədeɪ; ˈhɒlədi"},{"name":"poem","trans":["n. Poems"],"usphone":"ˈpəʊɪm","ukphone":"ˈpəʊɪm"},{"name":"Ramadan","trans":["n. Ramadan (September in the Islamic calendar, equal to Ramazan)"],"usphone":"ˈræmədæn","ukphone":"ˈræmədæn"},{"name":"boulder","trans":["n. Pebbles, large boulders; boulders"],"usphone":"ˈbəʊldə(r)","ukphone":"ˈbəʊldə(r)"},{"name":"brave","trans":["adj. Brave, fearless; brave; novel, brand-new; gorgeous, spectacular; excellent; cheerful v. brave, take (risk); show bravery, show bravery n. Brave; American Indian warrior; (ancient) bully n. (Brave) (American, Russian, Indian) (American, Russian, Indian) Brave (name)"],"usphone":"breɪv","ukphone":"breɪv"},{"name":"corn","trans":["n. (US) corn; (English) grains; [skin] corns vt. Marinate; granulate n. (Corn) person's name; (English, French, Swedish) Cohn"],"usphone":"kɔːn","ukphone":"kɔːn"},{"name":"farmer","trans":["n. Farmer, farmer n. (Farmer) name; (English) Farmer; (French) Farmer; (West) Farmer"],"usphone":"ˈfɑːmə(r)","ukphone":"ˈfɑːmə(r)"},{"name":"scare","trans":["v. (to) be afraid; frightened; frightened n. Fear; frightened; (social) great panic adj. appalling"],"usphone":"skeə(r)","ukphone":"skeə(r)"},{"name":"scarecrow","trans":["n. Scarecrow, menace; ragged-clothed person"],"usphone":"ˈskeəkrəʊ","ukphone":"ˈskeəkrəʊ"},{"name":"tractor","trans":["n. Tractors; tractors"],"usphone":"ˈtræktə(r)","ukphone":"ˈtræktə(r)"},{"name":"bumpy","trans":["adj. bumpy; bumpy"],"usphone":"ˈbʌmpi","ukphone":"ˈbʌmpi"},{"name":"mollusk","trans":["n. (American) [spineless] mollusks"],"usphone":"'mɒləsk","ukphone":"'mɒləsk"},{"name":"shell","trans":["n. Shell, shell; shell; shape vi. peeling; setting the position of the command line interpreter vt. Peeling; bombardment"],"usphone":"ʃel","ukphone":"ʃel"},{"name":"skeleton","trans":["n. Skeleton, skeleton; outline; skinny person adj. skeletal; skinny; general"],"usphone":"ˈskelɪtn","ukphone":"ˈskelɪtn"},{"name":"spotted","trans":["adj. spotted; spotted; spotted; stained v. discovered (past participle of spot); tainted; stained n. (Spotted) person's name; (English) Spotted"],"usphone":"ˈspɒtɪd","ukphone":"ˈspɒtɪd"},{"name":"attractive","trans":["adj. appealing; charismatic; attention-grabbing"],"usphone":"əˈtræktɪv","ukphone":"əˈtræktɪv"},{"name":"friendly","trans":["adj. Friendly; affectionate; supportive; friendly, and harmonious adv. kindly; gently n. (Friendly) person's name; (English) Flandley"],"usphone":"ˈfrendli","ukphone":"ˈfrendli"},{"name":"harmless","trans":["adj. harmless; not malicious"],"usphone":"ˈhɑːmləs","ukphone":"ˈhɑːmləs"},{"name":"rainy","trans":["adj. Rainy; rainy n. (Rainy) name; (English) Rainey"],"usphone":"ˈreɪni","ukphone":"ˈreɪni"},{"name":"suffix","trans":["n. Suffix, ending with v. add suffix"],"usphone":"ˈsʌfɪks","ukphone":"ˈsʌfɪks"},{"name":"useful","trans":["adj. useful, helpful; helpful"],"usphone":"ˈjuːsfl","ukphone":"ˈjuːsfl"},{"name":"bend","trans":["v. bend, bend; yield; turn, turn; tilt, deflect; bend (limb, etc.); distort, tamper; force, concentrate; tie, bind (cable) n. Turn, curve; bend; bind; (diver's) decompression sickness (the bends); (on the coat of arms) diagonal stripes n. (Bend) (American, Dan, Germany) Bender (name of person)"],"usphone":"bend","ukphone":"bend"},{"name":"glide","trans":["vi. Glide; glide; walk quietly; disappear vt. Make glide; make slide n. Glide; glide; slide; slide"],"usphone":"ɡlaɪd","ukphone":"ɡlaɪd"},{"name":"rider","trans":["n. Riders; Enclosures; Armrests n. (Rider) Name; (English) Ryder; (West) Riddle"],"usphone":"ˈraɪdə(r)","ukphone":"ˈraɪdə(r)"},{"name":"steer","trans":["vt. Control, guidance; driving vi. Drive, take the helm; drive n. Steer n. (Steer) name; (English) Steer; (German, German) Steer"],"usphone":"stɪə(r)","ukphone":"stɪə(r)"},{"name":"travel","trans":["v. Long-distance travel; passing through (a region); (informal) able to withstand travel; (object, radiation); moving (object, radiation); withstanding long-distance transportation; widely distributed; loved; walking (with ball); (informal) rapid movement of vehicles n. Travel (equipment); range of motion (or speed, mode) (of machine components)"],"usphone":"ˈtrævl","ukphone":"ˈtrævl"},{"name":"defend","trans":["vt. Defense; defense vi. defend; defend"],"usphone":"dɪˈfend","ukphone":"dɪˈfend"},{"name":"fetch","trans":["vt. Take; Receive; Arrive; Attract vi. Take; take; sell n. Acquire; trick"],"usphone":"fetʃ","ukphone":"fetʃ"},{"name":"gather","trans":["vt. Gather; harvest; gather...; wrinkle... vi. Agglomeration; suppuration; wrinkles n. Gathering; clothing folds; yield n. (Gather) name; (German) Gart"],"usphone":"ˈɡæðə(r)","ukphone":"ˈɡæðə(r)"},{"name":"solve","trans":["vt. Solve; Answer; Dissolve vi. Answer"],"usphone":"sɒlv","ukphone":"sɒlv"},{"name":"deep","trans":["adj. Deep, profound; deep; deep; deep; dark; deep, deep; sleeping; serious; deep; deep; deep in the city; marginal adv. Deep, deep; marginal ground n. Deep; ocean; (cricket) peripheral field n. (Deep) Deep (name of person)"],"usphone":"diːp","ukphone":"diːp"},{"name":"fast","trans":["adj. Fast, quick; tight, steady adv. Quickly; tightly; thoroughly vi. Fasting, fasting n. Fasting; hunger strike n. (Fast) person name; (Germany, English, Russian, Finland, Czech, Sweden) Fast"],"usphone":"fɑːst","ukphone":"fɑːst"},{"name":"tongue","trans":["n. Tongue; language vt. Lick; rebuke; blow with tongue vi. Speaking; wind instrument n. (Tongue) person's name; (English) Tang"],"usphone":"tʌŋ","ukphone":"tʌŋ"},{"name":"bird","trans":["n. Birds; guys; badminton vt. Cheer for...; cheer vi. Bird hunting; observational study of wild birds n. (Bird) name; (English, Spanish) Bird"],"usphone":"bɜːd","ukphone":"bɜːd"},{"name":"migrate","trans":["vi. Move; migrate with the seasons; move to vt. make emigrate; make transplant"],"usphone":"maɪˈɡreɪt","ukphone":"maɪˈɡreɪt"},{"name":"return","trans":["v. Return; (particularly feeling) recover; return...; return...; return (ball) with...; return (ball) n. Return; recover; return; hit back the ball (tennis, etc.); returned object; circuit wire adj. Back and forth; touring; repaying; returning;"],"usphone":"rɪˈtɜːn","ukphone":"rɪˈtɜːn"},{"name":"survive","trans":["vt. Survive; survive; survive; live longer than... vi. Survive; survive"],"usphone":"səˈvaɪv","ukphone":"səˈvaɪv"},{"name":"explain","trans":["v. Explanation; explanation"],"usphone":"ɪkˈspleɪn","ukphone":"ɪkˈspleɪn"},{"name":"left","trans":["adj. The one on the left; the one on the left; the rest of the adv. On the left n. left; leftists; activists v. leave (past tense of leave)"],"usphone":"left","ukphone":"left"},{"name":"save","trans":["vt. Save; Save; Save; Rescue vi. Save; save prep. Other than... n. Rescue n. (Save) person's name; (France) Saf; (Italy, Poland, West, Russia, Sweden) Savey (female name), Savey (female name)"],"usphone":"seɪv","ukphone":"seɪv"},{"name":"board","trans":["n. Board of directors; boards; decks; meals vt. Onboard (plane, car, boat, etc.); cover with a board; provide accommodation vi. Boarding n. (Board) name; (English, Spanish) Bode"],"usphone":"bɔːd","ukphone":"bɔːd"},{"name":"bored","trans":["adj. Boring; uninteresting; annoying v. to bore (past tense of bore); bothersome"],"usphone":"bɔːd","ukphone":"bɔːd"},{"name":"bounce","trans":["v. Bounce; bounce; bounce; play with the child upside down on your lap; shake up and down; walk bounce; walk bouncing; return (check); tentatively reveal (idea); return (email); dismissal; eviction; intimidate (someone) to do; ask for other people's opinions; impact n. Bounce; elasticity; vitality; (sudden) rise; full confidence; elasticity (of hair); collision"],"usphone":"baʊns","ukphone":"baʊns"},{"name":"enough","trans":["Adv. Sufficiently, sufficiently n. Many; sufficient adj. Sufficient int. That's enough!"],"usphone":"ɪˈnʌf","ukphone":"ɪˈnʌf"},{"name":"hut","trans":["n. Hut; temporary barracks vt. Stay in a cabin; stay vi. Living in a hut; name of person stationed n. (Hut); (Arabic, Russian, Saudi) Hut"],"usphone":"hʌt","ukphone":"hʌt"},{"name":"roof","trans":["n. Roof; highest point, top; maximum vt. Build a roof for... and cover n. (Roof) person's name; (English) Ruff"],"usphone":"ruːf","ukphone":"ruːf"},{"name":"seed","trans":["n. Seed; basis; semen; germination; offspring; origin vt. Sowing; fruiting; maturing; leaving... seeds vi. Sowing; (plant) fruiting n. (Seed) person's name; (English) seed"],"usphone":"siːd","ukphone":"siːd"},{"name":"sunflower","trans":["n.Sunflowers"],"usphone":"ˈsʌnflaʊə(r)","ukphone":"ˈsʌnflaʊə(r)"},{"name":"outgrow","trans":["vt. Too big to fit; born; grown mature and no longer"],"usphone":"ˌaʊtˈɡrəʊ","ukphone":"ˌaʊtˈɡrəʊ"},{"name":"streamer","trans":["n. Colored paper tape; decorative tape; long flag; banner n. (Streamer) name; (English) Streamer"],"usphone":"ˈstriːmə(r)","ukphone":"ˈstriːmə(r)"},{"name":"superhero","trans":["n.Superheroes"],"usphone":"ˈsuːpəhɪərəʊ; ˈsjuːpəhɪərəʊ","ukphone":"ˈsuːpəhɪərəʊ; ˈsjuːpəhɪərəʊ"},{"name":"used","trans":["adj. habitual; used, used v. used (past tense of use); (used to) used in the past"],"usphone":"juːst","ukphone":"juːst"},{"name":"doughnut","trans":["n. Fried circle cake; circle diagram; annular object, electron cyclotron accelerator annular vacuum chamber"],"usphone":"ˈdəʊnʌt","ukphone":"ˈdəʊnʌt"},{"name":"great","trans":["adj. great, significant; excellent, good; major n. masters; great people; great people"],"usphone":"ɡreɪt","ukphone":"ɡreɪt"},{"name":"number","trans":["n. Numbers; periods (magazines, etc.); numbers; numbers; arithmetic vi. Included; total reached vt. Number; count; number...; limit the number"],"usphone":"ˈnʌmbə(r)","ukphone":"ˈnʌmbə(r)"},{"name":"stronger","trans":["adj. Stronger"],"usphone":"strɒŋgə(r)","ukphone":"strɒŋgə(r)"},{"name":"ten","trans":["num. Ten, ten n. (Ten) (American, Russian, Canada, German, Dutch, Spanish, English) (name)"],"usphone":"ten","ukphone":"ten"},{"name":"zero","trans":["n. Zero point, zero degree num. Zero n. (Zero) person's name; (Italian) Zero"],"usphone":"ˈzɪərəʊ","ukphone":"ˈzɪərəʊ"},{"name":"bitter","trans":["adj. bitter; painful; sharp; full of hate n. bitterness; bitter beer adv. Fiercely; bitterly cold vt. Make bitter n. (Bitter) name; (English, French, German, Fen, Jie,) bit"],"usphone":"ˈbɪtə(r)","ukphone":"ˈbɪtə(r)"},{"name":"flavor","trans":["n. Feelings, flavors; spices; taste vt. Add flavor to"],"usphone":"'fleɪvə","ukphone":"'fleɪvə"},{"name":"salty","trans":["adj. salty; salty"],"usphone":"ˈsɔːlti; ˈsɒlti","ukphone":"ˈsɔːlti; ˈsɒlti"},{"name":"sour","trans":["adj. Acidic; fermented; harsh; sour; nasty vi. Fermentation; turning sour; boredom vt. Make sour; disappoint n. Sour; Suffering n. (Sour) name; () search"],"usphone":"ˈsaʊə(r)","ukphone":"ˈsaʊə(r)"},{"name":"sweet","trans":["adj. Sweet; sweet; aromatic; kind; fun; aromatic; baby () cool name; (English) Sweet; (English) Sweet"],"usphone":"swiːt","ukphone":"swiːt"},{"name":"taste","trans":["n. Taste; taste; aesthetics vt. Taste; experience vi. Tastes; has the taste of... n. (Taste) person's name; (France) Taster"],"usphone":"teɪst","ukphone":"teɪst"},{"name":"owner","trans":["n. [through] owner; owner"],"usphone":"ˈəʊnə(r)","ukphone":"ˈəʊnə(r)"},{"name":"thank you","trans":["Thankyou"],"usphone":"ˈθæŋk juː","ukphone":"ˈθæŋk juː"},{"name":"Thanksgiving","trans":["n. Gratitude"],"usphone":"ˌθæŋksˈɡɪvɪŋ","ukphone":"ˌθæŋksˈɡɪvɪŋ"},{"name":"blow","trans":["v. (wind) blow; blow; blow; blow; blow; blow; blow (nose); melt, burn; explode; leak; leave abruptly; waste (money, opportunity); (ancient) bloom; (flies) lay eggs in; (whales) spray water; mess up...; chirp (car horn); blow (glass); blow (glass); blow egg yolk and egg whites out of the eggshell n. blow; blow; blow your nose; (informal jazz) Performance; (informal) cannabis; (steelmaking term) blowing; (ancient) flowering, flowering period int. Oops (indicates boredom)"],"usphone":"bləʊ","ukphone":"bləʊ"},{"name":"huff","trans":["v. Speak angrily; blow... inflate; blow; anger, anger; contempt; intimidate; smell (gasoline, solvent) as a stimulant; (in international checkers) remove (pieces that the opponent could have eaten) n. Angry, irritated n. (Huff) (US) Huff (name of person)"],"usphone":"hʌf","ukphone":"hʌf"},{"name":"puff","trans":["v. Eject, unfold; expand, expand; smoke (cigarette, pipe); spray (engine, chimney, or stove, etc.); jet forward; gasp; exaggerate; complacency; promote n. (cigarette) breathing; a burst of (breath or wind); (informal) breathing; touted articles; duck down; puff; puff; puff; puff (puff) (puff) (person) name)"],"usphone":"pʌf","ukphone":"pʌf"},{"name":"straw","trans":["n. Straws; straws; worthless things adj. Straw's; worthless n. (Straw) person's name; (English) Straw"],"usphone":"strɔː","ukphone":"strɔː"},{"name":"warn","trans":["vt. Warnings, Reminders; Notices vi. Issue a warning, issue a notice n. (Warn) person's name; (English) Vaughn; (de) Vaughn"],"usphone":"wɔːn","ukphone":"wɔːn"},{"name":"brag","trans":["v. Bragging, bragging; boasting n. Blige (a simplified form of poker); bragging, boasting adj. Excellent; first-class (informal) n. (Brag) (Ukraine, America, Switzerland, Denmark, Germany) Prague (personal name)"],"usphone":"bræɡ","ukphone":"bræɡ"},{"name":"hare","trans":["n. Hare n. (Hare) name; (India) Harley; (English) Hale; (France) Al"],"usphone":"heə(r)","ukphone":"heə(r)"},{"name":"pass","trans":["v. Pass, pass; advance in a direction; achieve (a certain position); pass; pass; pass; pass; pass; pass; pass; pass by vote (law, etc.); pass; discharge; circulation; abandon n. Pass; pass; pass; pass; pass; pass; leap; stage; fishway; (bridge) doesn't call; stabbing (in fencing); trick; (computer) browsing n. (Germany) Pass (in fencing) English) Paz (personal name)"],"usphone":"pɑːs","ukphone":"pɑːs"},{"name":"steady","trans":["adj. Stable; unchanging; calm vi. Stable vt. stabilize; stabilize; make firm adv. Stable; stable n. Couple in a fixed relationship; fixed bracket"],"usphone":"ˈstedi","ukphone":"ˈstedi"},{"name":"tortoise","trans":["n. Turtles, [spine] turtles (equal to testudo); slow people"],"usphone":"ˈtɔːtəs","ukphone":"ˈtɔːtəs"},{"name":"delivery","trans":["n. [trade] delivery; delivery; delivery"],"usphone":"dɪˈlɪvəri","ukphone":"dɪˈlɪvəri"},{"name":"garbage","trans":["n. Garbage; waste n. (Garbage) person's name; (France) Gal Ba fever"],"usphone":"ˈɡɑːbɪdʒ","ukphone":"ˈɡɑːbɪdʒ"},{"name":"tow","trans":["v. Drag; tow; pull n. Drag; coarse hemp fiber; towing tool n. (Tow) (US, Singapore, Malaysia) road (name of person)"],"usphone":"təʊ","ukphone":"təʊ"},{"name":"truck","trans":["n. Trucks; Deals; Trolleys vi. Driving a truck; bartering vt. transaction; transportation by truck adj. (US) truck's n. (Truck) name; (German) Truk"],"usphone":"trʌk","ukphone":"trʌk"},{"name":"avoid","trans":["vt. avoid; avoid, evade; eliminate"],"usphone":"əˈvɔɪd","ukphone":"əˈvɔɪd"},{"name":"hidden","trans":["adj. Hidden v. hide, hide (past participle of hide) n. (Hidden) person's name; (English) hidden"],"usphone":"'hɪdn","ukphone":"'hɪdn"},{"name":"narrow","trans":["adj. Narrow, finite; marginal; precise; small measured n. Strait; narrow part, narrow part, narrow road vt. Make it narrower vi. narrows"],"usphone":"ˈnærəʊ","ukphone":"ˈnærəʊ"},{"name":"bigger","trans":["adj. Bigger (big comparison level) n. (Bigger) person name; (English) Big"],"usphone":"bɪgə(r)","ukphone":"bɪgə(r)"},{"name":"equal","trans":["adj. Equal; equal; competent vt. Equal to; comparable to n. Opponents; rivals; peers; equal things"],"usphone":"ˈiːkwəl","ukphone":"ˈiːkwəl"},{"name":"mad","trans":["adj. crazy; crazy; stupid; fascinated n. Furious"],"usphone":"mæd","ukphone":"mæd"},{"name":"share","trans":["v. Sharing, sharing; distribution; having the same feelings (or experiences); sharing n. shares, shares; responsibility, contribution n. (Share) (US) Sharley (name of person)"],"usphone":"ʃeə(r)","ukphone":"ʃeə(r)"},{"name":"air conditioner","trans":["n. Air conditioners, air conditioning equipment (= air-conditioning)"],"usphone":"ˈeə kəndɪʃənə(r)","ukphone":"ˈeə kəndɪʃənə(r)"},{"name":"dishwasher","trans":["n. Dishwashers; dish washers"],"usphone":"ˈdɪʃwɒʃə(r)","ukphone":"ˈdɪʃwɒʃə(r)"},{"name":"dryer","trans":["n. Dryer; [Additives] Desiccant n. (Dryer) person's name; (English) Dryer"],"usphone":"ˈdraɪə(r)","ukphone":"ˈdraɪə(r)"},{"name":"less","trans":["det. Fewer amounts; fewer (or fewer) quantities adj. Lower ranked; secondary adv. Less in scope; less; far less, not at all prep. Subtract, remove (as a preposition) n. (Less) (US, Canada) Rice (person name)"],"usphone":"les","ukphone":"les"},{"name":"arch","trans":["n. Arched, arched; arch adj. The main vt. Bend... into an arch; connect vi with an arch. Arch up; become a bow-shaped n. (Arch) person's name; (German) Arch; (English) Archie"],"usphone":"ɑːtʃ","ukphone":"ɑːtʃ"},{"name":"cobra","trans":["n. Cobra; (Australian) head n. (Cobra) name; (Western) Kovra; (French, Italian, Portuguese) Cobra"],"usphone":"ˈkəʊbrə","ukphone":"ˈkəʊbrə"},{"name":"pose","trans":["vt. Cause, form; pose; pretend; propose... discuss vi. posing; pretending; manipulating n. Poses, postures; pretending"],"usphone":"pəʊz","ukphone":"pəʊz"},{"name":"reach","trans":["vi. Reach; extend; reach out; spread vt. Reach; Impact; Reach; Extend n. Scope; Extension; River Section; Cross Wind Drive n. (Reach) Name; (Invitation)"],"usphone":"riːtʃ","ukphone":"riːtʃ"},{"name":"yoga","trans":["n. (India) Yoga, Yoga Technique, Yoga Pi"],"usphone":"ˈjəʊɡə","ukphone":"ˈjəʊɡə"},{"name":"live","trans":["v. Live; Live; Live; Live; Retain, Remember; Grow, Inhabit; Live by...; (Boat) Not Sinking; Place, Shelter; Enjoy a Wonderful Life; Experience, Live Adj. Live; live; live; live; electrified; still explosives; burning; lactic acid bacteria; currently important; effective; rotating (wheel or shaft in the machine); in a racing state; vivid, energetic n. (Live) (N., Fin, India, Russian, American, Dutch) (name of person)"],"usphone":"lɪv; laɪv","ukphone":"lɪv; laɪv"},{"name":"odd","trans":["adj. Odd; weird; leftover; temporary; scattered n. Odd; Strange; Strange thing n. (Odd) person name; (English, Western, Norwegian, Swedish) Aude"],"usphone":"ɒd","ukphone":"ɒd"},{"name":"pet","trans":["n. Pets; angry; loved ones vt. Love vi. Angry; caressing adj. Favorite n. (Pet) person's name; (Russian) Pet; ()"],"usphone":"pet","ukphone":"pet"},{"name":"president","trans":["n. President; Chairman; President; Chairman"],"usphone":"ˈprezɪdənt","ukphone":"ˈprezɪdənt"},{"name":"zoo","trans":["n. Zoo n. (Zoo) person's name; (North Korea) Zhu; (Arabic) father"],"usphone":"zuː","ukphone":"zuː"},{"name":"armor","trans":["n. Armor; armor, bulletproof steel plate; armored forces, armored vehicles; protective outer layer (animal or plant); defense (emotional, social, etc.) v. armor for...; providing (emotional, etc.) defense for... n. (Armor) (American, English, French) Amor (personal name)"]},{"name":"oyster","trans":["n. Oysters, [spine-free] oysters; silent people"],"usphone":"ˈɔɪstə(r)","ukphone":"ˈɔɪstə(r)"},{"name":"pearl","trans":["n. Pearls; pearl-colored; outstanding people; rare adj. Pearl-studded; pearl-shaped vi. Pick pearls; form pearls vt. Make bead-shaped; decorate with pearls; make pearl-colored"],"usphone":"pɜːl","ukphone":"pɜːl"},{"name":"cub","trans":["n. Juveniles; young people who don't understand the rules vi. Giving birth to young animals"],"usphone":"kʌb","ukphone":"kʌb"},{"name":"honey","trans":["n. Honey; baby; sweet adj. Luscious; honey-like vt. Sweet talk about right...; add honey to make it sweet vi. Flattering; saying sweet words n. (Honey) person's name; (English) Honey"],"usphone":"ˈhʌni","ukphone":"ˈhʌni"},{"name":"missing","trans":["adj. missing; missing v. missed (ing form of miss); missed; missing n. (Missing) person's name; (de) Missing"],"usphone":"ˈmɪsɪŋ","ukphone":"ˈmɪsɪŋ"},{"name":"seen","trans":["vi. see; understand (past participle of see) vt. See; meet; watch n. (Seen) (US) Mori (name of person)"],"usphone":"siːn","ukphone":"siːn"},{"name":"worried","trans":["adj. worried"],"usphone":"ˈwʌrid","ukphone":"ˈwʌrid"},{"name":"crop","trans":["n. Yield; Crops; Crops; Flathead vt. Plant; Harvest; Prune; Shorten vi. reaping"],"usphone":"krɒp","ukphone":"krɒp"},{"name":"dam","trans":["n. 10 meters (equal to decametre); dams; reservoirs; rubber barriers (in dental surgery); mother animals v. building dams; blocking, controlling n. (dam) (American) dan (name of person)"],"usphone":"dæm","ukphone":"dæm"},{"name":"goods","trans":["n. Commodities; movable property; agreed persons; real skills"],"usphone":"ɡʊdz","ukphone":"ɡʊdz"},{"name":"wonder","trans":["v. Wanting to know; not knowing (when asking); being puzzled; surprised; amazed n. Surprised; miracles; capable people; something with special effects adj. Excellent, spiritual; amazing n. (Wonder) (US) Wonder (name of person)"],"usphone":"ˈwʌndə(r)","ukphone":"ˈwʌndə(r)"},{"name":"exercise","trans":["n. Exercise; Practice; Use; Practice; Prayer; Ceremony vt. Exercise; practice; use; keep busy; frighten vi. Exercise; practice"],"usphone":"ˈeksəsaɪz","ukphone":"ˈeksəsaɪz"},{"name":"hungry","trans":["adj. hungry; hungry; desolate; futile"],"usphone":"ˈhʌŋɡri","ukphone":"ˈhʌŋɡri"},{"name":"mood","trans":["n. Mood, tone; mood; atmosphere n. (Mood) name; (English) Mood; (Sweden) Maud"],"usphone":"muːd","ukphone":"muːd"},{"name":"sweat","trans":["n. Sweating; Sweating; (informal) anxiety; (informal) heavy work; (informal) hard work; (informal) hard work; sportswear (or pants) v. sweating; seeping moisture (from the surface of an object); causing (humans, animals) to sweat; trying to dry; (informal) worry; use of fire; welding (metal) n. (Sweat) (US) Siviat (name of person)"],"usphone":"swet","ukphone":"swet"},{"name":"chore","trans":["n. Household chores; routine, sporadic tasks; annoying or tiring work"],"usphone":"tʃɔː(r)","ukphone":"tʃɔː(r)"},{"name":"clean","trans":["adj. Clean, clean; innocent vt. Make it clean vi. Clean, clean adv. Completely n. Clean n. (Clean) person's name; (English) Klein"],"usphone":"kliːn","ukphone":"kliːn"},{"name":"toss","trans":["v. throw, throw; throw (head); bump; shake; turn (pancake) upside down; throw a coin decision; (horse) drop (rider); (informal) search (somewhere) n. decide to throw a coin; raise your head (in anger); throw n. (Toss) (US) Toss (name of person)"],"usphone":"tɒs","ukphone":"tɒs"},{"name":"trash","trans":["n. Garbage; waste vt. Discard; prune branches"],"usphone":"træʃ","ukphone":"træʃ"}]